[{"sector": "Consumer Non-Durables", "name": "22nd Century Group, Inc", "exchange": "AMEX", "symbol": "XXII", "beta": "2.86", "industry": "Farming/Seeds/Milling", "description": "22nd Century Group, Inc. is a plant biotechnology company. The Company is focused on technology that allows increasing or decreasing the level of nicotine and other nicotinic alkaloids in tobacco plants, and levels of cannabinoids in cannabis plants through genetic engineering and plant breeding. It is engaged in various activities, including research and development of less harmful or modified risk tobacco products and tobacco plant varieties; development of X-22, a smoking cessation aid consisting of very low nicotine (VLN) cigarettes; manufacture, marketing and distribution of its RED SUN and MAGIC cigarettes; production of SPECTRUM research cigarettes for the National Institute on Drug Abuse (NIDA); contract manufacturing of third-party branded tobacco products, and research and development of plant varieties of hemp/cannabis, such as plants with low to no amounts of delta-9-tetrahydrocannabinol (THC), plants with high levels of cannabidiol (CBD), and other non-THC cannabinoids."}, {"sector": "n/a", "name": "Aberdeen Asia-Pacific Income Fund Inc", "exchange": "AMEX", "symbol": "FAX", "beta": "0.49", "industry": "n/a", "description": "Aberdeen Asia-Pacific Income Fund, Inc. is a non-diversified, closed-end management investment company. The Fund's principal investment objective is to seek current income. The Fund may also achieve incidental capital appreciation. To achieve its investment objectives, the Fund invests approximately 80% of its net assets, plus the amount of any borrowings for investment purposes, in Asian debt securities, Australian debt securities and New Zealand debt securities. The Fund invests in corporate bonds, government bonds, supranational and short-term investments. The Fund's investment portfolio spans across various regions, including the United States, Australia, the United Kingdom, India, Norway, Germany, the Netherlands, Bangladesh, South Korea, Philippines, Malaysia, Singapore, Thailand, Hong Kong, Indonesia, China and Sri Lanka. Aberdeen Asset Management Limited serves as the investment advisor of the Fund. Aberdeen Asset Management Asia Limited is the investment manager of the Fund."}, {"sector": "n/a", "name": "Aberdeen Australia Equity Fund Inc", "exchange": "AMEX", "symbol": "IAF", "beta": "0.85", "industry": "n/a", "description": "Aberdeen Australia Equity Fund, Inc. is a non-diversified, closed-end management investment company. The Fund's principal investment objective is long-term capital appreciation through investment primarily in equity securities of Australian companies listed on the Australian Stock Exchange Limited. Its secondary objective is current income, which is expected to be derived primarily from dividends and interest on Australian corporate and governmental securities. It invests approximately 80% of its net assets, plus the amount of any borrowings for investment purposes, in equity securities, consisting of common stock, preferred stock and convertible stock, of companies tied economically to Australia. It invests in various sectors, such as financials, materials, healthcare, utilities, energy, telecommunication services and consumer staples. Aberdeen Asset Management Limited is the investment advisor of the Fund. Aberdeen Asset Management Asia Limited is the Fund's investment manager."}, {"sector": "n/a", "name": "Aberdeen Emerging Markets Smaller Company Opportunities Fund I", "exchange": "AMEX", "symbol": "ABE           ", "beta": "", "industry": "n/a", "description": "Abertis Infraestructuras SA is a Spain-based company primarily engaged in the management of highway infrastructure. The Company's activities are divided into two business segments: Toll roads and Telecommunications. The Toll roads division focuses on construction, maintenance and operation of highways, which are located in Spain, France, Brazil, Chile, the United States and Canada, among others. The Telecommunications division manages and operates satellite infrastructure, through Hispasat, and transmission towers for mobile telephony and audiovisual broadcasting, through Cellnex Telecom. The Company controls numerous subsidiaries, such as Abertis Autopistas Espana SA, Abertis Motorways UK Ltd, Autopistas Metropolitanas de Puerto Rico and Abertis Telecom Satelites SA."}, {"sector": "n/a", "name": "Aberdeen Global Income Fund, Inc.", "exchange": "AMEX", "symbol": "FCO", "beta": "0.59", "industry": "n/a", "description": "Aberdeen Global Income Fund, Inc. (the Fund) is a closed-end, non-diversified management investment company. The Fund's principal investment objective is to provide high current income by investing primarily in fixed income securities. As a secondary investment objective, the Fund seeks capital appreciation, but only when consistent with its principal investment objective. The Fund invests in Government Bonds and Corporate Bonds. The Fund invests approximately 80% of its net assets, plus the amount of any borrowings for investment purposes, in debt securities. Approximately 60% of the Fund's total assets are invested in fixed income securities of issuers in Developed Markets or Investment Grade Developing Markets. The Fund invests approximately 40% of its total assets in fixed income securities of issuers in Developed Markets. Aberdeen Asset Management Limited is the investment advisor of the Fund. Its investment manager is Aberdeen Asset Management Asia Limited."}, {"sector": "n/a", "name": "Aberdeen Indonesia Fund, Inc.", "exchange": "AMEX", "symbol": "IF", "beta": "0.85", "industry": "n/a", "description": "Aberdeen Indonesia Fund, Inc. (the Fund) is a non-diversified closed-end, management investment company. The Fund's primary investment objective is long-term capital appreciation with income as a secondary objective, which the Fund seeks to achieve by investing primarily in Indonesian equity and debt securities. The Company invests in a range of sectors, including consumer staples, consumer discretionary, financials, materials, telecommunication services, energy, healthcare and industrials. Aberdeen Asset Managers Limited (AAML) serves as the Fund's investment advisor. AAML is a subsidiary of Aberdeen Asset Management PLC, which is the Fund's Administrator."}, {"sector": "n/a", "name": "Aberdeen Israel Fund, Inc.", "exchange": "AMEX", "symbol": "ISL", "beta": "0.60", "industry": "n/a", "description": "Aberdeen Israel Fund, Inc. (the Fund) is a non-diversified closed-end management investment company. The Fund's principal investment objective is to seek long-term capital appreciation by investing primarily in equity securities of Israeli companies. The Fund may invest up to 30% of its assets (at the time of commitment) in illiquid equity securities, including securities of private equity funds (whether in corporate or partnership form) that invest primarily in emerging markets. The Fund invests in various sectors, such as information technology, financials, healthcare, materials, consumer staples, telecommunication services, industrials, consumer discretionary. Aberdeen Asset Managers Limited (AAML) serves as the Fund's investment advisor. AAML is a subsidiary of Aberdeen Asset Management PLC, which is the Fund's Administrator."}, {"sector": "Capital Goods", "name": "Acme United Corporation.", "exchange": "AMEX", "symbol": "ACU", "beta": "0.81", "industry": "Industrial Machinery/Components", "description": "Acme United Corporation is a supplier of cutting, measuring, first aid and sharpening products to the school, home, office, hardware, sporting goods and industrial markets. The Company operates in three segments: United States (including Asian operations), Canada and Europe. Its operations in the United States, Canada and Europe are involved in product development, marketing, sales, administrative and distribution activities. Its product offerings across various segments include scissors, shears, knives, rulers, pencil sharpeners, and related products, which are sold primarily to wholesale, contract and retail stationery distributors, office supply super stores, mass market retailers, industrial distributors, school supply distributors, drug store retailers, sporting goods stores, hardware chains and wholesale florists. It markets and sells in various brands, such as Westcott brand, First Aid Only, PhysiciansCare and Pac-Kit brands."}, {"sector": "Health Care", "name": "Actinium Pharmaceuticals, Inc.", "exchange": "AMEX", "symbol": "ATNM", "beta": "42.72", "industry": "Major Pharmaceuticals", "description": "Actinium Pharmaceuticals, Inc. (Actinium) is a clinical-stage biopharmaceutical company engaged in developing cancer treatments. The Company is engaged in developing therapies for diseases using its alpha particle immunotherapy platform and other related technologies. The Company's products include Actimab-A, an antibody-drug construct containing actinium 225 (Ac-225), and Iomab-B, an antibody-drug construct containing iodine 131 (I-131). Actimab-A is in human clinical trials stage for acute myeloid leukemia (AML) and Iomab-B in clinical trial stage for use in myeloconditioning for hematopoietic stem cells transplantation (HSCT) in various indications. Its products under development are monoclonal antibodies labeled with radioisotopes. It has four product candidates in clinical trials: Actimab-A (HuM195-Ac-225), Iomab-B (BC8-I-131), BC8-Y-90 and BC8-SA. It is pursuing development of Actimab-A and Iomab-B, while BC8-Y-90 and BC8-SA are in physician sponsored clinical phase I trials."}, {"sector": "Energy", "name": "Adams Resources & Energy, Inc.", "exchange": "AMEX", "symbol": "AE", "beta": "1.32", "industry": "Oil Refining/Marketing", "description": "Adams Resources & Energy, Inc., along with its subsidiaries, is engaged in the business of crude oil marketing, tank truck transportation of liquid chemicals, and oil and gas exploration and production. The Company's segments include Marketing Segment, Transportation Segment, and Oil and Gas Segment. The Company manages its Marketing Segment through its subsidiary, Gulfmark Energy, Inc., which is engaged in marketing of crude oil. It operates approximately 210 tractor-trailer rigs and maintains over 120 pipeline inventory locations or injection stations. The Company operates its Transportation Segment, through Service Transport Company, which transports liquid chemicals. Its Service Transport Company subsidiary operates over 320 truck tractors, of which over 290 are Company-owned with over 30 independent owner-operator units. The Oil and Gas Segment operates through Adams Resources Exploration Corporation subsidiary, which explores and develops domestic oil and natural gas properties."}, {"sector": "Health Care", "name": "Adcare Health Systems Inc", "exchange": "AMEX", "symbol": "ADK", "beta": "0.96", "industry": "Hospital/Nursing Management", "description": "AdCare Health Systems, Inc., through its subsidiaries, is a self-managed real estate investment company that invests in real estate purposed for long-term care and senior living. The Company's business principally consists of leasing and subleasing such facilities to third-party tenants, which operate the facilities. The Company owns, leases, or manages for third parties approximately 40 facilities mainly in the Southeast. Its portfolio consists of over 30 skilled nursing facilities, approximately two assisted living facilities and an independent living facility. The Company's facilities provide a range of healthcare and related services to patients and residents, including skilled nursing and assisted living services, social services, various therapy services, and other rehabilitative and healthcare services for both long-term and short-stay patients and residents."}, {"sector": "n/a", "name": "Adcare Health Systems Inc", "exchange": "AMEX", "symbol": "ADK^A", "beta": "0.96", "industry": "n/a", "description": "AdCare Health Systems, Inc., through its subsidiaries, is a self-managed real estate investment company that invests in real estate purposed for long-term care and senior living. The Company's business principally consists of leasing and subleasing such facilities to third-party tenants, which operate the facilities. The Company owns, leases, or manages for third parties approximately 40 facilities mainly in the Southeast. Its portfolio consists of over 30 skilled nursing facilities, approximately two assisted living facilities and an independent living facility. The Company's facilities provide a range of healthcare and related services to patients and residents, including skilled nursing and assisted living services, social services, various therapy services, and other rehabilitative and healthcare services for both long-term and short-stay patients and residents."}, {"sector": "Technology", "name": "AeroCentury Corp.", "exchange": "AMEX", "symbol": "ACY", "beta": "-0.64", "industry": "Diversified Commercial Services", "description": "AeroCentury Corp. acquires used regional aircraft and aircraft engines for lease to regional carriers all over the world. The Company's segment is leasing of regional aircraft to foreign and domestic regional airlines. The business of the Company is managed by JetFleet Management Corp. (JMC), an integrated aircraft management, marketing and financing business. JMC is a subsidiary of JetFleet Holding Corp (JHC). The Company has been engaged in the business of investing in used regional aircraft equipment leased to foreign and domestic regional air carriers. The Company owns regional aircraft and engines, which are leased to customers under triple net leases with terms that are less than the useful life of the assets. The Company's aircraft and aircraft engines that were on lease or held for lease includes turboprop aircraft, regional jet aircraft and engines."}, {"sector": "Capital Goods", "name": "Air Industries Group", "exchange": "AMEX", "symbol": "AIRI", "beta": "0.25", "industry": "Military/Government/Technical", "description": "Air Industries Group is an aerospace and defense company. The Company manufactures and designs structural parts and assemblies that focus on flight safety, including landing gear, arresting gear, engine mounts, flight controls, throttle quadrants, jet engines and other components. The Company operates in three segments: Complex Machining, Aerostructures and Electronics and Turbine Engine Components. The Complex Machining segment consists of Air Industries Machining, Corp. and Nassau Tool Works, Inc. The Aerostructures and Electronics segment consists of Welding Metallurgy, Inc., Woodbine Products, Inc., Miller Stuart, Inc., Eur-Pac Corporation, Electronic Connection Corporation and Compac Development Corporation. The Turbine Engine Components segment consists of AMK Welding, Inc. and The Sterling Engineering Corporation, which makes components for jet engines and ground turbines. The Company also provides sheet metal fabrication of aerostructures, tube bending and welding services."}, {"sector": "Basic Industries", "name": "Alexco Resource Corp", "exchange": "AMEX", "symbol": "AXU", "beta": "-0.25", "industry": "Precious Metals", "description": "Alexco Resource Corp. (Alexco) operates two businesses: a mining business, consisting of mineral exploration and mine development and operation in Canada, located in Yukon Territory, and through its Alexco Environmental Group (AEG), an environmental services business, providing consulting, remediation solutions and project management services in respect of environmental permitting and compliance and site remediation, in Canada and the United States. The Company's principal mining business activities are being carried out within the Keno Hill Silver District (KHSD) in Yukon Territory. The KHSD project is located near the village of Keno City, approximately 350 kilometers north of Whitehorse, Yukon. The KHSD property comprises the Flame & Moth, Bellekeno and Lucky Queen deposits, as well as the Onek, Bermingham properties and Elsa Tailings properties. It holds various other property interests within KHSD, including Silver King, Husky and McQuesten, and other properties."}, {"sector": "Basic Industries", "name": "Alio Gold Inc.", "exchange": "AMEX", "symbol": "ALO", "beta": "-0.97", "industry": "Precious Metals", "description": "Alio Gold Inc, formerly Timmins Gold Corp, is a Canada-based gold producer engaged in the operation, development, exploration and acquisition of resource properties in Mexico through its subsidiaries, Timmins Goldcorp Mexico, S.A. de C.V. and Molimentales del Noroeste, S.A. de C.V. (MdN). MdN owns the San Francisco Mine in Sonora, Mexico. MdN also owns the Caballo Blanco Property, an exploration and evaluation asset in Veracruz, Mexico. The Mine and the La Chicharra pit are collectively known as the Gold Property. The Company also holds the Ana Paula gold project, which is an advanced stage development project in the Guerrero Gold Belt. The Guerrero Gold Belt project consists of over two claims totaling approximately 4,200 hectares at the north-west end of the Guerrero Gold Belt, with approximately 38,000 additional hectares in the surrounding area. Ana Paula is located in the north central part of the State of Guerrero in southern Mexico, 180 kilometers from Mexico City."}, {"sector": "Basic Industries", "name": "Almaden Minerals, Ltd.", "exchange": "AMEX", "symbol": "AAU", "beta": "-0.55", "industry": "Precious Metals", "description": "Almaden Minerals Ltd. is exploration- and development-stage company and is engaged in the exploration and development of exploration and evaluation properties in Canada, the United States and Mexico. The Company is engaged in the business of the acquisition of mineral properties. Its principal property interest includes the Tuligtic Property/Project-Mexico. It has interest in ATW Resources Ltd. (ATW) that holds title in trust for the ATW project. It holds an interest in the Logan property located in the Yukon Territory, Canada. It has approximately two subsidiaries, including Puebla Holdings Inc., which is a holding company and Minera Gorrion, S.A. de C.V., which is an exploration company. Its Ixtaca deposit, the epithermal gold-silver target within the Tuligtic Property, is located approximately eight kilometers northwest of the town of San Francisco Ixtacamaxtitlan. The Company has not generated any revenues from its operations."}, {"sector": "Health Care", "name": "Alpha Pro Tech, Ltd.", "exchange": "AMEX", "symbol": "APT", "beta": "1.06", "industry": "Industrial Specialties", "description": "ALPHA PRO TECH, LTD. (Alpha Pro Tech) is in the business of protecting people, products and environments. The Company is engaged in developing, manufacturing and marketing a line of disposable protective apparel and infection control products for the cleanroom, industrial, pharmaceutical, medical and dental markets through its subsidiary, Alpha Pro Tech, Inc. Its products are grouped into three segments: Building Supply, which consists of construction weatherization products, such as housewrap and synthetic roof underlayment, as well as other woven material; Disposable Protective Apparel, which consists of disposable protective apparel, such as shoecovers, bouffant caps, gowns, coveralls, lab coats, frocks and other miscellaneous products, and Infection Control, which consists of face masks and eye shields. The Company also manufactures a line of building supply construction weatherization products through its subsidiary, Alpha ProTech Engineered Products, Inc."}, {"sector": "Finance", "name": "Altisource Asset Management Corp", "exchange": "AMEX", "symbol": "AAMC", "beta": "2.90", "industry": "Real Estate", "description": "Altisource Asset Management Corporation provides asset management and corporate governance services to institutional investors. The Company's primary client is Altisource Residential Corporation (Residential). The Company operates through segment, which is focused on providing asset management and certain corporate governance services to Residential. Its business strategy is to provide asset management services to Residential to generate cash available for distribution to its shareholders and thereby growing its earnings, and develop additional investment strategies and vehicles. Residential is a public real estate investment trust (REIT) that acquires and manages single-family rental properties by acquiring sub-performing and non-performing mortgage loans throughout the United States. In addition to providing services to Residential, it also provides management services to NewSource Reinsurance Company Ltd., which is an insurance and reinsurance company."}, {"sector": "Consumer Non-Durables", "name": "AMCON Distributing Company", "exchange": "AMEX", "symbol": "DIT", "beta": "0.33", "industry": "Food Distributors", "description": "AMCON Distributing Company (AMCON) and its subsidiaries are engaged in the wholesale distribution of consumer products in the Central, Rocky Mountain, and Southern regions of the United States. The Company has two segments: wholesale distribution segment (Wholesale segment) and retail health food segment (Retail Segment). The Wholesale Segment offers retailers the ability to utilize manufacturer- and Company-sponsored sales and marketing programs, merchandising and product category management services. Its Retail Segment has conventional, natural, gourmet and specialty food markets, mass and discount retailers, health food stores, dietary supplement retailers and drug stores, among others. As of September 30, 2016, it operated 16 health food retail stores, six retail health food stores in Florida under the name Chamberlin's Market & Cafe and 10 in the Midwest under the name Akin's Natural Foods Market."}, {"sector": "Consumer Non-Durables", "name": "American Lorain Corporation", "exchange": "AMEX", "symbol": "ALN", "beta": "0.47", "industry": "Packaged Foods", "description": "American Lorain Corporation is a food manufacturing company. The Company develops, manufactures and sells a range of food products, including Chestnut products, Convenience foods and Frozen food products. The Company operates through three segments: Chestnut products, Convenience food products and Frozen food products. The Company manufactures its products in approximately six facilities in China. The Company has four types of product lines: deep-freezing lines, which are used to freeze raw materials for year-round production and to produce frozen food; Canning lines, which are used to produce canned products, including chestnut products; Convenience food lines, which are used for producing ready-to-cook (RTC) food products, ready-to-eat (RTE) food products and meals ready-to- eat (MRE) food products, all of which have nitrogen preservation capacity, and Chinese doughnuts lines, which are used to produce Chinese doughnut products."}, {"sector": "Health Care", "name": "American Shared Hospital Services", "exchange": "AMEX", "symbol": "AMS", "beta": "0.64", "industry": "Medical Specialities", "description": "American Shared Hospital Services provides Gamma Knife stereotactic radiosurgery equipment and radiation therapy and related equipment to approximately 20 medical centers in approximately 20 states in the United States. The Company provides Gamma Knife services through its over 81% indirect interest in GK Financing, LLC (GKF). The Company's business is the outsourcing of stereotactic radiosurgery services and radiation therapy services. The Company provides the equipment, as well as planning, installation, reimbursement and marketing support services. The Company's radiation therapy business consists of one Image Guided Radiation Therapy Operations (IGRT) system. IGRT technology integrates imaging and detection components into a linear accelerator, allowing clinicians to plan treatment, verify positioning and deliver treatment with a single device, providing radiation therapy with less damage to healthy tissue. It is also engaged in proton beam radiation therapy business (PBRT)."}, {"sector": "Health Care", "name": "Ampio Pharmaceuticals, Inc.", "exchange": "AMEX", "symbol": "AMPE", "beta": "0.36", "industry": "Major Pharmaceuticals", "description": "Ampio Pharmaceuticals, Inc. is a biopharmaceutical company. The Company is focused primarily on the development of therapies to treat prevalent inflammatory conditions for which there are limited treatment options. The Company's two lead product candidates in development are Ampion for osteoarthritis of the knee and Optina for diabetic macular edema. Ampion is a sub 5000 molecular weight fraction of commercial human serum albumin (HSA). Optina is a low-dose formulation of danazol. The Ampio segment consists of its biopharmaceuticals compounds and the clinical trials associated with them. The Company is primarily developing compounds that decrease inflammation by inhibiting specific pro-inflammatory compounds by affecting specific pathways at the protein expression and at the transcription level; activating specific phosphatase or depleting available phosphate needed for the inflammation process, and decreasing vascular permeability."}, {"sector": "Health Care", "name": "AmpliPhi Biosciences Corporation", "exchange": "AMEX", "symbol": "APHB", "beta": "2.75", "industry": "Biotechnology: Biological Products (No Diagnostic Substances)", "description": "AmpliPhi Biosciences Corporation is a biotechnology company. The Company is focused on the discovery, development and commercialization of phage therapeutics. The Company is engaged in identifying, characterizing and developing naturally occurring bacteriophages with its collaboration partners in bacteriophage biology, synthetic biology and manufacturing, to develop second-generation bacteriophage products. The Company is engaged in developing these phage product candidates using a discovery and development platform, which is designed for identification, characterization and manufacturing of multiple phage therapies. Each product candidate combines several chosen phages, which target a specific disease-causing bacterial pathogen, such as staphylococcus aureus (S. aureus), Pseudomonas aeruginosa (P. aeruginosa) and clostridium difficile (C. difficile). Its product candidates include AB-SA01, AB-PA01 and AB-CD01."}, {"sector": "Health Care", "name": "Aoxing Pharmaceutical Company, Inc.", "exchange": "AMEX", "symbol": "AXN", "beta": "3.46", "industry": "Major Pharmaceuticals", "description": "Aoxing Pharmaceutical Company, Inc. is a specialty pharmaceutical company specializing in research, development, manufacturing and distribution of a range of narcotic, pain-management and addiction treatment pharmaceutical products. The Company holds approximately 140 drug production certificates covering narcotic pain-management, prescription medicines, over-the-counter (OTC) and active pharmaceutical ingredient (API) products. Its products include prescription drugs, such as Tilidine hydrochloride, Zhongtong'an and Humifuse Euphorbia Herb Tablet, and OTC drugs, such as Shanmei Capsule, Shaoshang Tincture, Yiqi Qiangshen Granule, Xiaopiling Granule, Xiongjushangqing Tablet, Juyuansuanbijia Oral Solutions, Longdanxiegan Tablet, Fenka Tablet, Shujinhuoxue Tablet, Fuketiaojing Tablet, Qingnao Jiangya Tablet, Yuanhu Pain Management Tablet, Bushenqiangshen Tablet, Baiziyangxin Pill, Qingguo Pill, Liuweidihuang Pill, Zhibaidihuang Pill, Xiaoyao Pill and Tianwangbuxin Pill."}, {"sector": "n/a", "name": "Arconic Inc.", "exchange": "AMEX", "symbol": "ARNC^", "beta": "0.90", "industry": "n/a", "description": "Arconic Inc., formerly Alcoa Inc., is engaged in lightweight metals engineering and manufacturing. The Company operates through three segments: Global Rolled Products, Engineered Products and Solutions, and Transportation and Construction Solutions. Its multi-material products, which include aluminum, titanium and nickel, are used around the world in markets, such as aerospace, automotive, commercial transportation and packaging. The Global Rolled Products segment produces a range of aluminum sheet and plate products for the aerospace, automotive, commercial transportation, brazing and industrial markets. The Engineered Products and Solutions segment develops and manufactures products for the aerospace (commercial and defense), commercial transportation and power generation end markets. The Transportation and Construction Solutions segment produces products that are used in the non-residential building and construction and commercial transportation end markets."}, {"sector": "Basic Industries", "name": "Asanko Gold Inc.", "exchange": "AMEX", "symbol": "AKG", "beta": "0.20", "industry": "Mining & Quarrying of Nonmetallic Minerals (No Fuels)", "description": "Asanko Gold Inc. is a gold producer. The Company has operations in the Republic of Ghana. The Company's segments include Canada and Ghana. The Company's principal asset is the Asanko Gold Mine (AGM) located in Ghana, West Africa. The Company's Project 5M will upgrade the plant's throughput to five metric tons per annum and expand mining operations to integrate the Esaase deposit, including the construction of a 27-kilometer overland conveyor. The Company is involved in open pit mining and conventional processing of gold ores mined in its Asanko Gold Mine in Ghana. The AGM concessions are located in the Amansie West district of the Ashanti region of Ghana. The Company holds four mining leases, as well as prospecting and reconnaissance licenses, which collectively make up the AGM and span approximately 30 kilometers strike length of the Asankrangwa Gold Belt. The Akwasiso deposit is located on the Nkran shear corridor. The Nkran Extension is located on the Nkran shear structure."}, {"sector": "Consumer Services", "name": "Ashford Inc.", "exchange": "AMEX", "symbol": "AINC", "beta": "", "industry": "Professional Services", "description": "Ashford Inc. provides asset management and advisory services to other entities, primarily within the hospitality industry. The Company operates in the segment of asset and investment management, which includes managing the day-to-day operations of Ashford Hospitality Prime, Inc. (Ashford Prime) and its subsidiaries. The Company serves as the advisor to Ashford Prime, an New York Stock Exchange (NYSE)-listed real estate investment trust (REIT) that invests primarily in high revenue per available room (RevPAR), luxury, upper-upscale and upscale hotels in gateway and resort locations. The Company also serves as the advisor to Ashford Hospitality Trust, Inc. (Ashford Trust), which is focused on investing opportunistically in the hospitality industry with a focus on upscale and upper-upscale hotels in the United States. The Company conducts its business and owns substantially all of its assets through an operating entity, Ashford Hospitality Advisors LLC (Ashford LLC)."}, {"sector": "Health Care", "name": "Asterias Biotherapeutics, Inc.", "exchange": "AMEX", "symbol": "AST", "beta": "1.56", "industry": "Biotechnology: Biological Products (No Diagnostic Substances)", "description": "Asterias Biotherapeutics, Inc. is a biotechnology company. The Company is engaged in developing and commercializing therapies in the fields of cell therapy and regenerative medicine. The Company has over two technology platforms. The first is an immunotherapy platform to teach cancer patients' immune systems to attack their tumors. The second is pluripotent stem cell platform. Pluripotent cells are a type of stem cell capable of becoming all of the cell types in the human body. From its immunotherapy platform, the Company is developing over two programs. AST-VAC1 (telomerase loaded, autologous dendritic cells), which allows patient's own cells to recognize and fight cancer cells in acute myelogenous leukemia (AML). Together with Cancer Research United Kingdom (CRUK), it is developing AST-VAC2 (telomerase loaded, -allogeneic dendritic cells), -derived from pluripotent stem cells. From its pluripotent stem cell platform, it is developing AST-OPC1, oligodendrocyte progenitor cells."}, {"sector": "n/a", "name": "Asterias Biotherapeutics, Inc.", "exchange": "AMEX", "symbol": "AST.WS", "beta": "0.24", "industry": "n/a", "description": "Western Asset/Claymore Inflation-Linked Opportunities & Income Fund is a diversified, closed-end management investment company. The Fund's investment objective is to provide current income for its shareholders. Capital appreciation is its secondary investment objective. Under normal market conditions, the Fund will invest at least 80% of its total managed assets in inflation-linked securities. It may also invest up to 40% of its total managed assets in below investment grade securities (or if unrated, assets of comparable quality as determined by management). It may invest up to 100% of its total managed assets in non-United States dollar investments, which gives the Fund flexibility to invest up to 100% of its total managed assets in non-United States dollar inflation-linked securities. Its portfolio concentration includes High Yield Corporations; Mortgage Backed Securities; Emerging Markets, and Investment Grade Corporations. Security Investors, LLC is its investment advisor."}, {"sector": "Basic Industries", "name": "Auryn Resources Inc.", "exchange": "AMEX", "symbol": "AUG", "beta": "", "industry": "Precious Metals", "description": "Augean PLC is engaged in the provision of specialist services focused on hazardous waste. The Company operates through five segments: Energy and Construction, which includes a site at Cooks Hole in Northamptonshire where minerals are extracted and also generates energy as electricity from closed landfill cells and operates over three hazardous and non-hazardous landfill operating sites; Radioactive Waste Services, which provides waste disposal services of low level radioactive wastes and naturally occurring radioactive material produced in the United Kingdom; Augean Integrated Services; which operates a High Temperature Incinerator at Sandwich, East Kent and a site in Cannock focused on Total Waste Management solutions; Augean North Sea Services, which provides waste management and waste processing services to offshore oil and gas operators, and Industry and Infrastructure, which provides specialist industrial cleaning services and operates over three waste processing sites."}, {"sector": "Public Utilities", "name": "Avalon Holdings Corporation", "exchange": "AMEX", "symbol": "AWX", "beta": "0.20", "industry": "Environmental Services", "description": "Avalon Holdings Corporation provides waste management services to industrial, commercial, municipal and governmental customers in northeastern and midwestern United States markets, captive landfill management for an industrial customer and salt water injection well operations. The Company operates through two segments. The Company's waste management services segment includes waste disposal brokerage and management services, captive landfill management operations and salt water injection well operations. The golf and related operations segment includes the operation and management of over three golf courses and related clubhouses, a hotel, fitness centers, tennis courts, spa services, dining and banquet and conference facilities and a travel agency. Its subsidiary, American Waste Management Services, Inc., assists customers with managing and disposing of wastes at various treatment and disposal sites. Its golf courses are located in Warren, Ohio, Vienna, Ohio and Sharon, Pennsylvania."}, {"sector": "Basic Industries", "name": "Avino Silver", "exchange": "AMEX", "symbol": "ASM", "beta": "-0.07", "industry": "Precious Metals", "description": "Avino Silver and Gold Mines Ltd is a Canada-based resource company. It is focused on silver, gold, and copper exploration, extraction and processing. It extracts resources and processes a bulk concentrate at the San Gonzalo Mine and a copper concentrate from the Avino Mine, both of which are located on the Avino property in Durango, Mexico. The Avino property consists of approximately 20 mineral concessions, totaling over 1,000 hectares. The Bralorne property consists of approximately 5,000 acres of mineral claims, located northeast of Vancouver, British Columbia, Canada. The Eagle Property, which covers over 500 hectares, is located in the Yukon Territory. The Olympic-Kelvin property totals approximately 600 hectares and is located on the south side of Carpenter Lake. The Minto Property is situated approximately 10 kilometers east of Goldbridge in the Bridge River gold district of British Columbia. The El Laberinto property is situated over 60 kilometers northeast of Durango, Mexico."}, {"sector": "Basic Industries", "name": "B2Gold Corp", "exchange": "AMEX", "symbol": "BTG", "beta": "0.93", "industry": "Precious Metals", "description": "B2Gold Corp. (B2Gold) is a Canada-based gold producer with approximately four operating mines and one mine under construction. The Company has a portfolio of other evaluation and exploration projects in various countries, including Mali, Colombia, Burkina Faso, Finland, Chile and Nicaragua. Its material mineral properties consist of three mines and one mine under construction: Otjikoto mine, an open pit gold mine located approximately 300 kilometers north of Windhoek, the capital of Namibia (Otjikoto Mine); Masbate mine, an open pit gold mine, located near the northern tip of the island of Masbate, over 360 kilometers south-east of Manila (Masbate Gold Project); La Libertad mine, an open pit gold mine located over 110 kilometers due east of Managua and 32 kilometers northeast of Juigalpa, Nicaragua (La Libertad Mine), and Fekola gold project, an open pit gold mine under construction located approximately 40 kilometers south of the city of Kenieba, Mali (Fekola Project)."}, {"sector": "Miscellaneous", "name": "Ballantyne Strong, Inc", "exchange": "AMEX", "symbol": "BTN", "beta": "0.34", "industry": "Industrial Machinery/Components", "description": "Ballantyne Strong, Inc. is a holding company. The Company's business activities focus on serving the cinema, retail, financial and government markets. The Company and its subsidiaries design, integrate and install technology solutions for a range of applications; develop and deliver out-of-home messaging, advertising and communications; manufacture projection screens, and provide managed services, including monitoring of networked equipment to its customers. The Company operates through two segments: Cinema and Digital Media. Its Cinema operations include the sale of digital projection equipment, screens and sound systems. Its Digital Media operations include the delivery of end-to-end digital signage solutions, video communication solutions, content creation, and management and service of digital signage and digital cinema equipment. The Company's products are distributed to the retail, financial, government and cinema markets throughout the world."}, {"sector": "Finance", "name": "Bancorp of New Jersey, Inc", "exchange": "AMEX", "symbol": "BKJ", "beta": "0.25", "industry": "Major Banks", "description": "Bancorp of New Jersey, Inc. is a bank holding company for Bank of New Jersey (the Bank). The Company's primary business is ownership and supervision of the Bank. The Company, through the Bank, conducts a traditional commercial banking business, accepting deposits from the general public, including individuals, businesses, non-profit organizations and governmental units. The Bank makes commercial loans, consumer loans, and both residential and commercial real estate loans. In addition, the Bank provides other customer services and makes investments in securities. The principal market for its deposit gathering and lending activities lies within Bergen County in New Jersey. The total loans amount to approximately $652.3 million; total securities amount to approximately $66.59 million, and total deposits amount to approximately $692.3 million. The Bank's subsidiaries include BONJ-New York Corp., BONJ-New Jersey Investment Company, BONJ-Delaware Investment Company and BONJ REIT Inc."}, {"sector": "n/a", "name": "Bancroft Fund Limited", "exchange": "AMEX", "symbol": "BCV", "beta": "0.71", "industry": "n/a", "description": "Bancroft Fund Ltd. (the Fund) is a diversified closed-end management investment company. The Fund's primary investment objective is to provide income and the potential for capital appreciation, which objectives the Fund considers to be relatively equal over the long term due to the nature of the securities in which it invests. The Fund invests primarily in convertible and equity securities. The Fund's investment portfolio includes convertible corporate bonds, convertible preferred stocks, mandatory convertible securities and common stocks. It invests in various industries, such as healthcare, computer software and services, financial services, energy and utilities, semiconductors, real estate investment trusts, communications equipment, telecommunications, business services, consumer services, cable and satellite, food and beverage, agriculture, automotive, metals and mining, entertainment and consumer products. Gabelli Funds, LLC serves as the investment advisor of the Fund."}, {"sector": "n/a", "name": "Bancroft Fund Limited", "exchange": "AMEX", "symbol": "BCV^A", "beta": "", "industry": "n/a", "description": "Bancroft Fund Ltd. (the Fund) is a diversified closed-end management investment company. The Fund's primary investment objective is to provide income and the potential for capital appreciation, which objectives the Fund considers to be relatively equal over the long term due to the nature of the securities in which it invests. The Fund invests primarily in convertible and equity securities. The Fund's investment portfolio includes convertible corporate bonds, convertible preferred stocks, mandatory convertible securities and common stocks. It invests in various industries, such as healthcare, computer software and services, financial services, energy and utilities, semiconductors, real estate investment trusts, communications equipment, telecommunications, business services, consumer services, cable and satellite, food and beverage, agriculture, automotive, metals and mining, entertainment and consumer products. Gabelli Funds, LLC serves as the investment advisor of the Fund."}, {"sector": "Basic Industries", "name": "BANRO CORPORATION", "exchange": "AMEX", "symbol": "BAA", "beta": "1.73", "industry": "Precious Metals", "description": "Banro Corp (Banro) is a Canada-based gold mining company. The Company, through its subsidiaries, holds interest in a number of gold properties, including Twangiza, Namoya, Lugushwa and Kamituga. The Company is focused on production from the Twangiza gold mine in the Democratic Republic of the Congo (DRC). The Company's properties, totaling approximately 2,000 square kilometers, are covered by a total of over 10 exploitation permits or mining licenses. The Company, through its DRC subsidiary, Banro Congo Mining SA, holds over 10 exploration permits covering an aggregate of over 2,600 square kilometers. Approximately 10 of the exploration permits are located near its Twangiza property and approximately four are located near the Namoya property. The Twangiza property is located in the South Kivu Province of the DRC, and has an area of approximately 1,000 square kilometers. Namoya consists of prospects, including Mwendamboko, Muviringu, Kakula, Namoya Summit, Seketi and Kangurube."}, {"sector": "Finance", "name": "Bar Harbor Bankshares, Inc.", "exchange": "AMEX", "symbol": "BHB", "beta": "0.81", "industry": "Major Banks", "description": "Bar Harbor Bankshares is a bank holding company. The Company's operating subsidiary, Bar Harbor Bank & Trust (the Bank), is a community bank, which offers a range of deposit, loan and related banking products, as well as brokerage services provided through a third-party brokerage arrangement. In addition, the Company offers trust and investment management services through its second tier subsidiary, Bar Harbor Trust Services, a Maine chartered non-depository trust company. The Bank offers a range of consumer financial products and services for the deposit and borrowing needs of its retail customers. The Bank's retail deposit products and services include checking accounts, interest bearing negotiable order of withdrawal accounts, money market accounts, savings accounts, club accounts, short-term and long-term certificates of deposits, health savings accounts and individual retirement accounts."}, {"sector": "Energy", "name": "Barnwell Industries, Inc.", "exchange": "AMEX", "symbol": "BRN", "beta": "1.33", "industry": "Oil & Gas Production", "description": "Barnwell Industries, Inc. is engaged in various lines of business, such as acquiring, developing, producing and selling oil and natural gas in Canada; investing in land interests in Hawaii; drilling wells, and installing and repairing water pumping systems in Hawaii, and developing homes for sale in Hawaii. The Company's segments include Oil and Natural Gas Segment; Land Investment Segment; Contract Drilling Segment, and Residential Real Estate Segment. The Company's investments in oil and natural gas properties are located in Canada, principally in the province of Alberta, with other non-producing holdings in the provinces of Saskatchewan and British Columbia. It holds interests in Kaupulehu Developments, a Hawaii general partnership. Its subsidiary, Water Resources International, Inc., drills water and water monitoring wells of varying depths in Hawaii, installs and repairs water-pumping systems, and is the distributor for Floway pumps and equipment in the state of Hawaii."}, {"sector": "Technology", "name": "BG Staffing Inc", "exchange": "AMEX", "symbol": "BGSF", "beta": "0.33", "industry": "Professional Services", "description": "BG Staffing, Inc. (BG Staffing) is a provider of temporary staffing services. The Company provides temporary workers to a range of customers that are seeking to match their workforce requirements to their business needs. Its customers operate across a diverse set of industries. The Company's operations are organized into three segments: Commercial, Multifamily and Professional. The Company's temporary staffing services consist of on-demand or short-term staffing assignments, contract staffing, and on-site management administration. Short-term staffing services assist employers in dealing with employee demands caused by such factors as seasonality, fluctuations in customer demand, vacations, illnesses, parental leave, and special projects. The Company's contract staffing services place temporary employees with customers for time-periods of more than three months or for an indefinite time period."}, {"sector": "Health Care", "name": "BioPharmX Corporation", "exchange": "AMEX", "symbol": "BPMX", "beta": "1.67", "industry": "Major Pharmaceuticals", "description": "BioPharmX Corporation is a specialty pharmaceutical company. The Company is focused on utilizing its drug delivery technologies to develop and commercialize prescription and over-the-counter (OTC) products that address markets in women's health and dermatology. Its portfolio of product candidates includes two clinical stage product candidates: BPX01, which is a topical antibiotic for the treatment of acne based on a formulation of minocycline, and BPX03, which is a molecular iodine (I2) tablet for the treatment of benign breast pain associated with fibrocystic breast condition (FBC) and cyclic mastalgia. Its VI2OLET is an OTC molecular iodine dietary supplement that addresses cyclic breast discomfort and is clinically demonstrated to alleviate the symptoms associated with FBC, including tenderness, aches and swelling. It is developing BPX02, which is an injectable utilizing biologic materials for aesthetic dermatology applications."}, {"sector": "Health Care", "name": "BioTime, Inc.", "exchange": "AMEX", "symbol": "BTX", "beta": "2.09", "industry": "Biotechnology: Biological Products (No Diagnostic Substances)", "description": "BioTime, Inc. is a clinical-stage biotechnology company focused on developing and commercializing products addressing degenerative diseases. Its clinical programs are based on two platform technologies: pluripotent stem cells and cell/drug delivery platform technologies. The foundation of its cell delivery platform is its HyStem cell and drug delivery matrix technology. Its clinical programs are targeting three primary sectors, aesthetics, ophthalmology and cell/drug delivery. Its facial aesthetics product, Renevia, is a potential treatment for facial lipoatrophy. It is in a pivotal clinical trial in Europe to assess its safety and efficacy in restoring normal skin contours in patients whose subcutaneous fat, or adipose tissue, has been lost due to the use of certain drugs often used to treat patients with human immune virus. OpRegen is its lead product for ophthalmological disorders. It is a suspension of retinal pigment epithelial cells that are derived from pluripotent stem cells."}, {"sector": "Consumer Services", "name": "Birks Group Inc.", "exchange": "AMEX", "symbol": "BGI", "beta": "3.97", "industry": "Consumer Specialties", "description": "Birks Group Inc is a Canada-based company engaged in designing, developing, making and retail of jewelry, timepieces and gifts. The Company operates through two segments: Retail and Other. The Company's Retail segment consists of all its retail operations in the United States and Canada on a combined basis. As of March 26, 2016, the Retail segment operated 27 stores across Canada under the Birks brand, 17 stores in the Southeastern United States under the Mayors brand, a store under the Rolex brand name in Orlando, as well as two retail locations in Calgary and Vancouver under the Brinkhaus brand. The Company's Other segment consists primarily of its e-commerce business, gold exchange business, which purchases gold and other precious metals from clients and refines the metals purchased, and wholesale business. The Company's merchandise includes designer jewelry, diamond, gemstone and precious metal jewelry."}, {"sector": "n/a", "name": "BlackRock Maryland Municipal Bond Trust", "exchange": "AMEX", "symbol": "BZM", "beta": "-0.19", "industry": "n/a", "description": "BlackRock Maryland Municipal Bond Trust is a non-diversified, closed-end municipal bond fund. The Trust's investment objective is to provide current income exempt from regular federal income taxes and Maryland personal income taxes. The Trust seeks to achieve its investment objective by investing primarily in municipal bonds exempt from federal income taxes (except that the interest may be subject to the federal alternative minimum tax) and Maryland personal income taxes. The Trust invests, under normal market conditions, at least 80% of its managed assets in municipal bonds that are investment grade quality at the time of investment or, if unrated, determined to be of comparable quality by the Trust's investment advisor. It invests in various sectors, including health, education, county/city/special district/school district, transportation, utility, housing, cash and derivatives, state tax-backed, corporate and tobacco. BlackRock Advisors, LLC is the investment advisor of the Trust."}, {"sector": "n/a", "name": "BlackRock Municipal Income Trust II", "exchange": "AMEX", "symbol": "BLE", "beta": "0.00", "industry": "n/a", "description": "BlackRock Municipal Income Trust II is a diversified, closed-end management investment company. The Trust's investment objective is to provide current income exempt from regular federal income tax. The Trust seeks to achieve its investment objective by investing primarily in municipal bonds exempt from federal income taxes (except that the interest may be subject to the federal alternative minimum tax). The Trust invests at least 80% of its assets in municipal bonds that are investment grade quality at the time of investment or, if unrated, determined to be of comparable quality by the investment advisor. The Trust may invest directly in such securities or synthetically through the use of derivatives. It invests in various sectors, including transportation, utilities, county/city/special district/school district, health, state tax-backed, education, corporate, tobacco, local tax-backed, prerefund/escrow and housing. BlackRock Advisors, LLC is the investment advisor of the Trust."}, {"sector": "n/a", "name": "Blackrock New Jersey Municipal Bond Trust", "exchange": "AMEX", "symbol": "BLJ", "beta": "-0.07", "industry": "n/a", "description": "BlackRock New Jersey Municipal Bond Trust is a non-diversified, closed-end municipal bond fund. The Trust's investment objective is to provide current income exempt from regular federal income tax and New Jersey gross income tax. It seeks to achieve its investment objective by investing primarily in municipal bonds exempt from federal income taxes (except that the interest may subject to the federal alternative minimum tax) and New Jersey gross income taxes. It invests at least 80% of its assets in municipal bonds that are investment grade quality at the time of investment or, if unrated, determined to be of comparable quality by the Trust's investment advisor. It may invest directly in such securities or synthetically through the use of derivatives. It invests in various sectors, including transportation, education, local tax-backed, county/city/special district/school district, state tax-backed, health, corporate and housing. Its investment advisor is BlackRock Advisors, LLC."}, {"sector": "n/a", "name": "BlackRock New York Municipal Income Trust II", "exchange": "AMEX", "symbol": "BFY", "beta": "-0.07", "industry": "n/a", "description": "Blackrock New York Municipal Income Trust II is a non-diversified, closed-end municipal bond fund. The Trust's investment objective is to provide current income exempt from regular federal income tax and New York State and New York City personal income taxes. The Trust seeks to achieve its investment objective by investing in municipal bonds exempt from federal income taxes and New York State and New York City personal income taxes. It invests at least 80% of its assets in municipal bonds that are investment grade quality at the time of investment or, if unrated, determined to be of comparable quality by the Trust's investment advisor. It may invest directly in securities or synthetically through the use of derivatives. It invests in various sectors, including county/city/special district/school district, transportation, education, utilities, health, state tax-backed, housing, corporate, local tax-backed and tobacco. BlackRock Advisors, LLC is the investment advisor of the Trust."}, {"sector": "Technology", "name": "Blonder Tongue Laboratories, Inc.", "exchange": "AMEX", "symbol": "BDR", "beta": "2.16", "industry": "Radio And Television Broadcasting And Communications Equipment", "description": "Blonder Tongue Laboratories, Inc. (Blonder Tongue), along with its subsidiary, R. L. Drake Holdings, LLC (RLD), is a technology-development and manufacturing company. The Company delivers a range of products and services to the cable entertainment and media industry. Its products are deployed in a list of locations, including lodging/hospitality, multi-dwelling units/apartments, broadcast studios/networks, universities/schools, healthcare/hospitals and airports. Blonder Tongue's products are divided into three categories: Digital Video Headend, Analog Video Headend and Hybrid-Fiber Coax (HFC) Distribution. The Digital Video Headend products (including encoders) are used by a system operator for acquisition, processing, compression, encoding and management of digital video. The Analog Video Headend products are used by a system operator for signal acquisition, processing and manipulation. The HFC Distribution products are used to transport signals from the headend to their destination."}, {"sector": "Consumer Services", "name": "Bluerock Residential Growth REIT, Inc.", "exchange": "AMEX", "symbol": "BRG", "beta": "", "industry": "Real Estate Investment Trusts", "description": "Breville Group Limited is engaged in the innovation, development, marketing and distribution of small electrical appliances. The Company's segments include North America, Australia and New Zealand (ANZ), Rest of World and Other. In North America, the Company distributes Breville branded products through various channels. In Australia and New Zealand, the Company principally trades through its own brands Breville and Kambrook, and also distributes a range of Philips products in the personal care and garment care categories. In the United Kingdom, the marketing and distribution of Breville designed products to retailers is through the Company's own brand, Sage. The Company's Other segment includes the shared service facility, design and development and global marketing functions, as well as the depreciation/amortization charge on Company's assets, including capitalized product development projects. The Company's products include espresso machines, mini ovens, toasters and kettles."}, {"sector": "n/a", "name": "Bluerock Residential Growth REIT, Inc.", "exchange": "AMEX", "symbol": "BRG^D", "beta": "0.69", "industry": "n/a", "description": "Bluerock Residential Growth REIT, Inc. is a real estate investment trust. The Company is focused on acquiring a portfolio of residential real estate assets. As of December 31, 2016, the Company's portfolio consisted of interests in 31 properties (21 operating and 10 development properties). As of December 31, 2016, its properties contained an aggregate of 9,570 units, consisting of 6,972 operating units and 2,598 units under development. As of December 31, 2016, its operating properties included ARIUM at Palmer Ranch, Sarasota; ARIUM Grandewood, Orlando; ARIUM Gulfshore, Naples; ARIUM Palms, Orlando; ARIUM Pine Lakes, Port St. Lucie; ARIUM Westside, Atlanta; Ashton Reserve, Charlotte; Enders at Baldwin Park, Orlando; Fox Hill, Austin; Lansbrook Village, Palm Harbor; Legacy at Southpark, Austin; Nevadan, Atlanta; Roswell City Walk, Roswell; Sorrel, Frisco; Sovereign, Fort Worth; The Preserve at Henderson Beach, Destin; Village Green of Ann Arbor, Ann Arbor, and Whetstone, Durham."}, {"sector": "Health Care", "name": "Bovie Medical Corporation", "exchange": "AMEX", "symbol": "BVX", "beta": "-0.43", "industry": "Medical/Dental Instruments", "description": "Bovie Medical Corporation (Bovie) is an energy-based medical device company. The Company is engaged in the design, development and manufacturing of electrosurgical equipment by producing equipment for medical device manufacturers through original equipment manufacturing (OEM) agreements, as well as start-up companies. It operates through three segments: Core, OEM and J-Plasma. It is engaged in developing and marketing a range of electrosurgical products and technologies, as well as related medical products used in doctor's offices, surgery centers and hospitals around the world. It also develops J-Plasma, a helium-based plasma surgical product. The J-Plasma system consists of an electrosurgical generator unit, a handpiece and a supply of helium gas. Its products are marketed through brands, including Bovie, Aaron, DERM, IDS and ICON, and on a private label basis to distributors around the world. It offers its products in electrosurgery, cauteries and other products categories."}, {"sector": "n/a", "name": "Bowl America, Inc.", "exchange": "AMEX", "symbol": "BWL.A", "beta": "0.49", "industry": "n/a", "description": "Bowl America Incorporated is engaged in the entertainment business. The Company is engaged in the operation of bowling centers, with food and beverage service in each center. As of July 3, 2016, the Company and its subsidiaries operated 18 bowling centers, including 10 centers located in metropolitan Washington, District of Columbia; one center in metropolitan Baltimore, Maryland; four centers in metropolitan Richmond, Virginia, and three centers in metropolitan Jacksonville, Florida. As of July 3, 2016, the 18 centers contained a total of 726 lanes. The Company's bowling centers are air-conditioned with facilities for service of food and beverages, game rooms, rental lockers and meeting room facilities. Its bowling centers provide shoes for rental, and it also provides bowling balls. In addition, each center sells retail bowling accessories. Its bowling centers also offer glow-in-the-dark bowling and non-league bowling. It offers bowling centers for kids, companies and adults."}, {"sector": "Energy", "name": "Camber Energy, Inc.", "exchange": "AMEX", "symbol": "CEI", "beta": "1.40", "industry": "Oil & Gas Production", "description": "Camber Energy, Inc., formerly Lucas Energy, Inc., is an independent oil and natural gas company. The Company is engaged in the acquisition and development of crude oil and natural gas from various known productive geological formations, including the Austin Chalk and Eagle Ford formations, primarily in Gonzales, Wilson and Karnes Counties, south of the city of San Antonio, Texas. As of March 31, 2016, the Company had leasehold interests (working interests) in approximately 8,395 gross acres or 8,309 net acres. Its total net developed and undeveloped acreage as measured from the surface to the base of the Austin Chalk formation is approximately 8,310 net acres. In deeper formations, it had approximately 1,909 net acres in the Eagle Ford oil window. As of March 31, 2016, the Company had produced an average of approximately 61 net barrels of oil equivalent per day (Boepd) from 26 active well bores."}, {"sector": "Health Care", "name": "Can-Fite Biopharma Ltd", "exchange": "AMEX", "symbol": "CANF", "beta": "1.46", "industry": "Major Pharmaceuticals", "description": "Can Fite Biofarma Ltd is an Israel-based biopharmaceutical company. The Company develops new treatments for autoimmune diseases and cancer. The Companyâ\u0080\u0099s drugs are CF101 for Psoriasis treatment, RA treatment, for the treatment of Keratoconjunctictivitis Sicca, for the treatment of Glaucoma, among others; and CF102 for the treatment of liver diseases. The Company has a research infrastructure including research laboratories and animal house facilities run by the development team. Can Fite Biofarma Ltd signed distribution contracts with a Kwang Dong Pharmaceutical Co. allowing distribution of CF101 for arthritis in Korea and Seikagaku Corp. for distribution in Japan. The Company operates three subsidiaries, Ultratrend Ltd, EyeFite Ltd and OphathaliX Inc."}, {"sector": "Consumer Non-Durables", "name": "Castle Brands, Inc.", "exchange": "AMEX", "symbol": "ROX", "beta": "0.47", "industry": "Beverages (Production/Distribution)", "description": "Castle Brands Inc. develops and markets premium and super premium brands in the beverage alcohol categories. The Company is engaged in the sale of premium beverage alcohol. Its beverage alcohol categories include rum, whiskey, liqueurs, vodka and tequila. Its brands include Gosling's rum, Gosling's Stormy Ginger Beer, Gosling's Dark 'n Stormy ready-to-drink cocktail, Jefferson's bourbon, Jefferson's Reserve, Jefferson's Ocean Aged at Sea, Jefferson's Wine Finish Collection, Jefferson's The Manhattan: Barrel Finished Cocktail, Jefferson's Chef's Collaboration, Jefferson's Wood Experiment, Jefferson's Presidential Select, Jefferson's Rye whiskey, Pallini liqueurs, Clontarf Irish whiskey, Knappogue Castle Whiskey, Brady's Irish Cream, Boru vodka, Tierras tequila, Celtic Honey liqueur and Gozio amaretto. It has operations in two geographic areas: International and the United States. The Company distributes its products in all 50 states of the United States and the District of Columbia."}, {"sector": "Consumer Non-Durables", "name": "CCA Industries, Inc.", "exchange": "AMEX", "symbol": "CAW", "beta": "0.14", "industry": "Package Goods/Cosmetics", "description": "CCA Industries, Inc. (CCA) manufactures and distributes health and beauty aid products. The Company is engaged in the sale of products in several health-and-beauty aids over-the-counter drug and remedies, and cosmeceutical categories. Under its brand names, the Company markets several different but categorically related products. The Company's principal brand and trademark names include Plus+White (oral health-care products), Sudden Change (skin-care products), Nutra Nail (nail treatments), Bikini Zone (pre and after-shave products), Hair Off (depilatories), Solar Sense (sun-care products), Sunset Cafe (perfumes), Lobe Wonder (ear-care product) and Scar Zone (scar diminishing cream).The Company markets its products to drug, food and mass-merchandise retail chains, warehouse clubs and wholesalers, throughout the United States, and through distributors internationally."}, {"sector": "Health Care", "name": "Cel-Sci Corporation", "exchange": "AMEX", "symbol": "CVM", "beta": "-1.62", "industry": "Biotechnology: Biological Products (No Diagnostic Substances)", "description": "CEL-SCI Corporation is engaged in the research and development at developing the treatment of cancer and other diseases by using the immune system. The Company is focused on activating the immune system to fight cancer and infectious diseases. It operates through the segment of research and development of certain drugs and vaccines. It is focused on the development of Multikine (Leukocyte Interleukin, Injection), an investigational immunotherapy under development for treatment of certain head and neck cancers, and anal warts or cervical dysplasia in human immunodeficiency virus and human papillomavirus co-infected patients and Ligand Epitope Antigen Presentation System (L.E.A.P.S.) technology, with over two investigational therapies, LEAPS-H1N1-DC, a product candidate under development for treatment of pandemic influenza in hospitalized patients, and CEL-2000 and CEL-4000, vaccine product candidates under development for treatment of rheumatoid arthritis."}, {"sector": "n/a", "name": "Central Fund of Canada Limited", "exchange": "AMEX", "symbol": "CEF", "beta": "-0.18", "industry": "n/a", "description": "Central Fund of Canada Limited (Central Fund) is an investment holding company. The Company's investment objective is to provide a secure, convenient, low-cost, exchange tradable investment alternative for investors interested in holding an investment in gold and silver bullion for long-term appreciation. At least 85% of Central Fund's net assets shall consist of long-term holdings of gold and silver bullion in bar form. At least 90% of Central Fund's net assets shall consist of gold and silver bullion in bar and certificate form. A nominal portion of Central Fund's net assets may be invested in marketable securities related to the gold and silver markets and industries. Generally, at the time it invests in gold and silver bullion, Central Fund intends that no more than 10% of its net assets shall be cash assets."}, {"sector": "n/a", "name": "Central Securities Corporation", "exchange": "AMEX", "symbol": "CET", "beta": "0.89", "industry": "n/a", "description": "Central Securities Corporation is a non-diversified, closed-end management investment company. The Company's investment objective is long-term growth of capital and its approach is based on value investing. The Company invests primarily in common stocks, but it may invest in bonds, convertible bonds, preferred stocks, convertible preferred stocks, warrants, options real estate, or short-term obligations of governments, banks and corporations. The Company, from time to time, invests in securities the resale of which is restricted. The Company invests in various sectors, including insurance, technology hardware and equipment, diversified financial, semiconductor, banks, diversified industrial, healthcare, media, real estate investment trusts, retailing and others. Its short-term investments include investments in the United States Treasury Bills."}, {"sector": "Consumer Durables", "name": "Chase Corporation", "exchange": "AMEX", "symbol": "CCF", "beta": "0.96", "industry": "Building Products", "description": "Chase Corporation is engaged in manufacturing of protective materials for reliability applications. The Company's operating segments include industrial materials segment and construction materials segment. The Industrial Materials segment includes specified products that are used in, or integrated into, another company's product, with demand typically dependent upon general economic conditions. The industrial material includes insulating and conducting materials for the manufacture of electrical and telephone wire and cable, electrical splicing, and terminating and repair tapes, which are marketed to wire and cable manufacturers. The Construction Materials segment consists of project-oriented product offerings that are sold and used as Chase branded products. The Company's principal products are specialty tapes, laminates, sealants, coatings and chemical intermediates. Its manufacturing facilities are located at O'Hara Township, Pennsylvania and Blawnox, Pennsylvania facilities."}, {"sector": "Public Utilities", "name": "Cheniere Energy Partners LP Holdings, LLC", "exchange": "AMEX", "symbol": "CQH", "beta": "0.99", "industry": "Oil/Gas Transmission", "description": "Cheniere Energy Partners LP Holdings, LLC (Cheniere Holdings) is a limited liability company. The Company's business consists of owning and holding Cheniere Energy Patners, L.P. (Cheniere Partners) limited partner common units, Class B units and subordinated units (collectively, the Cheniere Partners units), along with cash or other property that it receives as distributions in respect of such units. Cheniere Partners is developing, constructing and operating natural gas liquefaction facilities at the Sabine Pass LNG terminal located in Cameron Parish, Louisiana, on the Sabine-Neches Waterway less than four miles from the Gulf Coast adjacent to the existing regasification facilities through its subsidiary, Sabine Pass Liquefaction, LLC (SPL). Cheniere Partners owns and operates the liquefied natural gas (LNG) regasification facilities at the Sabine Pass LNG terminal through its subsidiary, Sabine Pass LNG, L.P. (SPLNG)."}, {"sector": "Public Utilities", "name": "Cheniere Energy Partners, LP", "exchange": "AMEX", "symbol": "CQP", "beta": "0.98", "industry": "Oil/Gas Transmission", "description": "Cheniere Energy Partners, L.P. (Cheniere Partners) is a limited partnership formed by Cheniere Energy, Inc (Cheniere). The Company operates through liquefaction and regasification operations at the Sabine Pass LNG terminal segment. Through its subsidiary, Sabine Pass Liquefaction, LLC (SPL), it is developing, constructing and operating natural gas liquefaction facilities (the Liquefaction Project) at the Sabine Pass LNG terminal located in Cameron Parish, Louisiana, on the Sabine-Neches Waterway less than four miles from the Gulf Coast. Through its subsidiary, Sabine Pass LNG, L.P., it owns and operates regasification facilities at the Sabine Pass LNG terminal, which includes existing infrastructure of five LNG storage tanks with capacity of approximately 16.9 billion cubic feet equivalent, two marine berths that can accommodate vessels with nominal capacity of up to 266,000 cubic meters and vaporizers with regasification capacity of approximately four billion cubic feet per day."}, {"sector": "Public Utilities", "name": "Cheniere Energy, Inc.", "exchange": "AMEX", "symbol": "LNG", "beta": "1.76", "industry": "Oil/Gas Transmission", "description": "Cheniere Energy, Inc. (Cheniere) is an energy company primarily engaged in liquefied natural gas (LNG)-related businesses. The Company operates through two segments: LNG terminal business, and LNG and natural gas marketing business. Its LNG terminal segment consists of the Sabine Pass and Corpus Christi LNG terminals. Its LNG and natural gas marketing segment consists of LNG and natural gas marketing activities by Cheniere Marketing. Cheniere Marketing is developing a portfolio of long- and medium-term SPAs with professional staff based in the United States, the United Kingdom, Singapore and Chile. The Company conducts its business through its subsidiaries, including the development, construction and operation of its LNG terminal business and the development and operation of its LNG and natural gas marketing business. The Company owns and operates the Sabine Pass LNG terminal in Louisiana through its ownership interest in and management agreements with Cheniere Partners."}, {"sector": "Health Care", "name": "China Pharma Holdings, Inc.", "exchange": "AMEX", "symbol": "CPHI", "beta": "2.06", "industry": "Major Pharmaceuticals", "description": "China Pharma Holdings, Inc. is a holding company. The Company conducts its production, marketing, finance, development and administrative activities through its subsidiary, Hainan Helpson Medical & Biotechnology Co., Ltd. (Helpson) in the People's Republic of China (PRC). It is engaged in the development, manufacture and marketing of pharmaceutical products for human use in connection with various diseases and medical conditions in the PRC. It manufactures pharmaceutical products in the form of dry powder injectables, liquid injectables, tablets, capsules, oral solutions and granules. Its pharmaceutical products are sold on a prescription basis and are approved by the China Food and Drug Administration (the CFDA). The Company manufactured over 20 pharmaceutical products for various diseases and medical indications. It offers products for Central Nervous System (CNS) and Cerebral-Cardiovascular Diseases, Anti-infection and Respiratory Diseases, Digestive Diseases and Others."}, {"sector": "Energy", "name": "CKX Lands, Inc.", "exchange": "AMEX", "symbol": "CKX", "beta": "0.95", "industry": "Oil & Gas Production", "description": "CKX Lands, Inc. is engaged in the business of ownership and management of land. The Company's primary activities consist of leasing its properties for minerals (oil and gas), raising and harvesting timber, and surface use (agriculture, right of ways, hunting). The Company's segments are oil and gas, surface and timber. The Company owns land, timber and mineral interests, and collects income through its ownership in the form of oil and gas royalties, timber sales, and surface leases for farming, right of way and other uses. The Company is not involved in the exploration or production of oil and gas nor does it actively farm its lands. The Company owns a total of approximately 13,195 net acres all located in Louisiana. Of the total approximately 13,195 net acres owned by the Company, timber land comprises 9,833 acres, 2,225 acres are agricultural land, 943 acres are marsh land and 194 acres are subdivision land."}, {"sector": "n/a", "name": "Clough Global Dividend and Income Fund", "exchange": "AMEX", "symbol": "GLV", "beta": "0.92", "industry": "n/a", "description": "Clough Global Dividend and Income Fund (the Fund), formerly Clough Global Allocation Fund, is a closed-end management investment company. The Fund's investment objective is to provide a high level of total return. The Fund invests in a managed mix of equity and debt securities. The Fund will not invest more than 20% of its total assets in securities rated, at the time of acquisition, below investment grade. The Fund may invest a portion of its assets in foreign securities and exchange traded funds. The Fund may sell a security it does not own. The Fund will not invest more than 20% of its total assets, at the time of acquisition, in securities of governments and companies in emerging markets. The Fund invests in various sectors, such as Consumer Discretionary, Consumer Staples, Energy, Financials, Healthcare, Industrials, Information Technology, Materials and Telecommunication Services. Clough Capital Partners L.P. is the investment advisor of the Fund."}, {"sector": "n/a", "name": "Clough Global Equity Fund", "exchange": "AMEX", "symbol": "GLQ", "beta": "1.05", "industry": "n/a", "description": "Clough Global Equity Fund is a diversified, closed-end management investment company. The Fund's investment objective is to provide a high level of total return. It will invest approximately 80% in equity and equity-related securities in the United States and non-United States markets, and the remainder in fixed income securities, including both corporate and sovereign debt, in both the United States and non-United States markets. It intends to invest primarily in a managed mix of global equity securities. Its investments in non-United States markets will be made primarily through liquid securities, including depositary receipts and exchange traded funds. The Fund may invest a portion of its assets in foreign securities. It focuses on investing in a range of sectors, including consumer discretionary, consumer staples, energy, financials, healthcare, industrials, information technology, materials and telecommunication services. Its investment advisor is Clough Capital Partners L.P."}, {"sector": "n/a", "name": "Clough Global Opportunities Fund", "exchange": "AMEX", "symbol": "GLO", "beta": "1.05", "industry": "n/a", "description": "Clough Global Opportunities Fund is a diversified, closed-end management investment company. The Fund's investment objective is to provide a high level of total return. It seeks to achieve its objective by applying a fundamental research-driven investment process. It will invest in equity and equity-related securities, as well as fixed income securities, including both corporate and sovereign debt. Its investment portfolio includes common stocks, participation notes, preferred stocks, corporate bonds, asset/mortgage backed securities, and government and agency obligations. It invests in various sectors, such as consumer discretionary, consumer staples, energy, financials, healthcare, industrials, information technology, materials and telecommunication services. It holds investments in various countries, such as the United States, China, India, Japan, Switzerland, South Korea, Singapore, Canada and the United Kingdom. Clough Capital Partners L.P. is the investment advisor of the Fund."}, {"sector": "Finance", "name": "Cohen & Company Inc.", "exchange": "AMEX", "symbol": "COHN", "beta": "-0.38", "industry": "Investment Bankers/Brokers/Service", "description": "Cohen & Company Inc., formerly Institutional Financial Markets, Inc., is a financial services company. The Company specializes in credit-related fixed income investments. The Company provides a range of capital markets, investment banking and asset management solutions to institutional investors, corporations and other small broker-dealers. The Company operates in three segments: Capital Markets, Principal Investing and Asset Management. Its Capital Markets business segment consists of credit-related fixed income sales, as well as issue placements in corporate and securitized products and advisory services. The Principal Investing business segment consists of investments that the Company has made using its own capital excluding investments the Company makes to support its Capital Markets business segment. Its Asset Management business segment manages assets through investment vehicles, such as collateralized debt obligations, permanent capital vehicles and managed accounts."}, {"sector": "Consumer Services", "name": "Command Security Corporation", "exchange": "AMEX", "symbol": "MOC", "beta": "0.36", "industry": "Diversified Commercial Services", "description": "Command Security Corporation is a security services company. The Company provides uniformed security officers and aviation security services to commercial, financial, industrial, aviation and Governmental customers throughout the United States. The Company provides security services to its customers through Command Security, its security division, and aviation security services through its Aviation Safeguards division. The Company's security services division provides security services to Governmental, quasi-Governmental and financial institutions, healthcare facilities, colleges and universities, residential communities, commercial real estate, industrial, distribution, logistics and retail customers. The Company's Aviation Safeguards provides aviation security services and passenger assistance services to over 50 domestic and international airlines, airports, airport authorities and the general aviation community at approximately nine international airports."}, {"sector": "Capital Goods", "name": "CompX International Inc.", "exchange": "AMEX", "symbol": "CIX", "beta": "1.06", "industry": "Industrial Machinery/Components", "description": "CompX International Inc. is a manufacturer of security products used in the recreational transportation, postal, office and institutional furniture, cabinetry, tool storage, healthcare and other industries, and stainless steel exhaust systems, gauges and throttle controls for the recreational marine industry. The Company operates through two business segments: Security Products and Marine Components. Its security products include disc tumbler locks; pin tumbler locking mechanisms, and CompX eLock and StealthLock electronic locks. Its marine components include original equipment and aftermarket stainless steel exhaust headers, exhaust pipes, mufflers and other exhaust components; gauges; mechanical and electronic controls and throttles; steering wheels and other billet aluminum accessories, and dash panels. The Company's brands include National Cabinet Lock, Fort Lock, Timberline Lock, Chicago Lock, Mega Rim, Race Rim, Vantage View and GEN-X."}, {"sector": "Basic Industries", "name": "Comstock Mining, Inc.", "exchange": "AMEX", "symbol": "LODE", "beta": "-0.51", "industry": "Precious Metals", "description": "Comstock Mining Inc. is a gold and silver mining company. The Company holds properties in the Comstock and Silver City mining districts (collectively, the Comstock District). The Company's segments include mining and real estate. The mining segment consists of the Company's activities and expenditures associated with mining. The real estate segment consists of land, real estate rental properties, and a hotel, restaurant and bar provided by the Gold Hill Hotel. The Comstock District is located within the western portion of the Basin and Range Province of Nevada, between Reno and Carson City. The Lucerne Resource area is located in Storey County, Nevada, approximately three miles south of Virginia City and over 30 miles southeast of Reno. Its Dayton Resource area is located in Lyon County, Nevada, approximately six miles south of Virginia City. The Company also owns various non-mining properties, including Daney Ranch, the Gold Hill Hotel, and related homes and cottages."}, {"sector": "Finance", "name": "Consolidated-Tomoka Land Co.", "exchange": "AMEX", "symbol": "CTO", "beta": "1.17", "industry": "Real Estate", "description": "Consolidated-Tomoka Land Co. is a real estate operating company. As of December 31, 2016, the Company owned and managed 31 commercial real estate properties in 10 states in the United States. Its segments include Income Properties, Commercial Loan Investments, Real Estate Operations, Golf Operations, and Agriculture and Other. It also leases land for billboards; has agricultural operations that are managed by a third party, which consists of leasing land for hay and sod production, timber harvesting and hunting leases, and owns and manages subsurface interests. As of December 31, 2016, the Company owned 21 single-tenant and 10 multi-tenant income-producing properties with approximately 1,700,000 square feet of gross leasable space. As of December 31, 2016, it also owned and managed a land portfolio of approximately 9,800 acres. Its income property operations consist of income-producing properties and its business is focused on investing in additional income-producing properties."}, {"sector": "Energy", "name": "Contango Oil & Gas Company", "exchange": "AMEX", "symbol": "MCF", "beta": "1.97", "industry": "Oil & Gas Production", "description": "Contango Oil & Gas Company (Contango) is an independent oil and natural gas company. The Company is engaged in the exploration, development, exploitation and acquisition of crude oil and natural gas properties in the onshore Texas Gulf Coast, offshore properties in the shallow waters of the Gulf of Mexico (GOM) and Rocky Mountain regions of the United States. The Company's properties are located in Gulf of Mexico; Madison and Grimes counties, Texas; Zavala and Dimmit counties, Texas; Weston County, Wyoming; Texas Gulf Coast, and Sublette County, Wyoming. In addition, the Company has operated properties producing from various conventional formations in various counties along the Texas Gulf Coast; operated producing properties in the Denver Julesburg Basin (DJ Basin) in Weld and Adams counties in Colorado, and operated producing properties in the Haynesville Shale, Mid Bossier and James Lime formations in East Texas."}, {"sector": "Capital Goods", "name": "Continental Materials Corporation", "exchange": "AMEX", "symbol": "CUO", "beta": "0.33", "industry": "Building Materials", "description": "Continental Materials Corporation operates within two industry groups: heating, ventilation and air conditioning (HVAC), and construction products. The Company operates through two segments in each of the two industry groups: the Heating and Cooling segment and the Evaporative Cooling segment in the HVAC industry group, and the Concrete, Aggregates and Construction Supplies (CACS) segment and the Door segment in the Construction Products industry group. The Heating and Cooling segment primarily produces and sells gas-fired wall furnaces, console heaters and fan coils. The Evaporative Cooling segment produces and sells primarily evaporative coolers. The Door segment sells hollow metal doors, door frames and related hardware, wood doors, lavatory fixtures and electronic access and security systems. The Company makes sales to general and sub-contractors, government entities and individuals. Concrete, aggregates and construction supplies are also offered from various locations."}, {"sector": "Consumer Non-Durables", "name": "Core Molding Technologies Inc", "exchange": "AMEX", "symbol": "CMT", "beta": "1.03", "industry": "Plastic Products", "description": "Core Molding Technologies, Inc. is a manufacturer of sheet molding compound (SMC) and molder of fiberglass reinforced plastics. The Company along with its subsidiaries operates in the plastics market in a family of products known as reinforced plastics. It operates through manufacturing of SMC and molder of fiberglass reinforced plastics segment. It produces and sells SMC and molded products for varied markets, such as medium and heavy-duty trucks, automobiles, marine, construction and other commercial markets. It specializes in large-format moldings and offers a range of fiberglass processes, including compression molding of SMC, glass mat thermoplastics, bulk molding compounds and direct long-fiber thermoplastics, spray-up, hand-lay-up, and resin transfer molding. It offers reaction injection molding, utilizing dicyclopentadiene technology. It operates over five production facilities in Columbus, Ohio; Batavia, Ohio; Gaffney, South Carolina; Winona, Minnesota, and Matamoros, Mexico."}, {"sector": "Health Care", "name": "CorMedix Inc", "exchange": "AMEX", "symbol": "CRMD", "beta": "-0.19", "industry": "Major Pharmaceuticals", "description": "CorMedix Inc. is a commercial pharmaceutical and medical device company. The Company in-licenses, develops and commercializes prophylactic and therapeutic products for the prevention and treatment of infectious and inflammatory diseases. The Company has in-licensed the rights to develop and commercialize its product candidate, CRMD003 (Neutrolin), which addresses market opportunities in the instances in which a central venous catheter is used, such as hemodialysis, intensive care units, oncology, and patients receiving total parenteral nutrition, intravenous (IV) hydration, and/or IV medications. Neutrolin is an anti-infective solution for the prevention of catheter-related infections and thrombosis in the central venous catheter markets, such as dialysis, critical care and oncology. Neutrolin is a broad-spectrum antimicrobial/antifungal and anticoagulant combination that is active against common microbes, including antibiotic-resistant strains, and may prevent biofilm formation."}, {"sector": "n/a", "name": "Cornerstone Strategic Return Fund, Inc. (The)", "exchange": "AMEX", "symbol": "CRF", "beta": "1.03", "industry": "n/a", "description": "Cornerstone Total Return Fund, Inc. is a closed-end, diversified management investment company. The Fund's investment objective is to seek capital appreciation with current income as a secondary objective. The Fund invests in various sectors, such as closed-end funds, information technology, financials, healthcare, consumer discretionary, industrials, energy, consumer staples, materials, telecommunication services, utilities, real estate, exchange-traded funds (ETFs) and others. The Fund may invest without limitation in other closed-end investment companies and ETFs, provided that the Fund limits its investment in securities issued by other investment companies so that not more than 3% of the outstanding voting stock of any one investment company will be owned by the Fund. Cornerstone Advisors, Inc. serves as an investment manager to the Fund."}, {"sector": "n/a", "name": "Cornerstone Strategic Value Fund, Inc.", "exchange": "AMEX", "symbol": "CLM", "beta": "1.17", "industry": "n/a", "description": "Cornerstone Strategic Value Fund, Inc. is a closed-end, diversified management investment company. The Fund's investment objective is to seek long-term capital appreciation through investment in equity securities of the United States and non-United States companies. The Fund invests in various sectors, such as closed-end funds, information technology, financials, healthcare, industrials, consumer staples, energy, consumer discretionary, materials, telecommunication services, exchange-traded funds (ETFs), utilities and real estate. The Fund may invest without limitation in other closed-end investment companies and ETFs, provided that the Fund limits its investment in securities issued by other investment companies so that not more than 3% of the outstanding voting stock of any one investment company will be owned by the Fund. Cornerstone Advisors, Inc. serves as an investment manager of the Fund."}, {"sector": "Capital Goods", "name": "CPI Aerostructures, Inc.", "exchange": "AMEX", "symbol": "CVU", "beta": "0.30", "industry": "Military/Government/Technical", "description": "CPI Aerostructures, Inc. (CPI Aero) is a supplier of aircraft parts for fixed wing aircraft and helicopters in both the commercial and defense markets in the United States. The Company is a manufacturer of structural aircraft parts and aerosystems. It is also a contractor to the United States Department of Defense, primarily the Air Force. In addition to its assembly operations, it provides engineering; program management, supply chain management, and maintenance repair and overhaul (MRO) services. CPI Aero supplies the E-2D Advanced Hawkeye surveillance aircraft, the A-10 Thunderbolt attack jet, the Gulfstream G650, the UH-60 BLACK HAWK helicopter, the S-92 helicopter, the MH-60S mine countermeasure helicopter, the AH-1Z ZULU attack helicopter, the HondaJet-Advanced Light Jet, the MH-53 and CH-53 variant helicopters, the C-5A Galaxy cargo jet, the F-16 fighter aircraft, the Embraer Phenom 300 light business jet and the New Cessna Citation X+."}, {"sector": "n/a", "name": "Credit Suisse Asset Management Income Fund, Inc.", "exchange": "AMEX", "symbol": "CIK", "beta": "0.53", "industry": "n/a", "description": "Credit Suisse Asset Management Income Fund, Inc. is a diversified, closed-end management investment fund. The Fund's investment objective is to provide current income consistent with the preservation of capital. The Fund invests in a range of sectors, which include advertising, auto parts and equipment, brokerage, building and construction, building materials, cable and satellite television, chemicals, consumer/commercial/lease financing, electronics, energy-exploration and production, food-wholesale, forestry and paper, gas distribution, health facilities, insurance brokerage, media-diversified, media content, medical products, metals and mining, oil field equipment and services, packaging, personal and household products, pharmaceuticals, software-services, real estate investment trusts, restaurants, specialty retail, and recreation and travel. Credit Suisse Asset Management, LLC is the investment advisor of the Fund."}, {"sector": "n/a", "name": "Credit Suisse High Yield Bond Fund", "exchange": "AMEX", "symbol": "DHY", "beta": "0.91", "industry": "n/a", "description": "Credit Suisse High Yield Bond Fund (the Fund) is a non-diversified, closed-end management investment company. The Fund's investment objective is to seek high current income. The Fund will also seek capital appreciation as a secondary objective. The Fund invests in various sectors, such as advertising, auto parts and equipment, brokerage, building and construction, building materials, cable and satellite television, chemicals, consumer/commercial/lease financing, diversified capital goods, electronics, energy-exploration and production, food-wholesale, forestry and paper, gaming, gas distribution, real estate investment trusts, software-services, specialty retail, steel producers/products, support-services, theaters and entertainment, transport infrastructure/services, aerospace and defense, machinery, collateralized debt obligations and health facilities. Credit Suisse Asset Management, LLC is the investment advisor of the Fund."}, {"sector": "Health Care", "name": "CRH Medical Corporation", "exchange": "AMEX", "symbol": "CRHM", "beta": "1.43", "industry": "Medical/Dental Instruments", "description": "CRH Medical Corporation is a Canada-based healthcare products and services company. The Company focused on providing physicians with services and products for the treatment of gastrointestinal diseases. The Company also provides anesthesiology services to gastroenterologists in the United States through its subsidiaries. The Company specializes in the treatment of hemorrhoids utilizing its treatment protocol and technology. The Company's product distribution strategy focuses on physician education, patient outcomes, and patient awareness. The Company's CRH O'Regan System, platform that provides gastrointestinal is a single use, disposable, hemorrhoid banding technology for treating hemorrhoid grades I-IV. The Company distributes the CRH O'Regan System, treatment protocols, operational and marketing expertise as a package to physicians. The Company's subsidiary, Gastroenterology Anesthesia Associates, LLC, provides anesthesiology services for gastroenterology procedures."}, {"sector": "Consumer Non-Durables", "name": "Crystal Rock Holdings, Inc.", "exchange": "AMEX", "symbol": "CRVP", "beta": "-0.39", "industry": "Food Distributors", "description": "Crystal Rock Holdings, Inc. is engaged in production, marketing and distribution of bottled water and the distribution of coffee, ancillary products, various other refreshment products and office products. The Company's product line includes water, coffee, refreshment, equipment rental, office products and other. Its water products are primarily still, non-sparkling waters. It also has branded sparkling waters. The Company operates primarily as a distribution business to homes and offices. The Company offers bottled water under Crystal Rock and Vermont Pure brands; coffee under Cool Beans brand, and office products under the Crystal Rock Office brand. In addition, the Company offers its products for sale over the Internet and shipping through third parties. It has operations in New England, New York, and New Jersey. As of October 31, 2016, its office products line featured over 40,000 products, including supplies, equipment and furniture, targeted for small and medium-sized business."}, {"sector": "Miscellaneous", "name": "CynergisTek, Inc.", "exchange": "AMEX", "symbol": "CTEK", "beta": "", "industry": "Business Services", "description": "China Chaintek United Co., Ltd. is a logistics distribution provider for sports shoe and apparel manufacturer in the People's Republic of China (PRC). The Company operates through two business divisions: Logistics Services Division and Inventory Solutions Services Division. The Company's Logistics Services Division provides logistics connections between the Company's manufacturer customer base and their retail markets in the PRC using a network of eight independent transport agents. The Company's Inventory Solutions Services Division provides outsourced inventory storage and management services, including sorting, packaging, labelling and short term storage. The Company's operating subsidiary Xingtai Logistics provides domestic logistics services to fast moving consumer goods manufacturers in Jinjiang City, Fujian Province."}, {"sector": "Health Care", "name": "Daxor Corporation", "exchange": "AMEX", "symbol": "DXR", "beta": "0.16", "industry": "Medical/Dental Instruments", "description": "Daxor Corporation is an investment company with medical instrumentation and biotechnology operations. The Company engages in the short selling of stock. The Company maintains a diversified securities portfolio, which consists primarily of the common and preferred stocks of electric utility companies. It has approximately 70 Blood Volume Analyzers (BVA)-100. It also sells Volumex Kits. The semi-automated BVA provides blood volume measurements in human body, which are fundamental tools for diagnosis and treatment in a range of medical and surgical conditions, including congestive heart failure, hypertension, syncope, anemia in cancer patients, kidney failure and hyponatremia. The BVA-100 measures blood volume in approximately an hour. Its IDANT division provides semen banking services, which include anonymous donor semen and semen storage; autologous blood storage; andrology services, which include semen analysis and sperm washing, and general lab testing."}, {"sector": "n/a", "name": "Delaware Investments Florida Insured Municipal Income Fund", "exchange": "AMEX", "symbol": "VFL", "beta": "-0.08", "industry": "n/a", "description": "Delaware Investments National Municipal Income Fund is a diversified closed-end management investment company. The investment objective of the Fund is to provide current income exempt from federal income tax, consistent with the preservation of capital. The Fund invests approximately 80% of its net assets in securities the income from, which is exempt from federal income tax. The Fund will be able to invest over 20% of its net assets in municipal bonds with an investment rating of Ba/BB or lower, or that are unrated but judged to be of comparable quality by the Fund's investment advisor. It invests in corporate-backed revenue bonds, education revenue bonds, electric revenue bonds, healthcare revenue bonds, lease revenue bonds, local general obligation bonds, pre-refunded/escrowed to maturity bonds, special tax revenue bonds, state general obligation bonds, transportation revenue bonds, and water and sewer revenue bonds. The Fund's investment manager is Delaware Management Company."}, {"sector": "n/a", "name": "Delaware Investments Minnesota Municipal Income Fund II, Inc.", "exchange": "AMEX", "symbol": "VMM", "beta": "0.00", "industry": "n/a", "description": "Delaware Investments Minnesota Municipal Income Fund II, Inc. is a diversified closed-end management investment company. The Fund's objective is to provide current income exempt from federal income tax and from state personal income tax, if any, consistent with the preservation of capital. The Fund will invest approximately 80% of its net assets in investment grade quality Minnesota municipal bonds. The Fund may invest over 20% of its net assets in municipal bonds that are rated Ba1/BB+ or lower or that are unrated but judged to be of comparable quality by the Fund's investment advisor. The Fund invests in corporate-backed revenue bonds, education revenue bonds, electric revenue bonds, healthcare revenue bonds, housing revenue bonds, lease revenue bonds, local general obligation bonds, pre-refunded/escrowed to maturity bonds, special tax revenue bonds, state general obligation bonds, and water and sewer revenue bonds. The Fund's investment manager is Delaware Management Company."}, {"sector": "Consumer Non-Durables", "name": "Delta Apparel, Inc.", "exchange": "AMEX", "symbol": "DLA", "beta": "-0.34", "industry": "Apparel", "description": "Delta Apparel, Inc. is an apparel design, marketing, manufacturing and sourcing company. The Company operates through two segments: branded and basics. The branded segment consists of its business units, which are focused on specialized apparel garments and headwear. Its products are marketed under its lifestyle brands of Salt Life, Soffe and COAST, as well as other labels. The basics segment consists of its business units focused on garment styles and includes its Delta Activewear (which includes Delta Catalog and FunTees) and Art Gun business units. It markets, distributes and manufactures knit apparel under the main brands of Delta Pro Weight and Delta Magnum Weight. It also manufactures private label products for branded sportswear companies, trendy regional brands, retailers and sports licensed apparel marketers. It specializes in the design, merchandising, sales and marketing of a range of casual and athletic products for men, women, juniors, youth and children."}, {"sector": "Basic Industries", "name": "Denison Mine Corp", "exchange": "AMEX", "symbol": "DNN", "beta": "1.50", "industry": "Precious Metals", "description": "Denison Mines Corp. is a uranium exploration and development company. The Company is engaged in the acquisition, exploration and development of uranium properties, extraction, processing and selling of uranium. The Company operates in three segments: the Mining segment, the Environmental Services segment, and the Corporate and Other segment. The Mining segment includes activities related to exploration, evaluation and development, mining, milling and the sale of mineral concentrates. The Environmental Services segment includes the operations of the Company's environmental services business, Denison Environmental Services (DES). The Corporate and Other segment includes its provision of general administrative and management services to Uranium Participation Corporation (UPC). The Company holds interests in exploration and evaluation projects located in Canada. Its mineral property interests in Canada include Wheeler River; Bachman Lake; Bell Lake; Crawford Lake; Torwalt Lake and Wolly."}, {"sector": "Consumer Services", "name": "DGSE Companies, Inc.", "exchange": "AMEX", "symbol": "DGSE", "beta": "-1.31", "industry": "Consumer Specialties", "description": "DGSE Companies, Inc. buys and sells jewelry, diamonds, fine watches, rare coins and currency, precious metal bullion products, scrap gold, silver, platinum and palladium, as well as collectibles and other valuables. The Company's operations are organized into approximately two primary types of customers, retail customers and wholesale customers. Its products and services are marketed through approximately eight retail locations. Its retail locations operate under a range of banners, including Charleston Gold & Diamond Exchange, Chicago Gold & Diamond Exchange and Dallas Gold & Silver Exchange, and are supported by Websites at www.CGDEinc.com and www.DGSE.com. Its Fairchild International (Fairchild) division is a dealer of pre-owned fine watches. Fairchild supplies over 1,100 regional jewelry stores across the country, with pre-owned Rolexes and aftermarket Rolex accessories, such as bands, bezels and dials. Its customers include individual consumers, dealers and institutions."}, {"sector": "Capital Goods", "name": "Digital Power Corporation", "exchange": "AMEX", "symbol": "DPW", "beta": "", "industry": "Industrial Machinery/Components", "description": "Deutsche Post AG is a Germany-based provider of postal services. The Company operates through four segments: Post - eCommerce - Parcel, Express, Global Forwarding and Freight, and Supply Chain. The Post - eCommerce - Parcel segment handles both domestic and international mail and provides dialogue marketing, nationwide press distribution services and all electronic services associated with mail delivery. The Express segment offers courier and express services to business and private customers. The Global Forwarding and Freight segment comprises the transportation of goods by rail, road, air and sea. The Supply Chain segment focuses on the delivery of customized logistics solutions, including warehousing, transport and value-added services, and also offers tailored business process outsourcing and marketing communication solutions."}, {"sector": "Consumer Durables", "name": "Document Security Systems, Inc.", "exchange": "AMEX", "symbol": "DSS", "beta": "3.13", "industry": "Containers/Packaging", "description": "Document Security Systems, Inc. (DSS) is a developer and marketer of secure technologies. The Company specializes in fraud and counterfeit protection for various forms of printed documents and digital information. It operates through four segments: DSS Packaging and Printing Group, which produces custom paperboard packaging; Plastic Printing Professionals, Inc. (DSS Plastics Group), which manufactures laminated and surface printed cards; ExtraDev, Inc. (DSS Digital Group), which provides data center centric solutions to businesses and governments delivered through the cloud, and DSS Technology Management, Inc. (DSS Technology Management), which acquires or internally develops technology or intellectual property assets. The Company has optical deterrent technologies that provide protection of printed information from unauthorized scanning and copying. The Company offers AuthentiGuard, which is an iPhone application for authentication."}, {"sector": "n/a", "name": "Dreyfus Municipal Income, Inc.", "exchange": "AMEX", "symbol": "DMF", "beta": "-0.02", "industry": "n/a", "description": "Dreyfus Municipal Income, Inc. is a non-diversified closed-end management investment company. The Fund's investment objective is to maximize current income exempt from federal income tax to the extent consistent with the preservation of capital. The Fund invests approximately 80% of the value of its net assets in municipal obligations. The Fund invests in municipal obligations which, at the time of purchase, are rated investment grade or the unrated equivalent as determined by The Dreyfus Corporation in the case of bonds, and rated in a range of rating categories or the unrated equivalent as determined by it in the case of short-term obligations having, or deemed to have, maturities of less than one year. The Fund invests in a range of sectors, including education, pre-refunded muni, utility, transportation, healthcare, special tax, state/territory general obligations, industry revenue and pollution control. The Dreyfus Corporation serves as the Fund's investment advisor."}, {"sector": "n/a", "name": "Eagle Capital Growth Fund, Inc.", "exchange": "AMEX", "symbol": "GRF", "beta": "", "industry": "n/a", "description": "Grifols SA is a Spain-based company engaged in the biopharmaceuticals manufacture. The Companyâ\u0080\u0099s activities are divided into four business segments: Bioscience, Hospital, Diagnostic and Raw materials. The Bioscience division focuses on the research, development, manufacturing and marketing of products derived from human plasma for therapeutic use. The Hospital division offers non-biological pharmaceutical products and medical supplies for hospital pharmacy. The Diagnostic division provides clinical analysis and laboratory testing tools to laboratories, hospitals and blood banks. The Raw materials division includes sales of intermediate biological products, as well as manufacturing services to third parties. The Company operates production facilities in Spain, the United States, Mexico and Australia, among others. It controls numerous subsidiaries, such as Kiro Grifols SL."}, {"sector": "n/a", "name": "Eaton Vance California Municipal Bond Fund", "exchange": "AMEX", "symbol": "EVM", "beta": "0.00", "industry": "n/a", "description": "Eaton Vance California Municipal Bond Fund is a non-diversified, closed-end management investment company. The Fund's investment objective is to provide current income exempt from federal income tax, including alternative minimum tax (AMT) and California personal income tax. The Funds may invest in residual interest bonds, also referred to as inverse floating rate securities, whereby it may sell a variable or fixed rate bond for cash to a Special-Purpose Vehicle (the SPV), while at the same time, buying a residual interest in the assets and cash flows of the SPV. The Fund invests primarily in debt securities issued by California municipalities. The Fund's investment portfolio includes various sectors, such as water and sewer, healthcare-acute, education, insured escrowed, insured public power and special tax. Eaton Vance Management is the investment advisor for the Fund."}, {"sector": "n/a", "name": "Eaton Vance California Municipal Bond Fund II", "exchange": "AMEX", "symbol": "EIA", "beta": "-0.19", "industry": "n/a", "description": "Eaton Vance California Municipal Bond Fund II (the Fund) is a non-diversified closed-end management investment company. The Fund's investment objective is to provide current income exempt from regular federal income tax, including alternative minimum tax, and in state specific funds, taxes in its specified state. The Fund invests primarily in debt securities issued by California municipalities. The Fund invests in various sectors, such as education, electric utilities, escrowed or pre-refunded, general obligations, hospital, insured-education, insured-electric utilities, insured-escrowed or pre-refunded, insured-general obligations, insured-hospital, transportation, insured-lease revenue or certificates of participation, insured-special tax revenue, lease revenue or certificates of participation, special tax revenue, and water and sewer. The Fund's investment advisor is Eaton Vance Management."}, {"sector": "n/a", "name": "Eaton Vance California Municipal Income Trust", "exchange": "AMEX", "symbol": "CEV", "beta": "-0.16", "industry": "n/a", "description": "Eaton Vance California Municipal Income Trust (the Trust) is a non-diversified, closed-end management investment company. The Trust's investment objective is to provide current income exempt from regular federal income tax and California state personal income taxes. The Trust invests primarily in debt securities issued by the California municipalities. The Trusts may invest in residual interest bonds, also referred to as inverse floating rate securities. The Trust's portfolio of investments includes various sectors, including general obligations, insured-education, healthcare, electric utilities, insured-escrowed/prerefunded, airport, insured special assessment, special tax, water and sewer, hospital, public power, senior living/life care, special assessment and transportation. Eaton Vance Management acts as the Trust's investment advisor and administrator. Eaton Vance Management is a subsidiary of Eaton Vance Corp."}, {"sector": "n/a", "name": "Eaton Vance Limited Duration Income Fund", "exchange": "AMEX", "symbol": "EVV", "beta": "0.50", "industry": "n/a", "description": "Eaton Vance Limited Duration Income Fund (the Fund) is a diversified, closed-end management investment company. The Fund's primary investment objective is to provide a high level of current income. The Fund may, as a secondary objective, also seek capital appreciation to the extent it is consistent with its primary objective. The Fund may invest in Eaton Vance Cash Reserves Fund, LLC (Cash Reserves Fund). The Fund invests in various sectors, including aerospace and defense, air transport, automotive, beverage and tobacco, brokerage/securities dealers/investment houses, building and development, cable and satellite television, chemicals and plastics, electronics/electrical, financial intermediaries, food products, equipment leasing, lodging and casinos, oil and gas, industrial equipment, home furnishings, leisure goods/activities/movies, healthcare, telecommunications, publishing and insurance, among others. The Fund's investment advisor is Eaton Vance Management (EVM)."}, {"sector": "n/a", "name": "Eaton Vance Massachusetts Municipal Bond Fund", "exchange": "AMEX", "symbol": "MAB", "beta": "", "industry": "n/a", "description": "Mitchells & Butlers plc is an operator of managed restaurants and pubs. The Company's portfolio of brands and formats includes Harvester, Toby Carvery, All Bar One, Miller & Carter, Premium Country Pubs, Sizzling Pubs, Crown Carveries, Stonehouse, Vintage Inns, Browns, Castle, Nicholson's, O'Neill's and Ember Inns. The Company's segments are Retail operating business and Property business. The Company also operates Innkeeper's Lodge hotels in the United Kingdom, and Alex restaurants and bars in Germany. The Company also offers Dining Out gift cards. The Company's subsidiaries are engaged in the business of leisure retailing, property leasing, property management and finance. The Company's subsidiaries include Mitchells & Butlers Retail Limited, Mitchells & Butlers Retail (No. 2) Limited, Ha Ha Bar & Grill Limited, Orchid Pubs & Dining Limited, ALEX Gaststatten Gesellschaft mbH & Co KG, Midco 1 Limited and Mitchells & Butlers (Property) Limited."}, {"sector": "n/a", "name": "Eaton Vance Michigan Municipal Bond Fund", "exchange": "AMEX", "symbol": "MIW", "beta": "0.07", "industry": "n/a", "description": "Eaton Vance Michigan Municipal Bond Fund is a non-diversified, closed-end management investment company. The Fund's investment objective is to provide current income exempt from regular federal income tax, including alternative minimum tax, and, in state specific funds, taxes in its specified state. The Fund invests in various sectors, including education, electric utilities, insured-education, general obligations, insured-electric utilities, insured-general obligations, hospital, insured-bond bank, insured escrowed/prerefunded, and water and sewer industries. The Fund also invests primarily in debt securities issued by Michigan municipalities. Eaton Vance Management (EVM) serves as an investment advisor for the Fund."}, {"sector": "n/a", "name": "Eaton Vance Municipal Bond Fund", "exchange": "AMEX", "symbol": "EIM", "beta": "-0.05", "industry": "n/a", "description": "Eaton Vance Municipal Bond Fund is a non-diversified, closed-end management investment company. The Fund's investment objective is to provide current income exempt from regular federal income tax, including alternative minimum tax, and, in state specific funds, taxes in its specified state. The Fund invests primarily in debt securities issued by municipalities. The Fund may invest in residual interest bonds, also referred to as inverse floating rate securities, whereby it may sell a variable or fixed rate bond for cash to a Special-Purpose Vehicle (the SPV), while at the same time, buying a residual interest in the assets and cash flows of the SPV. The Fund's investment portfolio includes various sectors, such as special tax, healthcare-acute, education, insured escrowed, and water and sewer. Eaton Vance Management is the investment advisor for the Fund."}, {"sector": "n/a", "name": "Eaton Vance New Jersey Municipal Income Trust", "exchange": "AMEX", "symbol": "EVJ", "beta": "0.30", "industry": "n/a", "description": "Eaton Vance New Jersey Municipal Income Trust (the Trust) is a non-diversified, closed-end management investment company. The Trust's investment objective is to provide current income exempt from regular federal income tax and taxes in its specified state. The Trust invests primarily in debt securities issued by New Jersey municipalities. It has investments in various sectors, including education, escrowed/prerefunded, general obligations, hospital, housing, industrial development revenue, lease revenue/certificates of participation, senior living/life care, student loan, water and sewer, and transportation. The Trust may invest in residual interest bonds, also referred to as inverse floating rate securities, whereby the Trust may sell a variable or fixed rate bond for cash to a Special-Purpose Vehicle (the SPV), while at the same time, buying a residual interest in the assets and cash flows of the SPV. The Trust's investment advisor is Eaton Vance Management."}, {"sector": "n/a", "name": "Eaton Vance New York Municipal Bond Fund", "exchange": "AMEX", "symbol": "ENX", "beta": "-0.01", "industry": "n/a", "description": "Eaton Vance New York Municipal Bond Fund is a non-diversified, closed-end management investment company. The Fund's investment objective is to provide current income exempt from federal income tax, including alternative minimum tax (AMT), and New York State and New York City personal income taxes. The Fund's investment portfolio includes various sectors, such as industrial development revenue, special tax, bond bank, toll road, healthcare-acute, housing, education, electric utilities, insured escrowed, hospital, transportation, and water and sewer. The Fund invests primarily in debt securities issued by New York municipalities. The Fund may invest in residual interest bonds, also referred to as inverse floating rate securities, whereby it may sell a variable or fixed rate bond for cash to a Special-Purpose Vehicle (SPV), while at the same time, buying a residual interest in the assets and cash flows of the SPV. Eaton Vance Management is the investment advisor for the Fund."}, {"sector": "n/a", "name": "Eaton Vance New York Municipal Income Trust", "exchange": "AMEX", "symbol": "EVY", "beta": "-0.03", "industry": "n/a", "description": "Eaton Vance New York Municipal Income Trust is a non-diversified, closed-end management investment company. The Trust's investment objective is to provide current income exempt from regular federal income tax and taxes in its specified state. The Trust invests primarily in debt securities issued by New York municipalities. The Trust invests in various sectors, including cogeneration, electric utilities, escrowed/prerefunded, hospital, housing, industrial development revenue, water and sewer, special tax, real estate, toll road, healthcare-acute, transportation, student loan and senior living/life care. The Trust may invest in residual interest bonds, also referred to as inverse floating rate securities, whereby it may sell a variable or fixed rate bond for cash to a Special-Purpose Vehicle (the SPV), while at the same time, buying a residual interest in the assets and cash flows of the SPV. The Trust's investment advisor is Eaton Vance Management."}, {"sector": "n/a", "name": "Eaton Vance Ohio Municipal Income Trust", "exchange": "AMEX", "symbol": "EVO", "beta": "0.00", "industry": "n/a", "description": "Eaton Vance Ohio Municipal Income Trust (the Trust) is a non-diversified, closed-end management investment company. The Trust's investment objective is to provide current income exempt from regular federal income tax and taxes in its specified state. The Trust invests in debt securities issued by Ohio municipalities. The Trust has investments in various sectors, including education, electric utilities, escrowed/prerefunded, general obligations, hospital, housing, industrial development revenue, senior living/life care, transportation, and water and sewer. The Trust may invest in residual interest bonds, also referred to as inverse floating rate securities, whereby the Trust may sell a variable or fixed rate bond for cash to a Special-Purpose Vehicle (the SPV), while at the same time, buying a residual interest in the assets and cash flows of the SPV. The Trust's investment advisor is Eaton Vance Management."}, {"sector": "n/a", "name": "Eaton Vance Pennsylvania Municipal Bond Fund", "exchange": "AMEX", "symbol": "EIP", "beta": "-0.02", "industry": "n/a", "description": "Eaton Vance Pennsylvania Municipal Bond Fund is a non-diversified, closed-end management investment company. The Fund's investment objective is to provide current income exempt from federal income tax, including alternative minimum tax (AMT), and Pennsylvania state and local taxes in the form of an investment exempt from Pennsylvania personal property taxes. The Fund invests in various sectors, including education, general obligations, hospital, housing, escrowed/prerefunded, transportation, industrial development, insured-electric utilities, insured-general obligations, insured-escrowed/prerefunded, and water and sewer industries. The Fund also invests primarily in debt securities issued by Pennsylvania municipalities. Eaton Vance Management (EVM) serves as an investment advisor for the Fund."}, {"sector": "n/a", "name": "Eaton Vance Pennsylvania Municipal Income Trust", "exchange": "AMEX", "symbol": "EVP", "beta": "0.02", "industry": "n/a", "description": "Eaton Vance Pennsylvania Municipal Income Trust is a non-diversified and closed-end management investment company. The Trust's investment objective is to provide current income exempt from regular federal income tax and taxes in its specified state. The Trust invests primarily in debt securities issued by California municipalities, Massachusetts municipalities, Michigan municipalities and New Jersey municipalities. The Trust intends to make monthly distributions of net investment income, after payment of any dividends on any outstanding preferred shares. In addition, the Trust intends to distribute all or substantially all of its net realized capital gains. The Trust invests in various sectors, such as education, healthcare, escrowed, insured escrowed, industrial development bonds, insured transportation, toll road, insured lease, water and sewer, and electric utilities. The Trust's investment advisor is Eaton Vance Management."}, {"sector": "Health Care", "name": "Electromed, Inc.", "exchange": "AMEX", "symbol": "ELMD", "beta": "1.17", "industry": "Biotechnology: Electromedical & Electrotherapeutic Apparatus", "description": "Electromed, Inc. develops, manufactures and markets airway clearance products, which apply High Frequency Chest Wall Oscillation (HFCWO) therapy in pulmonary care for patients of all ages. The Company's products include the SmartVest Airway Clearance System (SmartVest System), the SmartVest SQL System and others. As of June 30, 2016, the SmartVest System is available in two models: SV2100 and SQL. The SmartVest System consists of an inflatable therapy garment, a programmable air pulse generator and a single-hose, which delivers air pulses from the generator to the garment. The SmartVest SQL System is small, quiet and light, and offers generator programmability. The Company markets the Single Patient Use (SPU) SmartVest and SmartVest Wrap to healthcare providers, particularly those working in intensive care units. The Company sells its products to the home healthcare market for patients with chronic lung issues, including bronchiectasis, cystic fibrosis and neuromuscular disease."}, {"sector": "Public Utilities", "name": "Ellomay Capital Ltd.", "exchange": "AMEX", "symbol": "ELLO", "beta": "0.68", "industry": "Electric Utilities: Central", "description": "Ellomay Capital Ltd. is engaged in the business of energy and infrastructure, and its operations primarily include production of renewable and clean energy. The Company owns approximately 16 photovoltaic (PV) plants that are connected to their respective national grids and operates as over 12 photovoltaic plants in Italy with an aggregate installed capacity of over 22.6 megawatt peak (MWp) and over four photovoltaic plants in Spain with an aggregate installed capacity of approximately 7.9 MWp. In addition, it owns an interest in Dorad Energy Ltd. (Dorad), and holds an option to increase its indirect holdings in Dorad under certain conditions. Dorad operates the Dorad Power Plant, a combined cycle power plant based on natural gas, with a production capacity of approximately 850 megawatts, located south of Ashkelon. It operates in Italy and in Spain through its subsidiaries that own over 16 PV Plants, and in Israel primarily through U. Dori Energy Infrastructures Ltd. (Dori Energy)."}, {"sector": "n/a", "name": "Ellsworth Growth and Income Fund Ltd.", "exchange": "AMEX", "symbol": "ECF", "beta": "0.87", "industry": "n/a", "description": "Ellsworth Growth and Income Fund Ltd. operates as a closed-end, diversified management investment company. The Fund's investment objective is to provide income and the potential for capital appreciation, which objectives the Fund considers to be relatively equal over the long term due to the nature of the securities in which it invests. The Fund invests primarily in convertible and in equity securities, and common stock. The Fund's portfolio includes sectors, such as healthcare, financial services, computer software and services, energy and utilities, real estate investment trusts, semiconductors, telecommunications, business services, diversified industrial, food and beverage, communications equipment, consumer products, transportation, consumer services, cable and satellite, computer hardware, automotive, wireless communications, agriculture and entertainment. Gabelli Funds, LLC is the investment advisor of the Fund."}, {"sector": "Technology", "name": "eMagin Corporation", "exchange": "AMEX", "symbol": "EMAN", "beta": "0.62", "industry": "Semiconductors", "description": "eMagin Corporation is engaged in the manufacture of microdisplays using organic light emitting diode (OLED) technology. The Company designs, develops, manufactures and markets OLED on silicon microdisplays, virtual imaging products that utilizes OLED microdisplays and related products. The Company also performs research in the OLED field. The Company's virtual imaging products integrate OLED technology with silicon chips to produce microdisplays smaller than one-inch diagonally, which when viewed through a magnifier, create virtual images that appear comparable in size to that of a computer monitor or a large-screen television. The Company offers its products to OEMs and other buyers as both separate components, integrated bundles coupled with its own optics, or full systems. The Company also offers engineering support. Its products include SVGA+ OLED Microdisplay Series, Digital SVGA OLED-XL, SXGA096 OLED-XL/XLS, SXGA OLED-XL, WUXGA OLED-XL, VGA OLED-XL and Integrated Modules."}, {"sector": "Consumer Non-Durables", "name": "Emerson Radio Corporation", "exchange": "AMEX", "symbol": "MSN", "beta": "0.88", "industry": "Consumer Electronics/Appliances", "description": "Emerson Radio Corp. designs, sources, imports and markets a range of houseware and consumer electronic products. The Company also licenses its trademarks for a range of products around the world. Its product and branded categories consist of Houseware Products, which include microwave ovens and compact refrigerators; Audio Products, including clock radios, and Other, which consists of televisions, mobile and landline telephones and accessories, tablet computers and accessories, cameras and video cameras and accessories, and miscellaneous electronic and novelty products. Its product categories include bottle openers and wine coolers, microwaves, small appliances and refrigeration. Its products include bottle cooler/warmer, electric wine bottle opener, table-top electronic wine cooler, 700W microwave oven, coffee/espresso/capuccino maker and 3.1 CU.FT. compressor type compact fridge. Its trademarks include Emerson, Emerson Research, H.H. Scott, iDEA, IDIVA, Olevia, Scott and SmartSet."}, {"sector": "Basic Industries", "name": "EMX Royalty Corporation", "exchange": "AMEX", "symbol": "EMX", "beta": "1.28", "industry": "Precious Metals", "description": "EMX Royalty Corp, formerly Eurasian Minerals Inc, is a Canada-based company that is engaged in exploration discovery, royalty generation, royalty acquisition, and strategic investments. The Companyâ\u0080\u0099s diversified portfolio of royalty, mineral property and investment interests spans more than four continents. It has a diversified portfolio of precious metals, base metals, and other royalty interests and it is focused on gold, copper, polymetallic and geothermal assets. Its royalties include: Leeville, NP Placers, Afgan, Maggie Creek and Ophir in the United States, among others; Brestovac, Viscaria, Tynset and Ziar Basin in Europe, among others; Akarca, Golcuk and Trab-23 in Turkey, among others, as well as Grand Bois, La Miel and North Central in the Caribbean, among others."}, {"sector": "Basic Industries", "name": "Energy Fuels Inc", "exchange": "AMEX", "symbol": "UUUU", "beta": "0.48", "industry": "Mining & Quarrying of Nonmetallic Minerals (No Fuels)", "description": "Energy Fuels Inc. (Energy Fuels) is engaged in conventional and in situ (ISR) uranium extraction and recovery, along with the exploration, permitting and evaluation of uranium properties in the United States. The Company operates through two segments: ISR Uranium and Conventional Uranium. It conducts its ISR activities through its Nichols Ranch Project, located in northeast Wyoming. It conducts its conventional uranium extraction and recovery activities through its White Mesa Mill. It owns the Nichols Ranch Uranium Recovery Facility in Wyoming (the Nichols Ranch Project), which is a uranium recovery facility operating in the United States. In addition, the Company owns the White Mesa Mill in Utah, which is a conventional uranium recovery facility operating in the United States. It also owns uranium and uranium/vanadium properties and projects in various stages of exploration, permitting, and evaluation, as well as fully-permitted uranium and uranium/vanadium projects on standby."}, {"sector": "Energy", "name": "EnerJex Resources, Inc.", "exchange": "AMEX", "symbol": "ENRJ", "beta": "4.28", "industry": "Oil & Gas Production", "description": "EnerJex Resources, Inc. is an independent energy company. The Company is engaged in the acquisition, development, exploitation and production of crude oil and natural gas properties in the United States. The crude oil and natural gas is obtained by the acquisition and subsequent exploration and development of mineral leases. Development and exploration include drilling exploratory or development wells on these leases. These operations are conducted primarily in Kansas, Colorado, Nebraska and Texas. The Company's Colorado properties include Adena, Hereford, Seven Cross, Niobrara-Colorado and Niobrara-Nebraska. The Company's Kansas properties include Mississippian Project and Cherokee Project. Its Texas properties include El Toro Project. The Company's total net proved oil and gas reserves are approximately 2.6 million barrels of oil equivalents (BOE)."}, {"sector": "Energy", "name": "ENSERVCO Corporation", "exchange": "AMEX", "symbol": "ENSV", "beta": "1.05", "industry": "Oilfield Services/Equipment", "description": "Enservco Corporation provides well and fluid management services to the domestic onshore oil and natural gas industry. The Company's services include frac water heating, hot oiling and acidizing (well enhancement services), and water transfer, water treatment, water hauling, fluid disposal, frac tank rental (fluid management services) and other general oilfield services. Well enhancement services consist of frac water heating, acidizing, hot oiling services and pressure testing. These services are provided by its subsidiary, Heat Waves Hot Oil Service LLC (Heat Waves), which utilize a fleet of approximately 200 custom designed trucks and other related equipment. The Company owns or leases, and operates approximately 65 water-hauling trucks and trailers equipped with pumps to move water from or into wells, tanks and other storage facilities. Each truck has a hauling capacity of approximately 130 barrels. It also provides well-site construction and roustabout services."}, {"sector": "Public Utilities", "name": "EnSync, Inc.", "exchange": "AMEX", "symbol": "ESNC", "beta": "0.73", "industry": "Electric Utilities: Central", "description": "EnSync, Inc. is engaged in developing, licensing and manufacturing energy management systems solutions serving the commercial and industrial (C&I) building, utility, and off-grid markets. The Company develops and commercializes product and service solutions for the distributed energy generation market, including energy management systems, energy storage systems, applications, and Internet of energy platforms that link distributed energy resources with the grid network. The Company's products include Matrix energy management system and advanced energy storage products. The Matrix Energy Management System is a behind the meter energy control system, which focuses at the commercial, industrial and multi-tenant building markets. Matrix Energy Management System offers swappable drawers that can be replaced without taking the entire distributed generation system off line. The Company's Agile Hybrid Storage System is a technology that combines a range of storage units."}, {"sector": "Basic Industries", "name": "Entree Resources Ltd.", "exchange": "AMEX", "symbol": "EGI", "beta": "0.50", "industry": "Precious Metals", "description": "Entree Resources Ltd, formerly Entree Gold Inc., is a Canada-based mineral exploration company with a carried joint venture interest in copper-gold projects the Oyu Tolgoi project in Mongolia. The Entree/Oyu Tolgoi Joint Venture Property includes the Hugo North Extension and Heruga copper-gold deposits, as well as underexplored land package. The Company has approximately 30% carried interest in all mineralization identified above 560 meters' elevation, and approximately 20% carried interest in all mineralization extracted below 560 meters' elevation from the Entree/Oyu Tolgoi Joint Venture Property."}, {"sector": "Energy", "name": "Erin Energy Corp.", "exchange": "AMEX", "symbol": "ERN", "beta": "2.23", "industry": "Oil & Gas Production", "description": "Erin Energy Corporation is an independent oil and gas exploration and production company. The Company is focused on energy resources in Africa. It is focused on exploration for and production of hydrocarbons where commercial reserves have been found and developed. As of December 31, 2016, the Company's asset portfolio consisted of seven licenses across four countries covering an area of approximately five million acres (approximately 19,000 square kilometers). The Company's geographical segments include Nigeria, Kenya, The Gambia and Ghana. The Company owns producing properties and conducts exploration activities offshore Nigeria, conducts exploration activities offshore Ghana and The Gambia, and onshore Kenya. The Company has 100% interest in Oil Mining Leases 120 and 121; four Production Sharing Contracts in the Lamu Basin of Kenya; two exploration licenses offshore The Gambia, and interest in Expanded Shallow Water Tano (ESWT) block offshore Ghana."}, {"sector": "Capital Goods", "name": "Espey Mfg. & Electronics Corp.", "exchange": "AMEX", "symbol": "ESP", "beta": "0.25", "industry": "Industrial Machinery/Components", "description": "Espey Mfg. & Electronics Corp. (Espey) is a power electronics design and original equipment manufacturing (OEM) company. The Company is engaged in developing and delivering products for use in military and environment applications. The Company provides power energy conversion and transformer solutions. The Company's products include power supplies, power converters, filters, power transformers, magnetic components, power distribution equipment, uninterruptible power supply (UPS) systems, antennas and power radar systems. Its products are used in various applications, such as alternating current (AC) and direct current (DC) locomotives, airborne power, ground-based radar and ground mobile power. Its services include design and development to specification, build to print, design services, design studies and development of automatic testing equipment. Its capabilities include contract manufacturing; engineering; production; quality control, and test, which includes environmental test."}, {"sector": "Finance", "name": "Evans Bancorp, Inc.", "exchange": "AMEX", "symbol": "EVBN", "beta": "0.42", "industry": "Major Banks", "description": "Evans Bancorp, Inc. is a financial holding company. The Company conducts its business through its subsidiaries, such as Evans Bank, N.A. (the Bank), which provides a range of banking services to consumer and commercial customers in Western New York, and Evans National Financial Services, LLC (ENFS), which hold interests in The Evans Agency, LLC (TEA), which sells various premium-based insurance policies on a commission basis. The Bank operates through over 10 banking offices in Erie County and Chautauqua County, New York. ENFS owns the business and assets of the Company's non-banking financial services subsidiaries. The Company operates in two segments, namely, banking activities and insurance agency activities. Its banking business segment includes both commercial and consumer banking services, including a range of lending and depository services. Its insurance agency segment includes the activities of selling various premium-based insurance policies on a commission basis."}, {"sector": "Energy", "name": "FieldPoint Petroleum Corporation", "exchange": "AMEX", "symbol": "FPP", "beta": "1.76", "industry": "Oil & Gas Production", "description": "FieldPoint Petroleum Corporation is engaged in the acquisition, operation and development of oil and natural gas properties, which are located in Louisiana, New Mexico, Oklahoma, South Central Texas and Wyoming. The Company's principal oil and natural gas properties include Block A-49, Spraberry Trend, Giddings Field and Serbin Field in Texas; Flying M Field, Sulimar Field, North Bilbrey Field, Lusk Field and Loving North Morrow Field in New Mexico; Apache Field, Chickasha Field and West Allen Field in Oklahoma; Longwood Field in Louisiana, and Big Muddy Field in Wyoming. The Company has varying ownership interest in approximately 470 gross wells (over 113.26 net) located in approximately five states. The Company operates over 20 of approximately 470 wells, and other wells are operated by independent operators under contracts."}, {"sector": "Consumer Services", "name": "Flanigan&#39;s Enterprises, Inc.", "exchange": "AMEX", "symbol": "BDL", "beta": "0.57", "industry": "Restaurants", "description": "Flanigan's Enterprises, Inc. operates as a chain of full-service restaurants and package liquor stores. The Company operates through two segments: the restaurant segment and the package liquor store segment. The operation of package stores consists of retail liquor sales and related items. The Company's restaurants offer alcoholic beverages and full food service. The Company operates its package liquor stores and restaurants under two service marks: Big Daddy's Liquors and Flanigan's Seafood Bar and Grill. As of October 1, 2016, it operated 25 units consisting of restaurants, package liquor stores and combination restaurants/package liquor stores, and franchised an additional five units. It also owns an adult entertainment club. As of October 1, 2016, the Company owned and operated 10 restaurants under its service mark, Flanigan's Seafood Bar and Grill. As of October 1, 2016, the Company owned and operated nine package liquor stores in the South Florida area."}, {"sector": "Consumer Services", "name": "Franklin Street Properties Corp.", "exchange": "AMEX", "symbol": "FSP", "beta": "0.69", "industry": "Real Estate Investment Trusts", "description": "Franklin Street Properties Corp. is a real estate investment trust (REIT). The Company is focused on commercial real estate investments primarily in office markets. The Company operates through the real estate operations segment. The Company's investment objectives are to create shareholder value by increasing revenue from rental, dividend, interest and fee income and net gains from sales of properties, and increase the cash available for distribution in the form of dividends to its stockholders. As of December 31, 2016, the Company owned and operated a portfolio of real estate consisting of 36 office properties, which were located in 12 states. It provides asset management, property management, property accounting, and investor and development services to its portfolio and certain of its Sponsored REITs through its subsidiaries. It focuses on investing in select urban infill and central business district properties with focus on Atlanta, Dallas, Denver, Houston and Minneapolis."}, {"sector": "Capital Goods", "name": "Friedman Industries Inc.", "exchange": "AMEX", "symbol": "FRD", "beta": "0.44", "industry": "Steel/Iron Ore", "description": "Friedman Industries, Incorporated is engaged in steel processing, pipe manufacturing and processing and steel and pipe distribution. The Company has two product groups: coil and tubular products. It purchases prime hot-rolled steel coils, processes the coils into flat, finished sheet and plate, and sells these products on a wholesale, rapid-delivery basis in competition with steel mills, importers and steel service centers. It owns and operates approximately two coil processing facilities located in Hickman, Arkansas (Hickman) and Decatur, Alabama (Decatur). Through its Texas Tubular Products Division (TTP) in Lone Star, Texas, the Company manufactures, purchases, processes and markets tubular products (pipe). TTP operates over two pipe mills. It sells coil products and processing services to approximately 125 customers located primarily in the midwestern, southwestern and southeastern regions of the United States."}, {"sector": "n/a", "name": "GAMCO Global Gold, Natural Reources & Income Trust ", "exchange": "AMEX", "symbol": "GGN", "beta": "0.74", "industry": "n/a", "description": "GAMCO Global Gold, Natural Resources & Income Trust (the Fund) is a non-diversified closed-end management investment company. The Fund's primary investment objective is to provide a high level of current income. The Fund's secondary investment objective is to seek capital appreciation consistent with the Fund's strategy and its primary objective. Under normal market conditions, the Fund will attempt to achieve its objectives by investing approximately 80% of its assets in equity securities of companies principally engaged in the gold and natural resource industries, and by writing covered call options on the underlying equity securities. Its portfolio includes investments in sectors, such as metals and mining, energy and energy services, the United States Government obligations and exchange traded funds. The Fund's investment advisor is Gabelli Funds, LLC."}, {"sector": "Technology", "name": "GEE Group Inc.", "exchange": "AMEX", "symbol": "JOB", "beta": "0.40", "industry": "Diversified Commercial Services", "description": "GEE Group Inc., formerly General Employment Enterprises, Inc., is a provider of specialized staffing solutions. The Company operates through two segments: contract staffing services and direct hire placement. The Company's professional staffing services provide information technology, engineering, medical and accounting professionals to clients on either a regular placement basis or a temporary contract basis. The Company's industrial staffing business provides weekly temporary staffing for light industrial clients, primarily in Ohio. The Company and its subsidiaries provide professional placement services specializing in the placement of information technology, engineering, and accounting professionals, and medical data entry assistants (medical scribes) specializing in electronic medical records (EMR) services for emergency departments, specialty physician practices and clinics, for direct hire and contract staffing, and temporary staffing services in light industrial staffing."}, {"sector": "Basic Industries", "name": "General Moly, Inc", "exchange": "AMEX", "symbol": "GMO", "beta": "1.29", "industry": "Precious Metals", "description": "General Moly, Inc. is engaged in the business of the exploration, development and mining of properties containing molybdenum. The Company, through its subsidiary, Eureka Moly, LLC, holds interest in the Mt. Hope Project, a molybdenum property, located in Eureka County, Nevada. The Mt. Hope Project contains molybdenum reserves totaling approximately 1.4 billion pounds of which 1.2 billion pounds are estimated to be recoverable. It also owns a molybdenum and copper project, the Liberty Project, located in Nye County, Nevada. Its other mining properties include over 100 acres of fee simple land in the Little Pine Creek area of Shoshone County, Idaho; six patented mining claims known as the Chicago-London group, located near the town of Murray in Shoshone County, Idaho; 30 unpatented mining claims in Marion County, Oregon, known as the Detroit property, and 80 unpatented mining claims in Sanders and Madison County, Montana."}, {"sector": "Technology", "name": "GlobalSCAPE, Inc.", "exchange": "AMEX", "symbol": "GSB", "beta": "0.36", "industry": "Computer Software: Prepackaged Software", "description": "GlobalSCAPE, Inc. provides secure information exchange capabilities for enterprises and consumers through the development and distribution of software, delivery of managed and hosted solutions, and provisioning of associated services. The Company's primary product is Enhance File Transfer (EFT). Its software products and services include Managed File Transfer Solutions (MFT), Secure Content Mobility Solutions, Wide Area File Services (WAFS), Managed E-Mail Attachment Solution, Consumer-Based File Transfer Solution and professional services. Its solution portfolio facilitates transmission of critical information, such as financial data, medical records, customer files, vendor files, personnel files, transaction activity and other similar documents. The Company enables transmission of critical information using servers, desktop and notebook computers, and a range of network-enabled mobile devices. Its products also provide customers to monitor and audit file transfer activities."}, {"sector": "Consumer Services", "name": "Globalstar, Inc.", "exchange": "AMEX", "symbol": "GSAT", "beta": "2.84", "industry": "Telecommunications Equipment", "description": "Globalstar, Inc. (Globalstar) provides mobile satellite services (MSS), including voice and data communications services globally through satellite. The Company provides wireless communications services in areas not served or underserved by terrestrial wireless and wireline networks and in circumstances where terrestrial networks are not operational due to natural or man-made disasters. It offers voice and data communication services over its network of in-orbit satellites and its active ground stations (gateways), which it refers to collectively as the Globalstar System. The Company's services are available only with equipment designed to work on its network two-way voice communication and data transmissions (Duplex) using mobile or fixed devices, and one-way data transmissions (Simplex) using a mobile or fixed device that transmits its location and other information to a central monitoring station, including certain SPOT and Simplex products."}, {"sector": "Public Utilities", "name": "Glowpoint, Inc.", "exchange": "AMEX", "symbol": "GLOW", "beta": "-0.09", "industry": "Telecommunications Equipment", "description": "Glowpoint, Inc. provides video collaboration and network applications. The Company provides a range of video collaboration services, from automated to orchestrated, to address the spectrum of user experience and business applications. It delivers its services through a hybrid service platform or as a service layer on top of its customers' video infrastructure. It offers various services, including Managed Videoconferencing, Remote Service Management, Network Services and Professional and Other Services. Its Remote Service Management provides an overlay to enterprise information technology (IT) and channel partner support organizations, and provides around the clock support and management of customer video environments. Its network services provide its customers with network solutions that ensure traffic of video, data and Internet. Its professional services include onsite support, or dispatch, as well as configuration or customization of equipment or software on behalf of a customer."}, {"sector": "Basic Industries", "name": "Gold Resource Corporation", "exchange": "AMEX", "symbol": "GORO", "beta": "0.48", "industry": "Precious Metals", "description": "Gold Resource Corporation is a mining company. The Company is a producer of metal concentrates that contain gold, silver, copper, lead and zinc, and dore containing gold and silver at the Aguila Project within its Oaxaca Mining Unit located in the southern state of Oaxaca, Mexico. The Company has two units in North America, the Oaxaca Mining Unit and the Nevada Mining Unit. The Company's mineral properties are classified into two categories, such as Operating Properties and Exploration Properties. As of December 31, 2016, the Company had interest in nine properties, where over six of its properties, including one Operating Property and five Exploration Properties, are within its Oaxaca Mining Unit, which is located in the southern state of Oaxaca, Mexico. As of December 31, 2016, the Company also had three Exploration Properties within its Nevada Mining Unit located in south central Nevada's Walker Lane Mineral Belt in the United States."}, {"sector": "Basic Industries", "name": "Golden Minerals Company", "exchange": "AMEX", "symbol": "AUMN", "beta": "-0.18", "industry": "Precious Metals", "description": "Golden Minerals Company is a mining company. The Company owns the Velardena and Chicago precious metals mining properties and associated oxide and sulfide processing plants (the Velardena Properties) in the State of Durango, Mexico, the El Quevar advanced exploration property in the province of Salta, Argentina, and a diversified portfolio of precious metals and other mineral exploration properties located primarily in Mexico. Its two segments include its Velardena Properties in Mexico and non-revenue producing activities, including exploration, construction and general and administrative activities. It focuses on evaluating and searching for mining opportunities in North America (including Mexico) with high precious metal grades with near term prospects of mining, and particularly properties within haulage distances of its Velardena Properties, which may include the Santa Maria Mine, the Santa Rosa vein or the Rodeo property."}, {"sector": "Basic Industries", "name": "Golden Star Resources, Ltd", "exchange": "AMEX", "symbol": "GSS", "beta": "-0.71", "industry": "Precious Metals", "description": "Golden Star Resources Ltd. is a gold mining and exploration company. The Company's segments include Wassa, Bogoso/Prestea, Other and Corporate. The Company, through its subsidiary, Golden Star (Wassa) Limited, owns and operates the Wassa open-pit gold mine, the Wassa underground mine and a carbon-in-leach (CIL) processing plant (Wassa). The Wassa mine is located in the southwestern region of Ghana approximately 35 kilometers northeast of the town of Tarkwa. The Company, through its subsidiary Golden Star (Bogoso/Prestea) Limited, owns and operates the Bogoso gold mining and processing operations (Bogoso), the Prestea open-pit mining operations and the Prestea underground development project. The Prestea Underground is located 16 kilometers south of the existing Bogoso processing plant. The Company holds interests in various gold exploration projects in Ghana and other parts of West Africa, and in South America the Company holds and manages exploration properties in Brazil."}, {"sector": "Basic Industries", "name": "Goldfield Corporation (The)", "exchange": "AMEX", "symbol": "GV", "beta": "2.16", "industry": "Water Supply", "description": "The Goldfield Corporation (Goldfield) is engaged in the construction of electrical infrastructure for the utility industry and industrial customers. The Company serves customers in the Southeast and mid-Atlantic regions of the United States, including Texas. It operates through electrical construction segment. The Company's electrical construction business includes the construction of transmission lines, concrete foundations, distribution systems, fiber optic splicing, substations and other electrical services. Through the Company's subsidiaries, Power Corporation of America (PCA), Southeast Power Corporation (Southeast Power), and C and C Power Line, Inc. (C&C), the Company is engaged in the construction and maintenance of electric utility facilities for electric utilities and industrial customers."}, {"sector": "Energy", "name": "Goodrich Petroleum Corporation", "exchange": "AMEX", "symbol": "GDP", "beta": "", "industry": "Oil & Gas Production", "description": "Goldplat plc is engaged in the production of gold and other precious metals, by processing by-products of the mining industry, as well as mining itself. Its segments include Recovery operations, which includes the recovery of precious metals from metallurgical challenging materials and the processing of ore, sourced from other mining operations; Mining and exploration, which includes assets held for commercial exploitation of precious metals and exploration assets held where the commercial viability of the ore resource has not yet been evaluated or is in the process of evaluation, and Administration, which includes activities conducted by holding companies in relation to the Company and its subsidiaries. Its portfolio of assets consists of gold recovery operations in South Africa and Ghana, a gold mine in Kenya and exploration projects in Ghana and Burkina Faso. Its projects include Kilimapesa gold mining project, the Nyieme gold mining project and the Anumso gold mining project."}, {"sector": "Energy", "name": "Gran Tierra Energy Inc.", "exchange": "AMEX", "symbol": "GTE", "beta": "0.58", "industry": "Oil & Gas Production", "description": "Gran Tierra Energy Inc. is an energy company engaged in oil and gas acquisition, exploration, development and production. The Company focuses on onshore oil and gas properties in Colombia, and also own rights to oil and gas properties in Brazil and Peru. Its segments are Colombia, Peru and Brazil based on geographic organization. It operates principally in the Putumayo Basin in Colombia, and has properties in other basins, including the Catatumbo, Cauca, Llanos, Sinu-San Jacinto, Middle Magdalena and Lower Magdalena Basins. It has interests in over 30 blocks in Colombia and it is the operator on over 20 of these blocks. Its blocks and fields include Chaza-Costayaco and Moqueta Fields, Guayuyaco-Guayuyaco and Juanambu Fields, Garibay-Jilguero Field and over 11 Other Blocks. Blocks REC-T-129, REC-T-142, REC-T-155 and REC-T-224 are located over 70 kilometers northeast of Salvador, Brazil in the Reconcavo Basin. Its blocks in Peru include Block 123, Block 129, Block 107 and Block 133."}, {"sector": "Basic Industries", "name": "Great Panther Silver Limited", "exchange": "AMEX", "symbol": "GPL", "beta": "0.60", "industry": "Precious Metals", "description": "Great Panther Silver Ltd (Great Panther) is a Canada-based silver mining and precious metals producer and exploration company. The Company owns two producing mining operations: the Topia Mine and the Guanajuato Mine Complex (GMC). Its segments include GMC, Topia, Exploration and Corporate. The GMC operations produce silver and gold. The Topia operations produce silver, gold, lead and zinc. The Exploration segment includes its exploration and evaluation assets of Santa Rosa, El Horcon, the Coricancha Mine Complex (CMC) and the Guadalupe de los Reyes gold-silver project (GDLR Project). The Corporate segment provides financial, human resources and technical support to the Company's mining operations and exploration activities. The GMC consists of its Guanajuato Mine, San Ignacio Mine, the Cata processing plant, and the associated infrastructure. The Topia Mine is located in the Sierra Madre Mountains in the state of Durango in northwestern Mexico."}, {"sector": "Basic Industries", "name": "Grupo Simec, S.A. de C.V.", "exchange": "AMEX", "symbol": "SIM", "beta": "1.08", "industry": "Steel/Iron Ore", "description": "Grupo Simec, S.A.B. de C.V. is a manufacturer, processor and distributor of special bar quality (SBQ) steel and structural steel products. The Company operates through two segments Mexican and USA. The Mexican segment includes the plants in Mexicali, Guadalajara, Tlaxcala and San Luis Potosi. The USA segment includes approximately seven Republic Steel, Inc. (Republic) plants of which over six are located in the United States (distributed in the states of Ohio, Indiana and New York) and approximately one in Canada (Ontario). The Company produces a range of SBQ steel, long steel and medium-sized structural steel products. In its Mexican facilities, it produces I-beams, channels, structural and commercial angles, hot rolled bars, flat bars, rebars, cold finished bars and wire rods. In its United States facilities, the Company produces hot rolled bars, cold finished bars, semi-finished tube rounds and other semi-finished trade products."}, {"sector": "Technology", "name": "GSE Systems, Inc.", "exchange": "AMEX", "symbol": "GVP", "beta": "0.37", "industry": "Computer Software: Prepackaged Software", "description": "GSE Systems, Inc. (GSE) is a performance improvement company. The Company operates through two segments: Performance Improvement Solutions, and Nuclear Industry Training and Consulting. The Performance Improvement Solutions segment provides simulation, training and engineering products and services to the industries, including nuclear and fossil fuel power industry, and chemical and petrochemical industries. The Performance Improvement Solutions segment consists of its power plant and process simulation solutions, as well as engineering solutions. The Nuclear Industry Training and Consulting segment provides specialized workforce solutions primarily to the nuclear industry, working at client's facilities. The EnVision product line consists of computer-based tutorials and related simulation models primarily for the petrochemical, and oil and gas refining industries."}, {"sector": "Health Care", "name": "Hemispherx BioPharma, Inc.", "exchange": "AMEX", "symbol": "HEB", "beta": "-0.84", "industry": "Biotechnology: Biological Products (No Diagnostic Substances)", "description": "Hemispherx Biopharma, Inc. (Hemispherx) is a specialty pharmaceutical company. The Company is engaged in the clinical development of drug therapies based on natural immune system enhancing technologies for the treatment of viral and immune based chronic disorders. The Company's segment is engaged in research and development activities related to Ampligen and other drugs under development, and sales and marketing of Alferon. The Company's products include Alferon N Injection and Ampligen. Alferon N Injection is approved for the use in intralesional treatment of refractory or recurring external genital warts in patients of over 18 years of age. Ampligen is a drug undergoing clinical development for the treatment of Chronic Fatigue Syndrome (CFS). Alferon LDO (Low Dose Oral Interferon Alfa-n3 (Human Leukocyte Derived)) is a low-dose, oral liquid formulation of natural alpha interferon. Alferon LDO is a liquid natural interferon for oral administration."}, {"sector": "Consumer Services", "name": "HMG/Courtland Properties, Inc.", "exchange": "AMEX", "symbol": "HMG", "beta": "1.64", "industry": "Real Estate Investment Trusts", "description": "HMG/Courtland Properties, Inc. (HMG) is a real estate investment trust (REIT). The Company is engaged in the ownership and management of income-producing commercial properties. The Company's portfolio of REIT marketable securities consists of preferred and non-preferred equity of large capital publicly traded REITs. The Company's investments in non-REIT marketable securities include equity and debt securities issued primarily by large capital companies or government agencies with readily determinable fair values in varying industries. This includes real estate investment trusts and mutual funds focusing in commercial real estate activities. All of its marketable securities investments are in companies listed on national stock markets. Its other investments consist of nominal equity interests in various privately-held entities, including limited partnerships whose purpose is to invest venture capital funds in growth-oriented enterprises. HMGA, Inc. is the advisor of the Company."}, {"sector": "Energy", "name": "Houston American Energy Corporation", "exchange": "AMEX", "symbol": "HUSA", "beta": "0.49", "industry": "Oil & Gas Production", "description": "Houston American Energy Corp. is an independent oil and gas company focused on the development, exploration, exploitation, acquisition, and production of natural gas and crude oil properties in the United States Gulf Coast region and in South America. The Company's oil and gas assets and operations are primarily in Colombia and in the onshore Gulf Coast region, particularly Texas and Louisiana. The Company, along with its partners, manages its resources through acquisitions and divestitures. Its exploration and development projects are focused on existing property interests, and future acquisition of additional property interests, in South America, particularly Colombia, and in the onshore Texas Gulf Coast region and Louisiana. Its producing and exploration properties in Louisiana include the East Baton Rouge Parish, Plaquemines Parish, Vermilion Parish, Iberville Parish, Assumption Parish and Jefferson Davis Parish. Its exploration properties in Texas consist of Matagorda County."}, {"sector": "Health Care", "name": "iBio, Inc.", "exchange": "AMEX", "symbol": "IBIO", "beta": "0.90", "industry": "Major Pharmaceuticals", "description": "iBio, Inc. is a biotechnology company. The Company is focused on commercializing its technologies and product candidates and providing product development and manufacturing services to clients and collaborators. Its technologies include iBioLaunch technology and iBioModulator. The Company's technologies constitute a transformative platform for development and production of biologics in hydroponically grown green plants. The Company is focused on the commercialization of its plant-based protein expression technologies for vaccines and therapeutic proteins and on developing and commercializing select biopharmaceutical product candidates. The Company's technology is applicable in a range of product candidates, including products against fibrotic diseases, vaccines, enzyme replacements, monoclonal antibodies, and recombinant versions of marketed products that are derived from human blood plasma."}, {"sector": "Technology", "name": "IEC Electronics Corp.", "exchange": "AMEX", "symbol": "IEC", "beta": "0.27", "industry": "Electrical Products", "description": "IEC Electronics Corp. provides electronic manufacturing services (EMS) to a range of technology companies that produce life-saving and mission critical products for the medical, industrial, aerospace and defense sectors. The Company specializes in delivering technical solutions for the custom manufacture of full system assemblies by providing on-site analytical testing laboratories, custom design and test engineering services combined with an array of manufacturing services encompassing electronics, interconnect solutions and precision metalworking. It offers its customers a range of manufacturing services, combined with scientific technical support to ensure their products perform for the critical applications they are intended for. Its products are distributed to and through original equipment manufacturers (OEMs). Its capabilities include design and test development, analysis and testing laboratory, custom functional test design and component risk mitigation."}, {"sector": "Health Care", "name": "ImmunoCellular Therapeutics, Ltd.", "exchange": "AMEX", "symbol": "IMUC", "beta": "1.16", "industry": "Major Pharmaceuticals", "description": "ImmunoCellular Therapeutics, Ltd. is a clinical-stage biotechnology company. The Company is developing immune-based therapies for the treatment of cancers. The Company's cancer immunotherapies target cancer stem cells (CSCs), which are the drivers of tumor growth and disease recurrence. Its product candidate is ICT-107, which is in phase III testing. In addition, the Company also has a portfolio of other potential therapeutic immunotherapies using a range of approaches to treat cancer. Its other product candidates are ICT-140 and ICT-121. ICT-107 is a dendritic cell (DC) vaccine for the treatment of newly diagnosed glioblastoma multiforme (GBM), a type of brain cancer. ICT-140 is a DC vaccine that targets over seven tumor-associated antigens expressed on ovarian cancer cells. It is developing ICT-121, a dendritic cell (DC)-based vaccine targeting CD133+ CSCs for the treatment of recurrent GBM and other solid tumor cancers, including ovarian, pancreatic and breast cancers."}, {"sector": "Consumer Services", "name": "Impac Mortgage Holdings, Inc.", "exchange": "AMEX", "symbol": "IMH", "beta": "0.05", "industry": "Real Estate Investment Trusts", "description": "Impac Mortgage Holdings, Inc. is an independent residential mortgage lender. The Company operates through three segments: Mortgage Lending, Real Estate Services and Long-Term Mortgage Portfolio. It originates, sells and services conventional, conforming agency and Government insured residential mortgage loans. Its Real Estate Services segment provides various real estate related services and loss mitigation services, including managing distressed mortgage portfolios and foreclosed real estate assets; surveillance services for residential and multifamily mortgage portfolios; loan modification services, and the master servicing on various residential mortgage and multifamily loan pools for loans. It manages its long-term mortgage portfolio, which consists of residual interests in the securitization trusts reflected as trust assets and liabilities. Its Corporate segment includes corporate services groups, such as information technology, human resources, legal, facilities and accounting."}, {"sector": "Energy", "name": "Imperial Oil Limited", "exchange": "AMEX", "symbol": "IMO", "beta": "0.89", "industry": "Integrated oil Companies", "description": "Imperial Oil Limited is an integrated oil company. The Company is engaged in all the phases of the petroleum industry in Canada, including exploration for, and production and sale of, crude oil and natural gas. Its operations are conducted in three segments: Upstream, Downstream and Chemical. The Upstream operations include the exploration for, and production of, crude oil, natural gas, synthetic oil and bitumen. It holds an interest in the Kearl oil sands project. The Downstream operations consist of the transportation and refining of crude oil, blending of refined products and the distribution and marketing of those products. The Chemical operations consist of the manufacturing and marketing of various petrochemicals. The Company is involved in the exploration for and development of crude oil and natural gas in Canada. The Company transports its crude oil production and third-party crude oil required to supply refineries by contracted pipelines, common carrier pipelines and rail."}, {"sector": "Consumer Services", "name": "Income Opportunity Realty Investors, Inc.", "exchange": "AMEX", "symbol": "IOR", "beta": "0.01", "industry": "Real Estate Investment Trusts", "description": "Income Opportunity Realty Investors, Inc., formerly Income Opportunity Realty Trust, invests in equity interests in real estate through direct equity investments and partnerships, and financing real estate and real estate-related activities through investments in mortgage loans. The Company's segments include land and other. Its operations include the land portfolio, which is land held subject to a sales contract. All of its real estate is located in the southwest region of the continental United States. Pillar Income Asset Management, Inc. (Pillar) is the Company's external Advisor. Pillar locates, evaluates and recommends real estate and real estate-related investment opportunities and arranges debt and equity financing for the Company with third-party lenders and investors. The Company's land consists of approximately 131.1 acres of developable land held subject to a sales contract. All of its land holdings are located in Farmers Branch, Texas."}, {"sector": "Consumer Non-Durables", "name": "India Globalization Capital Inc.", "exchange": "AMEX", "symbol": "IGC", "beta": "2.43", "industry": "Electronic Components", "description": "India Globalization Capital, Inc. develops intellectual property for the treatment of life altering or life threatening conditions, through its research on phytocannabinoid-based therapies, in the United States. The Company also builds farming facilities for leasing. In Malaysia, the Company develops and manages residential and commercial real estate. In India, it leases heavy equipment. It is also focused on developing, testing and patenting phytocannabinoid-based pharmaceutical therapies and becoming a specialty pharmaceutical provider of phytocannabinoid-based pharmaceutical and nutraceutical products. It is developing a product portfolio of phytocannabinoid-based therapies for indications, including neuropathic and cancer pain, epilepsy, end of life supportive care, adjunctive supportive therapies of chronic neurological and oncological diagnosis. In Malaysia, the Companyâ\u0080\u0099s subsidiary, Cabaran Ultima Sdn. Bhd., is focused on building a five-star hotel, Genting highlands."}, {"sector": "Health Care", "name": "InfuSystems Holdings, Inc.", "exchange": "AMEX", "symbol": "INFU", "beta": "0.14", "industry": "Medical/Dental Instruments", "description": "InfuSystem Holdings, Inc. is a provider of infusion pumps and related products and services for patients in the home, oncology clinics, ambulatory surgery centers and other sites of care. The Company delivers local, field-based customer support and also operates pump service and repair Centers of Excellence in Michigan, Kansas, California, Texas and Ontario, Canada. Its service is to supply electronic ambulatory infusion pumps and associated disposable supply kits to oncology clinics, infusion clinics and hospital outpatient chemotherapy clinics for the treatment of a range of cancers, including colorectal cancer, pain management and other disease states. It sells or rents new and pre-owned pole mounted and ambulatory infusion pumps to, and provides biomedical recertification, maintenance and repair services for oncology practices, as well as other alternate site settings, including home care and home infusion providers, skilled nursing facilities, pain centers and others."}, {"sector": "Consumer Services", "name": "InnSuites Hospitality Trust", "exchange": "AMEX", "symbol": "IHT", "beta": "-0.07", "industry": "Real Estate Investment Trusts", "description": "InnSuites Hospitality Trust is a real estate investment trust. The Trust is engaged in the ownership and operation of hotel properties. The Trust, with its affiliates RRF Limited Partnership and InnSuites Hotels, Inc., owns interest and operates approximately four hotels, provides management services for approximately six hotels and provides trademark license services for approximately seven hotels. The Trust operates through two segments: Hotel Operations & Corporate Overhead and IBC Developments. The Trust has approximately four moderate and full-service hotels with 574 hotel suites. The Trust's hotels are trademarked as InnSuites Hotels. The Trust is also involved in various operations incidental to the operation of hotels, such as the operation of restaurants, meeting/banquet room rentals and the operation of a reservation system."}, {"sector": "Health Care", "name": "InspireMD, Inc.", "exchange": "AMEX", "symbol": "NSPR", "beta": "1.73", "industry": "Medical/Dental Instruments", "description": "InspireMD, Inc. is a medical device company. The Company is focusing on the development and commercialization of its MicroNet stent platform technology for the treatment of vascular and coronary disease. Its MicroNet, a micron mesh sleeve, is wrapped over a stent to provide embolic protection in stenting procedures. Its CGuard carotid embolic prevention system (CGuard EPS) combines its MicroNet and a self-expandable nitinol stent in a single device for use in carotid artery applications. Its MGuard Prime Embolic Protection System (MGuard Prime EPS) is marketed for use in patients with acute coronary syndromes, notably acute myocardial infarction (heart attack) and saphenous vein graft coronary interventions (bypass surgery). It markets and sells MGuard Prime EPS, a bare-metal cobalt-chromium based stent, for the treatment of coronary disease in the European Union. It is also developing a neurovascular flow diverter (NGuard), which is an endovascular device."}, {"sector": "Technology", "name": "Intellicheck, Inc.", "exchange": "AMEX", "symbol": "IDN", "beta": "4.08", "industry": "Computer Software: Prepackaged Software", "description": "Intellicheck, Inc., formerly Intellicheck Mobilisa, Inc., is a technology company. The Company is engaged in developing, integrating and marketing wireless technology and identity systems for various applications, including mobile and handheld access control, and security systems for the government, military and commercial markets. Its primary businesses include Identity Systems products, which include commercial applications of identity card reading and verification, and government sales of defense security and identity card applications, and the development of wireless security applications. Its products include the Fugitive Finder systems, advanced ID card access control products protecting military and federal locations, and ID-Check, a technology that reads, analyzes and verifies encoded data in magnetic stripes and barcodes on government-issue identifications from the United States and Canadian jurisdictions designed to cater the financial, hospitality and retail sectors."}, {"sector": "Basic Industries", "name": "International Tower Hill Mines Ltd", "exchange": "AMEX", "symbol": "THM", "beta": "-1.49", "industry": "Precious Metals", "description": "International Tower Hill Mines Ltd.is a mineral exploration company. The Company is in the business of acquiring, exploring and evaluating mineral properties, and either joint venturing or developing these properties further or disposing of them when the evaluation is completed. It operates through the exploration and development of mineral properties segment. The Company owns the Livengood Gold Project in Alaska, the United States. The Livengood Gold Project is located approximately 70 miles northwest of Fairbanks, Alaska in the Tolovana mining district within the Tintina Gold Belt. The Livengood Gold Project has a mineral resource of approximately 730 million measured tons at an average grade of over 0.61 gram/ton (g/ton), approximately 70 million indicated tons at an average grade of approximately 0.56 g/ton and over 260 million inferred tons at an average grade of approximately 0.52 g/ton."}, {"sector": "Capital Goods", "name": "inTest Corporation", "exchange": "AMEX", "symbol": "INTT", "beta": "0.12", "industry": "Electrical Products", "description": "inTEST Corporation is an independent designer, manufacturer and marketer of thermal, mechanical and electrical products that are used by semiconductor manufacturers in conjunction with automated test equipment (ATE), in the testing of integrated circuit (ICs). The Company operates through three segments: Thermal Products, Mechanical Products and Electrical Products. Its thermal products are sold into the environmental test market encompassing a range of markets, including the ATE, automotive, consumer electronics, defense/aerospace, energy, industrial and telecommunications markets. It offers three lines of manipulator products: the in2(R), the Aero Series and the Cobal Series. Its electrical products, which include various types of tester interfaces, provide the electrical connections between the tester and the wafer prober or IC handler to carry the electrical signals between the tester and the probe card on the prober or the test socket on the handler."}, {"sector": "Consumer Services", "name": "Inuvo, Inc", "exchange": "AMEX", "symbol": "INUV", "beta": "0.48", "industry": "Advertising", "description": "Inuvo, Inc. (Inuvo) is an Internet advertising technology and digital publishing company. The Company operates through two segments: the Partner Network (advertising technology), and the Owned and Operated Network (digital publishing). Within the Partner Network segment, the Company recruits online publishers and provides them an advertising delivery service, the primary brands for which are ValidClick and SearchLinks. This service allows publishers the ability to place Inuvo advertising-technology in various locations and configurations within their Website or application for either a desktop or a mobile implementation. The Owned and Operated Network segment designs, builds and markets consumer Websites and applications. This segment consists of its main online property marketed under the ALOT brand and various other Websites targeted at specific demographics, such as EARNSPENDLIVE and sites designed for generating leads in a specific market vertical, such as ASKTHIS for automotive."}, {"sector": "n/a", "name": "Invesco Advantage Municipal Income Trust II", "exchange": "AMEX", "symbol": "VKI", "beta": "-0.11", "industry": "n/a", "description": "Invesco Advantage Municipal Income Trust II (the Trust) is a diversified, closed-end management investment company. The Trust's investment objective is to provide common shareholders with a high level of current income exempt from federal income tax, consistent with preservation of capital. Under normal market conditions, the Trust focuses on investing in municipal securities rated investment grade at the time of investment. Municipal securities include municipal bonds, municipal notes, municipal commercial paper and lease obligations. The Trust may also invest in non-investment-grade and unrated securities. It may invest in municipal securities that pay interest subject to the federal alternative minimum tax. The Trust may invest in securities that are subject to interest rate risk. The Trust invests in inverse floating rate securities, such as tender option bonds (TOBs), for investment purposes. Invesco Advisers, Inc. acts as the investment advisor of the Trust."}, {"sector": "Health Care", "name": "IsoRay, Inc.", "exchange": "AMEX", "symbol": "ISR", "beta": "0.92", "industry": "Medical/Dental Instruments", "description": "IsoRay, Inc. is a medical technology company. The Company, through its subsidiary, IsoRay Medical, Inc., develops, manufactures and sells isotope-based medical products and devices for the treatment of cancer and other malignant diseases. The Company is engaged in the production and sales of Cesium-131 (Cs-131) brachytherapy seeds. Brachytherapy seeds are small devices containing a therapeutic dose of radiation used in an interstitial radiation procedure. The brachytherapy procedure places radioactive seeds as close as possible to (in or near) the cancerous tumor. The Cs-131 includes radioisotope in the treatment of all malignant tumors, such as prostate cancer, brain cancer, breast cancer, colorectal cancer, gynecological cancer, lung cancer, liver cancer, ocular melanoma and pancreatic cancer. The Company's Proxcelan Cesium-131 seed is classified as a Class II device."}, {"sector": "Miscellaneous", "name": "Issuer Direct Corporation", "exchange": "AMEX", "symbol": "ISDR", "beta": "1.14", "industry": "Publishing", "description": "Issuer Direct Corporation is a provider of disclosure management solutions and cloud-based compliance technologies. The Company reports its products and services revenues in revenue streams, such as disclosure management, shareholder communications, and platforms and technology. The Company works with a client base in the financial services industry, including brokerage firms, banks and mutual funds. It also sells products and services to corporate issuers, professional firms, such as investor relations and public relations, and the accounting and the legal community. The Company's portfolio of brands and products include Issuer Direct, Investor Network, Accesswire, Blueprint, iProxy Direct, iR Direct, Annual Report Service (ARS) and Company Spotlight. It announces material financial information to investors using its investor relations Website, Securities and Exchange Commission (SEC) filings, investor events, news and earnings releases, public conference calls and Webcasts."}, {"sector": "Consumer Services", "name": "JRjr33, Inc.", "exchange": "AMEX", "symbol": "JRJR", "beta": "1.52", "industry": "Other Consumer Services", "description": "JRjr33, Inc. (JRJR), formerly CVSL Inc., offers a platform of direct-to-consumer brands. The Company operates through the segments, which include Gourmet Food, Nutritional and Wellness, Home Decor, Publishing and Printing, and Other. The Gourmet Food Products segment consists of operations related to the production and sale of hand-crafted spices, oils and other food products from around the world. The Home Decor segment consists of operations related to the production and sale of premium hand-crafted baskets, and the selling of products for the home, including pottery, cleaning, health, beauty, home, outdoor and customizable vinyl expressions for display. The Nutritionals and Wellness segment consists of operations related to the selling of nutritional supplements and skin care products. The Publishing and Printing Segment consists of the operations of Happenings Communications Group, Inc. and Paperly, Inc. The Other Segment consists of the operations of Tomboy Tools, Inc."}, {"sector": "Basic Industries", "name": "Klondex Mines Ltd.", "exchange": "AMEX", "symbol": "KLDX", "beta": "0.14", "industry": "Precious Metals", "description": "Klondex Mines Ltd is a Canada-based gold and silver mining company. The Company focuses on exploration, development and production of over two gold and silver projects in north central Nevada, being the Fire Creek mine located in Lander County, Nevada, the Midas mine and ore milling facility located in Nevada. Its segments include Fire Creek, Midas, True North, and Corporate and other. Its over 1,000 tons per day milling facility processes mineralized materials from the Midas Mine and the Fire Creek Mine. The Midas Mine is a gold-silver vein deposit located a mile from the town of Midas, Nevada. It also owns an underground mine project located in Manitoba, Canada, which includes the Rice Lake Mine and Mill complex, and early-stage exploration properties located in the State of Nevada, the United States, and Manitoba and Ontario, Canada. The Company's milling and processing facilities are located at Midas process ore from both Midas and Fire Creek in the State of Nevada."}, {"sector": "Finance", "name": "Ladenburg Thalmann Financial Services Inc", "exchange": "AMEX", "symbol": "LTS", "beta": "1.97", "industry": "Investment Bankers/Brokers/Service", "description": "Ladenburg Thalmann Financial Services Inc. is a financial services company engaged in independent brokerage and advisory services, investment banking, equity research, institutional sales and trading, asset management services, wholesale life insurance brokerage and trust services. It operates through three segments: the independent brokerage and advisory services segment, the Ladenburg segment and the insurance brokerage segment. The independent brokerage and advisory services segment includes the broker-dealer and investment advisory services provided by its independent broker-dealer subsidiaries to their independent contractor financial advisors and the wealth management services provided by Premier Trust, Inc. The Ladenburg segment includes the investment banking, sales and trading and asset management services, and investment activities. The insurance brokerage segment includes the wholesale insurance brokerage activities provided by Highland Capital Brokerage, Inc."}, {"sector": "n/a", "name": "Ladenburg Thalmann Financial Services Inc", "exchange": "AMEX", "symbol": "LTS^A", "beta": "0.22", "industry": "n/a", "description": "Ladenburg Thalmann Financial Services Inc. is a financial services company engaged in independent brokerage and advisory services, investment banking, equity research, institutional sales and trading, asset management services, wholesale life insurance brokerage and trust services. It operates through three segments: the independent brokerage and advisory services segment, the Ladenburg segment and the insurance brokerage segment. The independent brokerage and advisory services segment includes the broker-dealer and investment advisory services provided by its independent broker-dealer subsidiaries to their independent contractor financial advisors and the wealth management services provided by Premier Trust, Inc. The Ladenburg segment includes the investment banking, sales and trading and asset management services, and investment activities. The insurance brokerage segment includes the wholesale insurance brokerage activities provided by Highland Capital Brokerage, Inc."}, {"sector": "n/a", "name": "Latin America Equity Fund, Inc. (The)", "exchange": "AMEX", "symbol": "LAQ", "beta": "1.06", "industry": "n/a", "description": "Aberdeen Latin America Equity Fund, Inc. (the Fund) is a non-diversified closed-end, management investment company. The Fund's investment objective is to seek long-term capital appreciation by investing in Latin American equity securities. The Fund may invest approximately 10% of its assets (at the time of commitment) in illiquid equity securities, including securities of private equity funds (whether in corporate or partnership form) that invest in emerging markets. The Fund invests in sectors, including information technology, financials, healthcare, materials, energy, real estate, consumer staples, utilities, industrials, consumer discretionary. It invests in various geographical locations, including Brazil, Mexico, Chile, Argentina, Colombia, the United States and Peru. Aberdeen Asset Managers Limited (AAML) serves as the Fund's investment advisor. AAML is a subsidiary of Aberdeen Asset Management PLC, which is the Fund's Administrator."}, {"sector": "Capital Goods", "name": "LGL Group, Inc. (The)", "exchange": "AMEX", "symbol": "LGL", "beta": "0.54", "industry": "Industrial Machinery/Components", "description": "The LGL Group, Inc. is a holding company. The Company operates through its subsidiary, M-tron Industries, Inc., which includes the operations of Piezo Technology, Inc. and M-tron Asia, LLC (collectively, MtronPTI). The Company operates through electronic components segment, which includes all products manufactured and sold by MtronPTI. MtronPTI designs, markets and manufactures frequency and spectrum control products. MtronPTI's portfolio is divided into two product groupings: Frequency Control and Spectrum Control. Frequency Control product group includes a portfolio of clock oscillators, voltage-controlled crystal oscillator, temperature compensated crystal oscillator and oven-controlled crystal oscillator. Spectrum Control product group includes a range of radio frequency (RF), microwave and millimeter wave filters and diplexers covering a frequency range from 1 megahertz (MHz) to 90 gigahertz (GHz), and solid state power amplifiers."}, {"sector": "Capital Goods", "name": "Libbey, Inc.", "exchange": "AMEX", "symbol": "LBY", "beta": "1.04", "industry": "Industrial Machinery/Components", "description": "Libbey Inc. is engaged in the design, production and sale of tableware and other products. The Company's segments are U.S. & Canada; Latin America; Europe, the Middle East and Africa (EMEA) and Other. The U.S. & Canada segment includes sales of manufactured and sourced tableware having an end market destination in the United States and Canada, excluding glass products for original equipment manufacturers (OEMs), which remain in the Latin America segment. The Latin America segment includes primarily sales of manufactured and sourced glass tableware having an end market destination in Latin America, including glass products for OEMs that have an end market destination outside of Latin America. The EMEA segment includes primarily sales of manufactured and sourced glass tableware having an end market destination in Europe, the Middle East and Africa. The Other segment includes primarily sales of manufactured and sourced glass tableware having an end market destination in Asia Pacific."}, {"sector": "Energy", "name": "Lilis Energy, Inc.", "exchange": "AMEX", "symbol": "LLEX", "beta": "-1.12", "industry": "Oil & Gas Production", "description": "Lilis Energy, Inc. is an upstream independent oil and gas company. The Company is engaged in the acquisition, drilling and production of oil and natural gas properties and prospects. The Company drills for, operates and produces oil and natural gas wells through its land holdings located in Wyoming, Colorado, and Nebraska. The vertical well produces approximately 690 net million cubic feet (mcf) per day. The well holds the lease to all depths, from surface down to approximately 22,000 feet, including the Wolfcamp, Bone Springs, and Avalon formations."}, {"sector": "Technology", "name": "LiqTech International, Inc.", "exchange": "AMEX", "symbol": "LIQT", "beta": "1.31", "industry": "Industrial Machinery/Components", "description": "LiqTech International, Inc. is a clean technology company that provides technologies for gas and liquid purification by manufacturing ceramic silicon carbide filters. The Company develops and manufactures products of re-crystallized silicon carbide. It specializes in two business areas, which include ceramic membranes for liquid filtration, and diesel particulate filters (DPFs) for the control of soot exhaust particles from diesel engines. Under the LiqTech, Cometas and Provital brand names, it manufactures and sells ceramic silicon carbide membranes and systems for liquid filtration using silicon carbide technology that focus on hydrocarbon production-derived contaminated water and pre-filtration for reverse osmosis. It offers DPFs for exhaust emission control solutions to the retrofit and the original equipment manufacturer markets. It also offers Kiln furniture, which refers to various items used in a kiln to support ceramics that maximizes the number of items for each firing."}, {"sector": "Basic Industries", "name": "MAG Silver Corporation", "exchange": "AMEX", "symbol": "MAG", "beta": "0.51", "industry": "Precious Metals", "description": "MAG Silver Corp. is a mineral exploration and development company. The Company is focused on the acquisition, exploration and development of projects located within the Mexican silver belt. The Company operates through the exploration of mineral properties in Mexico segment. The Company's projects include Juanicipio Property, Cinco De Mayo Property and Guigui Property. Juanicipio Property is located in the Fresnillo District, Zacatecas State, Mexico. The Juanicipio Property includes silver-gold-lead-zinc epithermal vein deposit. The Company owns the mineral concessions comprising the Cinco de Mayo Property. The Cinco de Mayo Property is located approximately 190 kilometers northwest of the city of Chihuahua, in northern Chihuahua State, Mexico, and covers approximately 25,110 hectares. The Company owns the Guigui project located in the Santa Eulalia Mining District of Chihuahua, Mexico. Guigui project consists of approximately 8,300 hectares."}, {"sector": "Technology", "name": "Majesco", "exchange": "AMEX", "symbol": "MJCO", "beta": "-2.78", "industry": "Computer Software: Prepackaged Software", "description": "Majesco is a provider of insurance software, consulting and services for insurance industry. The Company operates through the software solutions provider for the insurance industry segment. The Company offers insurance software solutions for Property and Casualty or General Insurance (P&C), Life, Annuities (L&A), and Pensions and Group or Employee Benefits providers, allowing them to manage policy management, claims management and billing functions. In addition, the Company offers a range of other technology-based solutions for distribution management, digital, data and cloud that enable organizations to automate business processes across the end-to-end insurance value chain and comply with policies and regulations across their organizations. The Company's offering consists of software solutions for all lines of business in insurance industry; services, including project delivery and implementation of its solutions, and consulting and services."}, {"sector": "Consumer Services", "name": "Mastech Digital, Inc", "exchange": "AMEX", "symbol": "MHH", "beta": "1.48", "industry": "Professional Services", "description": "Mastech Digital, Inc., formerly Mastech Holdings, Inc., is an information technology (IT) staffing and digital transformation services company. The Company offers Social, Mobility, Analytics and Cloud (SMAC), Automation and Internet of Things (IoT) technologies. It is engaged in providing IT associates in digital and mainstream technologies, digital transformation services around Salesforce.com and SAP HANA, as well as digital learning services. SAP HANA is an in-memory platform both for Systems, Applications and Products (SAP) and non-SAP customers. Its stack of digital transformation services focuses on providing customer relationship management (CRM) on the cloud through Salesforce, driving IT efficiencies through SAP HANA and using digital methods. Its digital learning services puts together a custom training program for various organizational needs. The Company serves a range of industries, including insurance, banking, healthcare, aviation, manufacturing and telecommunication."}, {"sector": "Health Care", "name": "Matinas Biopharma Holdings, Inc.", "exchange": "AMEX", "symbol": "MTNB", "beta": "0.67", "industry": "Major Pharmaceuticals", "description": "Matinas BioPharma Holdings, Inc. is a clinical-stage biopharmaceutical company. The Company is engaged in identifying and developing therapeutics for the treatment of serious and life-threatening infections. It is engaged in developing a pipeline of product and development candidates, with an initial focus on serious fungal and bacterial infections. Its cochleate delivery technology platform is designed for the targeted delivery of pharmaceuticals directly to the site of infection or inflammation. Its MAT 2203 is an oral formulation of a spectrum anti-fungal drug called amphotericin B, which uses its cochleate delivery technology. Its MAT2501 is an orally administered, encochleated formulation of the spectrum aminoglycoside antibiotic amikacin, which may be used to treat different types of multidrug-resistant bacteria, including non-tubercular mycobacterial infections (NTM), as well as various multidrug-resistant gram negative and intracellular bacterial infections."}, {"sector": "Consumer Services", "name": "McClatchy Company (The)", "exchange": "AMEX", "symbol": "MNI", "beta": "0.93", "industry": "Newspapers/Magazines", "description": "The McClatchy Company is a news and information publisher of various publications, such as the Miami Herald, The Sacramento Bee, The Charlotte Observer, The (Raleigh) News and Observer, and the (Fort Worth) Star-Telegram. The Company's segments include Western Segment and Eastern Segment. Its Western Segment consists of its newspaper operations in California, the Northwest and the Midwest. The Company's Eastern Segment consists primarily of newspaper operations in the Southeast and Florida. The Company operates 30 media companies in 29 United States markets in 14 states, providing each of these communities with news and advertising services in a range of digital and print formats. The Company's operations include approximately 30 local media businesses in in over 30 growth markets across the United States that consist of daily newspapers, Websites and mobile applications, mobile news and advertising, video products, publications, direct marketing and direct mail services."}, {"sector": "Energy", "name": "Mexco Energy Corporation", "exchange": "AMEX", "symbol": "MXC", "beta": "0.93", "industry": "Oil & Gas Production", "description": "Mexco Energy Corporation is an independent oil and gas company. The Company is engaged in the exploration, development and production of natural gas and crude oil properties located in the United States. At March 31, 2016, its total estimated proved reserves were approximately 2.051 million barrels of oil equivalent (Boe) of which 53% was oil and natural gas liquids and 47% was natural gas. It also owns producing properties and undeveloped acreage in approximately 10 states. It acquires interests in producing and non-producing oil and gas leases from landowners and leaseholders in areas considered favorable for oil and gas exploration, development and production. It may acquire oil and gas interests by joining in oil and gas drilling prospects generated by third parties. It owns interests in and operates approximately 10 producing wells and a water injection well. Its subsidiaries include Forman Energy Corporation, Southwest Texas Disposal Corporation and TBO Oil & Gas, LLC."}, {"sector": "n/a", "name": "MFS California Insured Municipal Trust", "exchange": "AMEX", "symbol": "CCA", "beta": "0.72", "industry": "n/a", "description": "Cogeco Communications Inc., formerly Cogeco Cable Inc., is a Canada-based communications company. The Company provides residential and business customers with video, Internet and telephony services through its two-way broadband fiber networks. The Company operates through three segments: Canadian broadband services, American broadband services and Business information and communications technology (Business ICT) services. The Canadian and American broadband services segments provide a range of video, Internet and telephony services primarily to residential customers and also provide business services to small and medium sized businesses across their coverage areas. The Business ICT services segment provides colocation, network connectivity, hosting, cloud and a portfolio of managed services primarily in Canada, the United States and Europe to small, medium and large enterprises around the world."}, {"sector": "Health Care", "name": "Micron Solutions, Inc.", "exchange": "AMEX", "symbol": "MICR", "beta": "0.17", "industry": "Biotechnology: Electromedical & Electrotherapeutic Apparatus", "description": "Micron Solutions, Inc., formerly Arrhythmia Research Technology, Inc., is a contract manufacturing organization (CMO). The Company, through its subsidiary, Micron Products, Inc. (Micron), produces medical device technologies requiring precision machining and injection molding. The Company also manufactures components, devices and equipment for military, law enforcement, automotive and consumer product applications. The Company is engaged in the production and sale of silver/silver chloride coated and conductive resin sensors used as consumable component parts in the manufacture of integrated disposable electrophysiological sensors. Micron provides design and engineering services across the Company's three product lines, machining, thermoplastic injection molding and sensors."}, {"sector": "Health Care", "name": "Milestone Scientific, Inc.", "exchange": "AMEX", "symbol": "MLSS", "beta": "0.28", "industry": "Industrial Specialties", "description": "Milestone Scientific Inc. (Milestone) is engaged in providing computer-controlled injection technologies and solutions for the medical and dental markets. The Company uses its CompuFlo technology for the delivery of medicaments. The CompuFlo pressure or force Computer-Controlled Local Anesthetic Delivery (C-CLAD) technology is a medical technology for the delivery of drugs, anesthetics and other medicaments into various tissue types. Milestone's product portfolio includes Single Tooth Anesthesia Instrument (STA Instrument), CompuDent, CompuMed and The Wand. The Company's STA Instrument is a computer-controlled local anesthesia delivery instrument that utilizes the pressure feedback elements of Milestone's CompuFlo technology. CompuDent (also known as the Wand Plus internationally) is Milestone's C-CLAD instrument. CompuMed is a computer-controlled injection instrument offered by the Company. The Wand handpiece is used in conjunction with the STA, CompuDent and CompuMed instruments."}, {"sector": "n/a", "name": "MuniVest Fund, Inc.", "exchange": "AMEX", "symbol": "MVF", "beta": "0.00", "industry": "n/a", "description": "BlackRock MuniVest Fund, Inc. is a non-diversified, closed-end management investment company. The Trust's investment objective is to provide shareholders with as high a level of current income exempt from federal income taxes as is consistent with its investment policies and prudent investment management. It seeks to achieve its investment objective by investing at least 80% of an aggregate of the Trust's net assets and the proceeds of any borrowing for investment purposes, in municipal obligations exempt from federal income taxes. The Trust invests in long-term municipal obligations rated investment grade at the time of investment and in long term municipal obligations with maturities of over 10 years at the time of investment. It may invest up to 20% of its total assets in securities rated below investment grade at the time of purchase. It may invest directly in such securities or synthetically through the use of derivatives. Its investment advisor is BlackRock Advisors, LLC."}, {"sector": "Health Care", "name": "Myomo Inc.", "exchange": "AMEX", "symbol": "MYO", "beta": "", "industry": "Industrial Specialties", "description": "Myob Group Limited is an Australia-based provider of cloud based business management solutions. The Company operates through three segment: Small and Medium Sized Enterprise (SME) Solutions, Practice Solutions and Enterprise Solutions. Its SME Solutions segment provides business management software and services to small and medium enterprises. Its Practice Solutions segment provides business software and services to accounting professionals in practice. Its Enterprise Solutions segment provides enterprise resource planning and human resource management software and services to medium and large enterprises. It provides its services to accountants, bookkeepers and enterprises in Australia and New Zealand. Its products include PayDirect Online, YourPay, PayAgent, MYOB Advanced, MYOB PayGlobal, MYOB Greentree. It also offers accounting, payroll, tax and other solutions. It also provides practice software, including client accounting, practice management, tax and document management."}, {"sector": "Health Care", "name": "NanoViricides, Inc.", "exchange": "AMEX", "symbol": "NNVC", "beta": "0.37", "industry": "Biotechnology: Commercial Physical & Biological Resarch", "description": "NanoViricides, Inc. is a nano-biopharmaceutical company. The Company is a development-stage company with several drugs in various stages of development. The Company focuses on its research and clinical programs on specific anti-viral therapeutics. The Company is engaged in the application of nanomedicine technologies to the issues of viral diseases. The Company's nanoviricide technology enables direct attacks at multiple points on a virus particle. In addition, the nanoviricide technology also simultaneously enables attacking the intracellular reproduction of the virus by incorporating one or more active pharmaceutical ingredients (APIs) within the core of the nanoviricide. The nanoviricide technology is engaged in both attacking extracellular virus thereby breaking the reinfection cycle, and simultaneously disrupting intracellular production of the virus, thereby enabling complete control of a virus infection."}, {"sector": "Health Care", "name": "National HealthCare Corporation", "exchange": "AMEX", "symbol": "NHC", "beta": "0.41", "industry": "Hospital/Nursing Management", "description": "National HealthCare Corporation (NHC) is engaged in the operation of skilled nursing facilities, assisted living facilities, independent living facilities and homecare programs. The Company is engaged in the post-acute healthcare industry segment. Its business activities include providing sub-acute and post-acute skilled nursing care, intermediate nursing care, rehabilitative care, memory and Alzheimer's care, senior living services, and home healthcare services. It has interest in a hospice care business that services NHC owned healthcare centers and others. In addition, it provides management services, accounting and financial services, as well as insurance services to third-party operators of healthcare facilities. As of December 31, 2016, it owned the real estate of 13 healthcare properties and leased these properties to third-party operators. As of December 31, 2016, it operated in 10 states, and its owned and leased properties are located in various parts of the United States."}, {"sector": "Health Care", "name": "Navidea Biopharmaceuticals, Inc.", "exchange": "AMEX", "symbol": "NAVB", "beta": "-0.74", "industry": "Biotechnology: In Vitro & In Vivo Diagnostic Substances", "description": "Navidea Biopharmaceuticals, Inc. is a biopharmaceutical company focused on the development and commercialization of precision immunodiagnostic agents and immunotherapeutics. The Company is developing multiple precision-targeted products based on the Manocept platform to help identify the sites and pathways of undetected disease. The Manocept platform is predicated on the ability to specifically target the CD206 mannose receptor expressed on activated macrophages. NAV5001 is an iodine-123 (I-123) radiolabeled single-photon emission computed tomography (SPECT) imaging agent being developed as an aid in the diagnosis of Parkinson's disease (PD) and other movement disorders, with potential use as a diagnostic aid in dementia. NAV4694 is a fluorine-18 (F-18) radiolabeled positron emission tomography (PET) imaging agent being developed as an aid in the diagnosis of patients with signs or symptoms of Alzheimer's disease (AD) and mild cognitive impairment (MCI)."}, {"sector": "Miscellaneous", "name": "Network-1 Technologies, Inc.", "exchange": "AMEX", "symbol": "NTIP", "beta": "0.60", "industry": "Multi-Sector Companies", "description": "Network-1 Technologies, Inc. is engaged in the development, licensing and protection of its property assets. The Company owns over 27 patents, including the remote power patent (Remote Power Patent) covering the delivery of power over Ethernet (PoE) cables for the purpose of remotely powering network devices, such as wireless access ports, Internet protocol (IP) phones and network based cameras; the Mirror Worlds patent portfolio (the Mirror Worlds Patent Portfolio) relating to foundational technologies that enable unified search and indexing, displaying and archiving of documents in a computer system; the Cox patent portfolio (the Cox Patent Portfolio) relating to enabling technology for identifying media content on the Internet, and the QoS patents (the QoS Patents) covering systems and methods for the transmission of audio, video and data in order to achieve high quality of service (QoS) over computer and telephony networks."}, {"sector": "n/a", "name": "Neuberger Berman California Intermediate Municipal Fund Inc.", "exchange": "AMEX", "symbol": "NBW", "beta": "0.04", "industry": "n/a", "description": "Neuberger Berman California Intermediate Municipal Fund Inc. is a non-diversified, closed-end management investment company. The Fund's investment objective is to provide a high level of current income exempt from regular federal income tax and, for each state-specific Fund, a high level of current income exempt from that state's personal income taxes. Under normal market conditions, the Fund will invest approximately 80% of its total assets in securities with remaining maturities of less than 15 years and approximately 90% of its total assets in securities that are exempt from federal income tax and the state income tax of California. The Fund's portfolio of investments includes in states and territories, such as American Samoa, California, Florida, Georgia, Guam, Illinois, Louisiana, Nevada, New Jersey, North Carolina, Pennsylvania, Puerto Rico, Tennessee, Texas and Virgin Islands. Neuberger Berman Investment Advisers LLC serves as the Fund's investment manager."}, {"sector": "n/a", "name": "Neuberger Berman High Yield Strategies Fund", "exchange": "AMEX", "symbol": "NHS", "beta": "0.71", "industry": "n/a", "description": "Neuberger Berman High Yield Strategies Fund Inc. is a non-diversified, closed-end management investment company. The Fund seeks total return (income plus capital appreciation). The Fund normally invests at least 80% of its total assets in high yield debt securities of the United States and foreign issuers, which include securities that are rated below investment grade by a rating agency or are unrated debt securities determined to be of comparable quality by the Fund's investment manager. The Fund invests in sectors, including cable and satellite television, chemicals, consumer - commercial lease financing, electric-generation, food and drug retailers, gaming, gas distribution, health services, media content, medical products, metals and mining, oil field equipment and services, pharmaceuticals, printing and publishing, software-services, telecom-satellite and theaters and entertainment. Neuberger Berman Management LLC is the investment manager of the Fund."}, {"sector": "n/a", "name": "Neuberger Berman Intermediate Municipal Fund Inc.", "exchange": "AMEX", "symbol": "NBH", "beta": "-0.05", "industry": "n/a", "description": "Neuberger Berman Intermediate Municipal Fund Inc. is a diversified, closed-end management investment company that invests primarily in municipal securities. The Fund's investment objective is to provide a high level of current income exempt from regular federal income tax. It invests approximately 80% of total assets in municipal bonds with remaining maturities of less than 15 years and seeks to maintain a dollar weighted average duration between 3 and 8 years. Its investment portfolio includes revenue bonds, general obligations, pre-refunded bonds and short-term investments. Its investment portfolio by state and territory includes Alabama, Missouri, American Samoa, Nevada, Arizona, New Hampshire, California, New Jersey, Colorado, New Mexico, Connecticut, New York, Florida, Georgia, Guam, Hawaii, Indiana, Iowa, Maine, Maryland, Massachusetts, Michigan, Mississippi, Minnesota, Wisconsin and Washington. The Fund's investment manager is Neuberger Berman Investment Advisers LLC."}, {"sector": "n/a", "name": "Neuberger Berman MLP Income Fund Inc.", "exchange": "AMEX", "symbol": "NML", "beta": "1.55", "industry": "n/a", "description": "New Millennium Iron Corp. is engaged in the exploration, evaluation and development of mineral properties. The Company operates through the exploration and evaluation of mineral resources segment. Its Taconite Project has centered on the development of either or both of the LabMag and KeMag deposits to produce pellets and concentrate. The LabMag Property is located in Western Labrador, centered approximately 30 kilometers to the northwest of the town of Schefferville, Quebec. It controls the Millennium Iron Range (MIR), which holds undeveloped magnetic iron ore deposits in Canada's iron ore district, the Labrador Trough, located in the Province of Newfoundland and Labrador and in the Province of Quebec. The Howells River North deposits are located between the LabMag and KeMag deposits. The Lac Ritchie property is located at the north end of the Range. The Direct Shipping Ore (DSO) Project contains approximately 98.9 million tons of measured and indicated mineral resources."}, {"sector": "n/a", "name": "Neuberger Berman New York Intermediate Municipal Fund Inc.", "exchange": "AMEX", "symbol": "NBO", "beta": "-0.09", "industry": "n/a", "description": "Neuberger Berman New York Intermediate Municipal Fund Inc. is a non-diversified, closed-end management investment company that invests primarily in municipal securities. The Fund's investment objective is to provide a high level of current income exempt from regular federal income tax and a high level of current income exempt from the New York and New York City personal income tax. The Fund will invest approximately 80% of its total assets in securities with remaining maturities of less than 15 years and approximately 90% of its total assets in securities that are exempt from federal income tax, the state income tax of New York and New York City personal income tax. The Fund invests a substantial portion of its assets in municipal bonds of issuers located in the state of New York. The Fund's investment portfolio includes revenue bonds, general obligations, short-term investments and pre-funded bonds. The Fund's investment manager is Neuberger Berman Investment Advisers LLC."}, {"sector": "n/a", "name": "Neuberger Berman Real Estate Securities Income Fund, Inc.", "exchange": "AMEX", "symbol": "NRO", "beta": "0.75", "industry": "n/a", "description": "Neuberger Berman Real Estate Securities Income Fund Inc. is a non-diversified, closed-end management investment company. The Fund seeks to provide high current income with capital appreciation as a secondary objective. It has a portfolio with a mix of equity securities of real estate investment trusts (REITs) and other real estate companies. Under normal market conditions, its investments are concentrated in income producing common equity securities, preferred securities, convertible securities and non-convertible debt securities issued by companies deriving their revenue from the ownership, construction, financing, management and/or sale of commercial, industrial, and/or residential real estate. It invests in various sectors, such as apartments, data centers, healthcare, lodging/resorts, manufactured homes, regional malls, self-storage, home financing and commercial financing. Neuberger Berman Investment Advisers LLC is an investment manager of the Fund."}, {"sector": "Consumer Services", "name": "Nevada Gold & Casinos, Inc.", "exchange": "AMEX", "symbol": "UWN", "beta": "0.67", "industry": "Services-Misc. Amusement & Recreation", "description": "Nevada Gold & Casinos, Inc. is a gaming company involved in financing, developing, owning and operating gaming properties and projects. The Company's segments include Washington, South Dakota, Nevada and Corporate. The Company operated a portfolio of nine mini-casinos in Washington State (Washington), which include restaurants, bars and approximately 126 table games, at April 30, 2016. The Company owned A.G. Trucano, Son and Grandsons, Inc. (South Dakota), a slot machine route operation in Deadwood, South Dakota consisting of over 705 slot machines in 16 locations, at April 30, 2016. It also owns Club Fortune Casino in Henderson, Nevada. As of April 30, 2016, it had approximately 540 slot machines, seven table games and a poker room, two bars, an entertainment lounge, a William Hill sports book, a cafe, a snack bar, and a gift shop. Its gaming facility operations are located in the United States, specifically in the states of Nevada, Washington and South Dakota."}, {"sector": "Basic Industries", "name": "Nevsun Resources Ltd", "exchange": "AMEX", "symbol": "NSU", "beta": "0.91", "industry": "Precious Metals", "description": "Nevsun Resources Ltd. is a base metals company. The Company's two principal properties are the Timok Project in Serbia, which hosts the copper-gold Cukaru Peki deposit on the Brestovac-Metovnica Exploration Permit (the B-M Permit) and the Bisha Property in Eritrea, which hosts the copper-zinc-gold Bisha deposit and includes satellite volcanogenic massive sulphides (VMS) deposits at Harena, Northwest, Hambok and Asheli. The Company's principal mining operation is the Bisha Mine, which is located on the Bisha Property. The Timok Project is located in eastern Serbia near the Bor Mining and Smelting complex. The Timok project is located within the central zone of the Timok Magmatic Complex (TMC), in the Serbian section of the East European Carpathian-Balkan Arc. In addition, the Company owns the New Mogoraib River Exploration License, which covers an area of 630 square kilometers and the Tabakin Exploration License covering 184 square kilometers both adjacent to the Bisha Mining License."}, {"sector": "Energy", "name": "New Concept Energy, Inc", "exchange": "AMEX", "symbol": "GBR", "beta": "2.14", "industry": "Oil & Gas Production", "description": "New Concept Energy, Inc. is an oil and gas company. The Company, through its subsidiaries Mountaineer State Energy, Inc. and Mountaineer State Operations, LLC, owns and operates oil and gas wells, and mineral leases in Athens and Meigs Counties in Ohio and in Calhoun, Jackson and Roane Counties in West Virginia. The Company operates through two segments: oil and gas operations, and retirement facilities. The Company has approximately 153 producing gas wells, over 31 non-producing wells and related equipment and mineral leases covering approximately 20,000 acres. The Company leases and operates Pacific Pointe Retirement Inn (Pacific Pointe) in King City, Oregon. Pacific Pointe, a retirement center, has a capacity of approximately 114 residents and provides community living with basic services, such as meals, housekeeping, laundry, around the clock staffing, transportation, and social and recreational activities."}, {"sector": "Consumer Services", "name": "New England Realty Associates Limited Partnership", "exchange": "AMEX", "symbol": "NEN", "beta": "0.59", "industry": "Building operators", "description": "New England Realty Associates Limited Partnership is engaged in the business of acquiring, developing, holding for investment, operating and selling real estate. The Company, directly or through approximately 30 subsidiary limited partnerships or limited liability companies, owns and operates various residential apartment buildings, condominium units and commercial properties located in Massachusetts and New Hampshire. The Company and its subsidiary limited partnerships and limited liabilities companies (Subsidiary Partnerships) owned approximately 2,510 residential apartment units in approximately 20 residential and mixed-use complexes (collectively, the Apartment Complexes). The Company also owns approximately 20 condominium units in a residential condominium complex, all of which are leased to residential tenants. The Apartment Complexes, the condominium units and the investment properties are located in the metropolitan Boston area of Massachusetts."}, {"sector": "Basic Industries", "name": "New Gold Inc.", "exchange": "AMEX", "symbol": "NGD", "beta": "0.19", "industry": "Precious Metals", "description": "New Gold Inc. is an intermediate gold mining company. The Company is engaged in the development and operation of mineral properties. Its segments include New Afton, Mesquite, Peak Mines, Cerro San Pedro, Corporate and Other. It has operating mines in Canada, the United States, Australia and Mexico; development projects in Canada, and a stream on gold production from a development property in Chile. Its development projects include Rainy River and Blackwater projects, which are located in Canada. Its Rainy River project is a gold project located approximately 65 kilometers northwest of Fort Frances in northwestern Ontario, Canada. The Rainy River comprises approximately 192 square kilometers of various rights and claims. The Blackwater Project is located approximately 160 kilometers southwest of the city of Prince George in central British Columbia, Canada and 110 kilometers southwest of the town of Vanderhoof. The Blackwater project covers an area of over 1,000 square kilometers."}, {"sector": "Basic Industries", "name": "Nexgen Energy Ltd.", "exchange": "AMEX", "symbol": "NXE", "beta": "", "industry": "Precious Metals", "description": "NexGen Energy Ltd., formerly Clermont Capital Inc., is a Canada-based exploration-stage company. The Company operates in the segment of acquisition, exploration and development of uranium properties. It operates as a mineral exploration and development company with a portfolio of projects that span the Athabasca Basin in Saskatchewan, Canada. The Company's projects include Arrow, Rook I; Bow/Regional, Rook I, and Thorburn Lake. Rook I is its owned flagship property, which hosts the land-based, basement hosted and Arrow deposit consisting of a series of over four sub-vertical mineralized shear zones, A1 to A4, which vary in thicknesses between 4 and 25 meters. The Rook I property also hosts the Bow discovery, which is located approximately 3.7 kilometers northeast into the Athabasca Basin from Arrow. The Company owns the Thorburn Lake property, which is located over seven kilometers east of and on trend with the Cigar Lake mine. It has not generated any revenues."}, {"sector": "Basic Industries", "name": "Northern Dynasty Minerals, Ltd.", "exchange": "AMEX", "symbol": "NAK", "beta": "0.81", "industry": "Precious Metals", "description": "Northern Dynasty Minerals Ltd. is a mineral exploration company. The Company, through its subsidiaries, holds interest in mining claims on State of Alaska land in southwest Alaska, the United States, which are part of the Pebble Copper-Gold-Molybdenum Project (the Pebble Project). The Pebble Project is located in southwest Alaska, approximately 20 miles from the villages of Iliamna and Newhalen, and over 200 miles (approximately 320 kilometers) southwest of the city of Anchorage. The property consists of approximately 2,400 mineral claims and is situated over 1,000 feet above sea-level and approximately 60 miles from tidewater on Cook Inlet. The Company is in the process of exploring and developing the Pebble Project."}, {"sector": "Energy", "name": "Northern Oil and Gas, Inc.", "exchange": "AMEX", "symbol": "NOG", "beta": "1.33", "industry": "Oil & Gas Production", "description": "Northern Oil and Gas, Inc. is an independent energy company. The Company is engaged in the acquisition, exploration, development and production of oil and natural gas properties, primarily in the Bakken and Three Forks formations within the Williston Basin in North Dakota and Montana. The Company holds working interests in over 2,630 gross (204.3 net) producing wells, including over 2,630 wells targeting the Bakken and Three Forks formations and over two wells targeting other formations. The Company leases approximately 165,910 net acres, all located in the Williston Basin. The Company engages in oil exploration and production through non-operated working interests in wells drilled and completed in spacing units that include its acreage. The Company's proved reserves are approximately 65.3 million barrels of oil equivalent (MMBoe)."}, {"sector": "Health Care", "name": "NovaBay Pharmaceuticals, Inc.", "exchange": "AMEX", "symbol": "NBY", "beta": "-0.74", "industry": "Major Pharmaceuticals", "description": "NovaBay Pharmaceuticals, Inc., formerly NovaCal Pharmaceuticals, Inc., is a biopharmaceutical company, which develops products for the eye care market. The Company focuses on commercializing prescription Avenova for managing hygiene of the eyelids and lashes in the United States. Avenova is an eye care product formulated with a form of hypochlorous acid called Neutrox. Its Avenova with Neutrox removes debris from the skin on the eyelids and lashes without burning or stinging. It develops additional products containing Neutrox, including its NeutroPhase Skin and Wound Cleanser for wound care and CelleRx for the dermatology market. Its Aganocide compounds, led by auriclosene (NVC-422), are synthetic molecules with activity against bacteria, viruses and fungi. The Company's dermatology product includes CelleRx, a cleansing solution for post laser resurfacing, chemical peels and other cosmetic surgery procedures. Its wound care business includes the business of NeutroPhase product."}, {"sector": "Basic Industries", "name": "Novagold Resources Inc.", "exchange": "AMEX", "symbol": "NG", "beta": "0.32", "industry": "Precious Metals", "description": "Novagold Resources Inc. is a mineral exploration company. The Company is engaged in the exploration and development of mineral properties. The Company's segments include the Donlin Gold project in Alaska, the United States and the Galore Creek project in British Columbia, Canada. The Company operates in the gold mining industry, primarily focused on advancing permitting of the Donlin Gold project in Alaska. The Company has its interest in the Copper Canyon copper-gold-silver property that is adjacent to the Galore Creek project. The Donlin Gold property is located in the Kuskokwim region of southwestern Alaska on private, Alaska Native-owned mineral and surface land, and Alaska state mining claims. The Galore Creek project is a copper-gold-silver project located in northwestern British Columbia. The Company's subsidiaries include NOVAGOLD Canada Inc., Copper Canyon Resources Inc., NOVAGOLD U.S. Holdings Inc., NOVAGOLD Resources Alaska Inc. and AGC Resources Inc."}, {"sector": "Consumer Services", "name": "NTN Buzztime, Inc.", "exchange": "AMEX", "symbol": "NTN", "beta": "0.60", "industry": "Broadcasting", "description": "NTN Buzztime, Inc., formerly Alroy Industries, delivers entertainment and dining technology to bars and restaurants in North America. The Company provides an entertainment and marketing services platform for hospitality venues that offers games, events, and entertainment experiences to their customers. Its customers offer guests trivia, card, sports and arcade games, nationwide competitions, and self-service dining features, including dynamic menus, touchscreen ordering and secure payment by licensing the Company's customizable solution. Its platform creates connections among the players and venues. Its network subscriber venues are related to national and regional restaurant brands, including Buffalo Wild Wings, Old Chicago, Beef O'Brady's, Aroogas, Buffalo Wings & Rings, Native New Yorker and Boston Pizza. Its entertainment system enables players to interact at the venue, and it also enables competition between venues, referred to as multiplayer gaming."}, {"sector": "n/a", "name": "Nuveen New Jersey Municipal Value Fund", "exchange": "AMEX", "symbol": "NJV", "beta": "-0.06", "industry": "n/a", "description": "Nuveen New Jersey Municipal Value Fund (the Fund) is a diversified closed-end management investment company. The Fund seeks to provide current income exempt from both regular federal and designated state income taxes by investing in a portfolio of municipal obligations issued by state and local government authorities within a single state or certain United States territories. It invests at least 80% of its managed assets in municipal securities rated investment grade (Baa/BBB) at the time of investment, or, if they are unrated, are judged by the manager to be of comparable quality. It may invest up to 20% of managed assets in municipal securities that are not exempt from New Jersey state income taxes if the manager believes doing so would enhance the Fund's after-tax total returns. It invests in sectors, including healthcare, education and civic organizations, transportation, tax obligation/general, consumer staples and utilities. Its investment advisor is Nuveen Fund Advisors, LLC."}, {"sector": "n/a", "name": "Nuveen Pennsylvania Municipal Value Fund", "exchange": "AMEX", "symbol": "NPN", "beta": "", "industry": "n/a", "description": "Naspers Limited is a global Internet and entertainment company, and a technology investor. The Company operates platforms in Internet, video entertainment and media sectors. The Company's segments include Internet, Video entertainment, Media and Corporate services. The Company has built various products and services, such as OLX, Avito, letgo, Allegro, eMAG, Flipkart, PayU, MultiChoice, ShowMax, Movile, SimilarWeb and Media24. The Company operates platforms that offer environments to communicate, entertain and shop to customers. Its e-commerce services span general and vertical classifieds; business to consumer (B2C); specialized online services, such as travel and food delivery, and payments platforms. The Company operates in approximately 130 countries. It offers e-commerce platforms, including consumer to consumer (C2C), B2C, Payments and Naspers Ventures, and Listed investments, including Tencent and Mail.ru."}, {"sector": "Health Care", "name": "OncoCyte Corporation", "exchange": "AMEX", "symbol": "OCX", "beta": "", "industry": "Biotechnology: In Vitro & In Vivo Diagnostic Substances", "description": "OncoCyte Corporation is a development-stage biotechnology company focused in the field of regenerative medicine. The Company is developing molecular cancer diagnostics utilizing a discovery platform that focuses on identifying genetic markers expressed in various types of cancer. It operates through the research and development of diagnostic tests for the detection of cancer segment. Its initial focus will be confirmatory diagnostics, utilizing liquid biopsy technology, for use in conjunction with imaging to confirm initial diagnoses within certain oncology indications. In addition, it will be developing screening diagnostics as replacements for screening imaging procedures. For some indications, it will also be pursuing the probability of recurrence of a specific cancer through the development of prognostics or companion diagnostics that help a physician determine which therapy is the optimal treatment for the patient. It offers diagnostic tests for lung, breast and bladder cancer."}, {"sector": "Health Care", "name": "Oragenics, Inc.", "exchange": "AMEX", "symbol": "OGEN", "beta": "1.24", "industry": "Major Pharmaceuticals", "description": "Oragenics, Inc. develops, markets and sells probiotics specifically designed to enhance oral health for humans and pets, under the brand names Evora and ProBiora. The Company is focused on offering antibiotics against infectious disease and on developing treatments for oral mucositis. It is engaged in developing its antibiotic product candidate, MU1140, as well as other homolog antibiotic product candidates; researching AG013 in connection with the treatment of Oral Mucositis; commercializing its ProBiora3 probiotic products, and has other product candidates for out licensing or partnering. MU1140 is an antibiotic that is produced by the parent of the SMaRT strain. ProBiora3 is a blend of three naturally occurring strains of beneficial bacteria, including Streptococcus oralis KJ3, Streptococcus uberis KJ2 and Streptococcus rattus JH145. LPT3-04 is a compound, which is consumed in the human diet in small amounts and results in dose-dependent weight loss in experimental animal models."}, {"sector": "Basic Industries", "name": "Orchids Paper Products Company", "exchange": "AMEX", "symbol": "TIS", "beta": "0.90", "industry": "Paper", "description": "Orchids Paper Products Company is a supplier of consumer tissue products. The Company produces bulk tissue paper, known as parent rolls, and converts parent rolls into finished products, including paper towels, bathroom tissue and paper napkins. The Company offers customers a range of private label products across the value, premium and ultra-premium market segments. The Company sells its products to grocery stores, grocery wholesalers and cooperatives, convenience stores, janitorial supply stores and stores in the food service market. The Company's products are sold primarily under its customers' private labels and, to a lesser extent, under its brand names, such as Orchids Supreme, Clean Scents, Tackle, Colortex, My Size, Velvet and Big Mopper. The Company sells its products under private labels to its core customer base in the at home market, which consists primarily of dollar stores, discount retailers and grocery stores that offer alternatives across a range of products."}, {"sector": "Consumer Durables", "name": "Orient Paper, Inc.", "exchange": "AMEX", "symbol": "ONP", "beta": "0.53", "industry": "Containers/Packaging", "description": "Orient Paper, Inc. is a holding company for the Hebei Baoding Orient Paper Milling Company Limited (Orient Paper HB), a producer and distributor of paper products in China. The Company is engaged in production and distribution of four categories of paper products: corrugating medium paper (CMP), offset printing paper, digital photo paper and tissue paper products. The Company, through Baoding Shengde Paper Co., Ltd. (Orient Paper Shengde), is engaged in production and distribution of digital photo paper. The Company operates through two segments: Orient Paper HB, which produces printing paper and CMP, and Orient Paper Shengde, which produces digital photo paper. CMP is used in the manufacturing of cardboard. The Company has over two corrugating medium paper production lines, including PM6 and PM1. The Company also produces finished tissue paper products that are marketed and sold under the Orient Paper brand."}, {"sector": "Consumer Services", "name": "Owens Realty Mortgage, Inc.", "exchange": "AMEX", "symbol": "ORM", "beta": "", "industry": "Real Estate Investment Trusts", "description": "Ormonde Mining PLC is an Ireland-based mineral resource company. The Company is engaged in acquisition, exploration and development of mineral resource projects in Spain. The Company's primary focus is the advancement of the Barruecopardo Project. The Barruecopardo project is located in the Salamanca Province, Castilla y Leon Region, Western Spain, approximately 70 kilometers west of the city of Salamanca and over 350 kilometers west-north west of Madrid. The mining concession over Barruecopardo covers an area of approximately six square kilometers. The Company owns a mining concession at La Zarza, which covers a polymetallic massive sulfide body dominated by pyrite but containing zones of copper, zinc and gold mineralization. Its gold properties are located at Salamanca and Zamora Provinces, Castilla y Leon Region, Western Spain. Its gold properties include Peralonso Gold Prospect, Cabeza de Caballo Gold Prospect and Pino de Oro Gold Project."}, {"sector": "n/a", "name": "Pacific Gas & Electric Co.", "exchange": "AMEX", "symbol": "PCG^A", "beta": "0.22", "industry": "n/a", "description": "PG&E Corporation is a holding company. The Company's primary operating subsidiary is Pacific Gas and Electric Company (the Utility), which operates in northern and central California. The Utility is engaged in the sale and delivery of electricity and natural gas to customers. The Utility generates electricity and provides electricity transmission and distribution services throughout its service territory in northern and central California to residential, commercial, industrial, and agricultural customers. The Utility provides bundled services (electricity, transmission and distribution services) to various customers in its service territory. As of December 31, 2016, the Utility owned approximately 18,400 circuit miles of interconnected transmission lines operating at voltages ranging from 60 kilovolt to 500 kilovolt. As of December 31, 2016, the Utility also operated 92 electric transmission substations with a capacity of approximately 64,600 megavolt ampere (MVA)."}, {"sector": "n/a", "name": "Pacific Gas & Electric Co.", "exchange": "AMEX", "symbol": "PCG^B", "beta": "0.22", "industry": "n/a", "description": "PG&E Corporation is a holding company. The Company's primary operating subsidiary is Pacific Gas and Electric Company (the Utility), which operates in northern and central California. The Utility is engaged in the sale and delivery of electricity and natural gas to customers. The Utility generates electricity and provides electricity transmission and distribution services throughout its service territory in northern and central California to residential, commercial, industrial, and agricultural customers. The Utility provides bundled services (electricity, transmission and distribution services) to various customers in its service territory. As of December 31, 2016, the Utility owned approximately 18,400 circuit miles of interconnected transmission lines operating at voltages ranging from 60 kilovolt to 500 kilovolt. As of December 31, 2016, the Utility also operated 92 electric transmission substations with a capacity of approximately 64,600 megavolt ampere (MVA)."}, {"sector": "n/a", "name": "Pacific Gas & Electric Co.", "exchange": "AMEX", "symbol": "PCG^C", "beta": "0.22", "industry": "n/a", "description": "PG&E Corporation is a holding company. The Company's primary operating subsidiary is Pacific Gas and Electric Company (the Utility), which operates in northern and central California. The Utility is engaged in the sale and delivery of electricity and natural gas to customers. The Utility generates electricity and provides electricity transmission and distribution services throughout its service territory in northern and central California to residential, commercial, industrial, and agricultural customers. The Utility provides bundled services (electricity, transmission and distribution services) to various customers in its service territory. As of December 31, 2016, the Utility owned approximately 18,400 circuit miles of interconnected transmission lines operating at voltages ranging from 60 kilovolt to 500 kilovolt. As of December 31, 2016, the Utility also operated 92 electric transmission substations with a capacity of approximately 64,600 megavolt ampere (MVA)."}, {"sector": "n/a", "name": "Pacific Gas & Electric Co.", "exchange": "AMEX", "symbol": "PCG^H", "beta": "0.22", "industry": "n/a", "description": "PG&E Corporation is a holding company. The Company's primary operating subsidiary is Pacific Gas and Electric Company (the Utility), which operates in northern and central California. The Utility is engaged in the sale and delivery of electricity and natural gas to customers. The Utility generates electricity and provides electricity transmission and distribution services throughout its service territory in northern and central California to residential, commercial, industrial, and agricultural customers. The Utility provides bundled services (electricity, transmission and distribution services) to various customers in its service territory. As of December 31, 2016, the Utility owned approximately 18,400 circuit miles of interconnected transmission lines operating at voltages ranging from 60 kilovolt to 500 kilovolt. As of December 31, 2016, the Utility also operated 92 electric transmission substations with a capacity of approximately 64,600 megavolt ampere (MVA)."}, {"sector": "Health Care", "name": "Palatin Technologies, Inc.", "exchange": "AMEX", "symbol": "PTN", "beta": "1.48", "industry": "Major Pharmaceuticals", "description": "Palatin Technologies, Inc. is a biopharmaceutical company. The Company is engaged in developing targeted, receptor-specific peptide therapeutics for the treatment of diseases with significant unmet medical need and commercial potential. Its programs are based on molecules that modulate the activity of the melanocortin and natriuretic peptide receptor systems. The Company's primary product in clinical development is bremelanotide for the treatment of premenopausal women with hypoactive sexual desire disorder (HSDD), which is a type of female sexual dysfunction (FSD) defined as low desire with associated distress. Its other drug development programs include Melanocortin receptor-4 (MC4r), PL-3994 and Melanocortin receptor-1 (MC1r). MC4r is a compound used for treatment of obesity and diabetes. PL-3994 is a subcutaneously injected guanylate-cyclase type A (GC-A) receptor agonist. MC1r agonist peptides are used for treatment of inflammatory and dermatologic disease indications."}, {"sector": "Technology", "name": "Pareteum Corporation", "exchange": "AMEX", "symbol": "TEUM", "beta": "0.83", "industry": "EDP Services", "description": "Pareteum Corporation, formerly Elephant Talk Communications Corporation, develops Communications Cloud Services Platform. The Company provides mobility, messaging and security services and applications, with a single-sign-on, application program interface (API) and software development suite. Its platform hosts integrated information technology (IT)/Back Office and Core Network functionality for mobile network operators, and for enterprises implement and leverage mobile communications solutions on a outsourced Software as a Service, Platform as a Service and/or Infrastructure as a Service basis: made available either as an on-premise solution or as a hosted service in the Cloud depending on the needs of its customers. It also delivers an Operational Support System (OSS) for channel partners, with APIs for integration with third party systems, workflows for complex application orchestration, customer support with branded portals and plug-ins for a multitude of other applications."}, {"sector": "Finance", "name": "Park National Corporation", "exchange": "AMEX", "symbol": "PRK", "beta": "0.76", "industry": "Major Banks", "description": "Park National Corporation (Park) is a financial holding company. Park's principal business consists of owning and supervising its subsidiaries. Park's banking operations are conducted through The Park National Bank (Park National Bank). Its segments include Park National Bank, Guardian Financial Services Company (Guardian Finance) and SE Property Holdings, LLC (SEPH). Park National Bank is a national banking association with its main office in Newark, Ohio and financial service offices in Ashland, Athens, Butler, Champaign, Clark, Clermont, Coshocton, Crawford, Darke, Hocking, Holmes, Knox, Licking, Madison, Marion, Mercer, Miami, Morrow, Muskingum, Perry, Richland, Tuscarawas, Warren and Wayne Counties in Ohio. Guardian Finance provides consumer finance services in the central Ohio area. SEPH has operations in Ohio, with the sole purpose of such operations being to sell other real estate owned and work out or sell problem loan situations with the respective borrowers."}, {"sector": "Energy", "name": "Pedevco Corp.", "exchange": "AMEX", "symbol": "PED", "beta": "-1.84", "industry": "Oil & Gas Production", "description": "PEDEVCO Corp. is an energy company, which is engaged in the acquisition, exploration, development and production of oil and natural gas shale plays in the Denver-Julesberg Basin (D-J Basin) in Colorado. The D-J Basin contains hydrocarbon bearing deposits in several formations, including the Niobrara, Codell, Greenhorn, Shannon, J-Sand and D-Sand. The Company's operating properties are located in the Wattenberg, Wattenberg Extension and Niobrara formation in the D-J Basin. It holds over 16,160 net D-J Basin acres located in Weld and Morgan Counties, Colorado through its subsidiary, Red Hawk Petroleum, LLC, which acreage is located in the Wattenberg and Wattenberg Extension areas of the D-J Basin that it refers to as D-J Basin Asset. It holds interest in Caspian Energy, Inc., which holds a working interest in production and exploration licenses for an oil and gas producing asset, which covers an area of approximately 380,000 acres and is located in the Pre-Caspian Basin in Kazakhstan."}, {"sector": "Health Care", "name": "Pfenex Inc.", "exchange": "AMEX", "symbol": "PFNX", "beta": "4.25", "industry": "Major Pharmaceuticals", "description": "Pfenex Inc. is a clinical-stage biotechnology company. The Company is engaged in the development of biosimilar and therapeutic equivalent products to branded therapeutics and other high-value and difficult-to-manufacture proteins. Its lead product candidate is PF582, a biosimilar candidate to Lucentis (ranibizumab). Its next advanced product candidates are PF530 and PF708. PF530 is a biosimilar candidate to Betaseron (interferon beta-1b). PF708 is being developed as a therapeutically equivalent peptide to Forteo (teriparatide), which is for the treatment of osteoporosis. In addition to its three advanced product candidates, its pipeline includes over four other biosimilar candidates, as well as vaccines and next generation biologic candidates. Its product candidates are enabled by its protein production platform, Pfenex Expression Technology. It is also developing Px563L, an anthrax vaccine candidate, and Px533 as a prophylactic vaccine candidate against malaria infection."}, {"sector": "Basic Industries", "name": "Platinum Group Metals Ltd.", "exchange": "AMEX", "symbol": "PLG", "beta": "3.06", "industry": "Precious Metals", "description": "Platinum Group Metals Ltd. is an exploration- and development-stage Company. The Company is focused on exploration and development of platinum. The Company conducts work on mineral properties it has staked or acquired by way of option agreements in the Republic of South Africa and in Canada. Its business is focused on production ramp up at the Maseve Mine, and the exploration and initial engineering on the Waterberg platinum deposit, which includes the Waterberg Joint Venture Project (the Waterberg JV Project) and the adjoining Waterberg Extension Project. The Company has operations in South Africa and Canada. The Maseve platinum mine site is located on the Western Limb of the Bushveld Complex approximately 35 kilometers north west of the town of Rustenburg. The Waterberg JV Project consists of a contiguous granted prospecting right area of approximately 255 square kilometers located on the Northern Limb of the Bushveld Complex, over 70 kilometers north of the town of Mokopane."}, {"sector": "Basic Industries", "name": "Polymet Mining Corp.", "exchange": "AMEX", "symbol": "PLM", "beta": "1.05", "industry": "Precious Metals", "description": "PolyMet Mining Corp. (PolyMet) is a development-stage company. The Company is engaged in the exploration and development of natural resource properties. The Company's sole mineral property is the NorthMet Project, which is located in St. Louis County in the Mesabi Iron Range mining district approximately 60 miles north of Duluth, Minnesota, the United States. The NorthMet Project consists of NorthMet copper-nickel-precious metals ore body, and the Erie Plant, a processing facility located approximately six miles from the ore body. The NorthMet Project covers a total of approximately 16,700 acres or over 25.9 square miles. The NorthMet mine site totals approximately 4,300 acres or over 6.5 square miles of leased mineral rights and the Erie Plant site totals approximately 12,400 acres or over 19.4 square miles of freehold land. The Erie Plant consists of crushing, grinding and milling facility."}, {"sector": "Consumer Services", "name": "Power REIT", "exchange": "AMEX", "symbol": "PW", "beta": "-0.06", "industry": "Real Estate Investment Trusts", "description": "Power REIT is a real estate investment trust (REIT) that holds, develops, acquires and manages real estate assets related to transportation and energy infrastructure in the United States. The Company, within the transportation and energy infrastructure sectors, is focused on making new acquisitions of real estate that are or will be leased to renewable energy generation projects, such as utility-scale solar farms and wind farms. It is structured as a holding company and owns its assets through its subsidiaries. Its assets include approximately 112 miles of railroad infrastructure and related real estate, which is owned by its subsidiary Pittsburgh & West Virginia Railroad (P&WV) and approximately 601 acres of fee simple land leased to a range of solar power generating projects with an aggregate generating capacity of approximately 108 Megawatts (MW). It is engaged in expanding its portfolio of real estate related to renewable energy generation projects."}, {"sector": "Health Care", "name": "Protalix BioTherapeutics, Inc.", "exchange": "AMEX", "symbol": "PLX", "beta": "0.88", "industry": "Biotechnology: Biological Products (No Diagnostic Substances)", "description": "Protalix BioTherapeutics, Inc. is a biopharmaceutical company. The Company is focused on the development and commercialization of recombinant therapeutic proteins based on its ProCellEx protein expression system (ProCellEx). The Company has developed taliglucerase alfa (marketed under the name Uplyso in Brazil and certain other Latin American countries and Elelyso in the rest of the territories) for the treatment of Gaucher disease that has been approved for marketing in the United States, Brazil, Israel and other markets. The Company's product pipeline includes PRX-102 for the treatment of Fabry disease; AIR DNase (PRX-110) for Cystic Fibrosis, and Oral Anti-TNF (OPRX-106) Anti Inflammatory. PRX-102 or alpha-GAL-A is an enzyme replacement therapy product for the treatment of Fabry disease. AIR DNase is a plant cell recombinant human Deoxyribonuclease 1. Oral Anti-TNF represents a mode of administering a recombinant anti-TNF protein."}, {"sector": "Transportation", "name": "Radiant Logistics, Inc.", "exchange": "AMEX", "symbol": "RLGT", "beta": "0.85", "industry": "Oil Refining/Marketing", "description": "Radiant Logistics, Inc. operates as a third-party logistics company, providing multi-modal transportation and logistics services. The Company is organized in two geographic operating segments: United States and Canada. Its transportation services for both the United States and Canada segments are placed into categories of freight forwarding and freight brokerage services. The Company services an account base consisting of consumer goods, food and beverage, manufacturing and retail customers, which the Company supports from a network of operating locations, as well as an integrated international service partner network. As of June 30, 2016, it provided these services through a multi-brand network, including 18 Company-owned offices. As of June 30, 2016, it had approximately 10,000 asset-based transportation companies, including motor carriers, railroads, airlines and ocean lines in its carrier network. Its brands include Radiant, Wheels, Airgroup, Adcom, DBA and Service By Air."}, {"sector": "n/a", "name": "Radiant Logistics, Inc.", "exchange": "AMEX", "symbol": "RLGT^A", "beta": "0.30", "industry": "n/a", "description": "Radiant Logistics, Inc. operates as a third-party logistics company, providing multi-modal transportation and logistics services. The Company is organized in two geographic operating segments: United States and Canada. Its transportation services for both the United States and Canada segments are placed into categories of freight forwarding and freight brokerage services. The Company services an account base consisting of consumer goods, food and beverage, manufacturing and retail customers, which the Company supports from a network of operating locations, as well as an integrated international service partner network. As of June 30, 2016, it provided these services through a multi-brand network, including 18 Company-owned offices. As of June 30, 2016, it had approximately 10,000 asset-based transportation companies, including motor carriers, railroads, airlines and ocean lines in its carrier network. Its brands include Radiant, Wheels, Airgroup, Adcom, DBA and Service By Air."}, {"sector": "n/a", "name": "Reaves Utility Income Fund", "exchange": "AMEX", "symbol": "UTG", "beta": "0.64", "industry": "n/a", "description": "Reaves Utility Income Fund (the Fund) is closed-end management investment company. The Fund's investment objective is to provide a high level of after-tax income and total return consisting primarily of tax-advantaged dividend income and capital appreciation. The Fund intends to invest approximately 80% of its total assets in dividend-paying common and preferred stocks and debt instruments of companies within the utility industry. Approximately 20% of its remaining assets may be invested in other securities, including stocks, money market instruments and debt instruments, as well as certain derivative instruments in the utility industry or other industries. The Fund invests in various sectors, including multi-utilities; electric utilities; telecommunication services; media; oil, gas and consumable fuels; real estate investment trusts; road and rail; wireless telecommunication services; food products, and gas utilities. Reaves Asset Management is the Fund's investment advisor."}, {"sector": "Consumer Non-Durables", "name": "Reeds, Inc.", "exchange": "AMEX", "symbol": "REED", "beta": "0.70", "industry": "Beverages (Production/Distribution)", "description": "Reed's, Inc. develops, manufactures, markets and sells natural non-alcoholic carbonated soft drinks, Kombucha, candies and ice creams. The Company manufactures, licenses, markets and sells several product lines, such as Reed's Ginger Brews; Virgil's Root Beer, Cream Sodas, Dr. Better and Real Cola, including ZERO diet sodas; Culture Club Kombucha; China Colas; Reed's Ginger candy and ice creams, and Sonoma Sparkler and other juice based products. The Company sells its products throughout the United States and in select international markets. It sells products through a network of natural, gourmet and beer distributors and direct to certain large national retailers. The Company also has private label business. The Company manufactures and sells beverages and candies or other ginger related products. The Company produces carbonated beverages in multiple facilities, including a facility in Los Angeles, California, known as The Brewery."}, {"sector": "Technology", "name": "RELM Wireless Corporation", "exchange": "AMEX", "symbol": "RWC", "beta": "0.69", "industry": "Radio And Television Broadcasting And Communications Equipment", "description": "RELM Wireless Corporation (RELM) provides two-way radio communications equipment. RELM designs, manufactures and markets wireless communications products consisting of two-way land mobile radios, repeaters, base stations, and related components and subsystems. Two-way land mobile radios include units that are hand-held (portable) or installed in vehicles (mobile). The Company's P-25 digital products and the Company's analog products operate in the very high frequency (VHF) (136 megahertz-174 megahertz), ultra high frequency (UHF) (380 megahertz-470 megahertz, 450 megahertz-520 megahertz) and 700-800 megahertz bands. The Company offers products under BK Radio and RELM brand names. The Company's BK Radio-branded products consist of land-mobile radio equipment for professional radio users primarily in government, public safety and military applications. RELM's P-25 digital products are marketed under the BK Radio brand, which includes the next-generation KNG product line."}, {"sector": "n/a", "name": "RENN Fund, Inc.", "exchange": "AMEX", "symbol": "RCG", "beta": "-0.12", "industry": "n/a", "description": "RENN Fund, Inc. (the Fund) is a non-diversified, closed-end management investment company. The investment objective of the Fund is to provide its shareholders primarily with long-term capital appreciation by investing substantially in privately placed convertible and equity securities of emerging growth companies traded on the United States securities exchanges. The Fund seeks to achieve capital appreciation potential by investing in equity securities and convertible issues of small and medium size companies. It invests in various industries, including communication services; surgical and medical instruments and apparatus; telecommunications; crude petroleum and natural gas, and medical chemicals and botanical products. RENN Capital Group, Inc. is the investment advisor of the Fund."}, {"sector": "Health Care", "name": "Retractable Technologies, Inc.", "exchange": "AMEX", "symbol": "RVP", "beta": "0.47", "industry": "Medical/Dental Instruments", "description": "Retractable Technologies, Inc. designs, develops and manufactures safety medical products for the healthcare industry. The Company markets VanishPoint and PatientSafe products. The VanishPoint products are designed specifically to prevent needle stick injuries and to prevent reuse. The VanishPoint safety products include tuberculin, insulin and allergy antigen VanishPoint syringes; 0.5mL, 1mL, 2mL, 3mL, 5mL and 10mL VanishPoint syringes, and the VanishPoint autodisable syringe. It also sells the VanishPoint intravenous catheter, the VanishPoint blood collection tube holder and the VanishPoint blood collection set. The PatientSafe syringe reduces the risk of bloodstream infections resulting from catheter hub contamination. Its PatientSafe products include 3mL, 5mL, 10mL, 20mL, 30mL and 60mL syringes, and the PatientSafe Luer cap. Its product designs include retractable needle syringe designs, retractable needle designs and retractable needle dental syringe designs."}, {"sector": "Health Care", "name": "Rexahn Pharmaceuticals, Inc.", "exchange": "AMEX", "symbol": "RNN", "beta": "-0.46", "industry": "Major Pharmaceuticals", "description": "Rexahn Pharmaceuticals, Inc. is a clinical-stage biopharmaceutical company engaged in the discovery, development and commercialization of treatments for cancer. The Company's clinical-stage drug candidates in active development include Archexin, RX-3117 and Supinoxin (RX-5902). Archexin is a potent inhibitor of the protein kinase Akt-1, which focuses on cancer cell proliferation, survival, angiogenesis, metastasis and drug resistance. RX-3117 is a small molecule nucleoside compound with an anti-metabolite mechanism of action and has therapeutic potential in a range of cancers, including pancreatic, bladder, colon and lung cancer. Supinoxin is a small molecule inhibitor of phosphorylation of p68. The Company also has a drug candidate RX-21101, an N-(2-Hydroxypropyl) methacrylamide-docetaxel-folate, in pre-clinical development. The Company is working on research technologies, including multi-target aimed ligands platform and nano-based drug delivery systems."}, {"sector": "n/a", "name": "RMR Real Estate Income Fund", "exchange": "AMEX", "symbol": "RIF", "beta": "0.81", "industry": "n/a", "description": "RMR Real Estate Income Fund (the Fund) is a non-diversified closed-end management investment company. The Fund's primary investment objective is to earn and pay a high level of current income to its common shareholders. The Fund's secondary investment objective is capital appreciation. It pursues its investment objectives by investing in securities issued by real estate companies, including real estate investment trusts (REITs). The Fund's investment portfolio includes real estate investment trusts, apartments, data centers, free standing, healthcare, lodging/resorts, manufactured homes, mortgage, regional malls, shopping centers, specialty, storage and other. Under normal market conditions, the Fund's investments are concentrated in income producing common shares, preferred shares and debt securities, including convertible preferred and debt securities. The Fund's investment advisor is RMR Advisors LLC."}, {"sector": "Consumer Services", "name": "Sachem Capital Corp.", "exchange": "AMEX", "symbol": "SACH", "beta": "1.41", "industry": "Real Estate Investment Trusts", "description": "The Goldman Sachs Group, Inc. is an investment banking, securities and investment management company that provides a range of financial services to corporations, financial institutions, governments and individuals. The Company operates in four business segments: Investment Banking, Institutional Client Services, Investing & Lending, and Investment Management. The Investment Banking segment consists of financial advisory and underwriting. The Institutional Client Services segment makes markets and facilitates client transactions in fixed income, equity, currency and commodity products. The investing and lending activities, which are typically longer-term, include its investing and relationship lending activities across various asset classes, primarily debt securities and loans, public and private equity securities, infrastructure and real estate. The Investment Management segment provides investment and wealth advisory services. As of December 2016, it had offices in over 30 countries."}, {"sector": "Consumer Services", "name": "Saga Communications, Inc.", "exchange": "AMEX", "symbol": "SGA", "beta": "1.59", "industry": "Broadcasting", "description": "Saga Communications, Inc. is a broadcast company engaged in acquiring, developing and operating broadcast properties. The Company's segments are Radio, Television, and Corporate and Other. As of February 28, 2017, it owned and/or operated four television stations and five low-power television (LPTV) stations serving two markets, and 68 frequency modulation (FM) and 32 amplitude modulation (AM) radio stations serving 24 markets, including Bellingham, Washington; Columbus, Ohio; Norfolk, Virginia; Milwaukee, Wisconsin; Manchester, New Hampshire; Des Moines, Iowa, and Joplin, Missouri. As of December 31, 2016, the Radio segment included 24 markets, which includes all 99 of its radio stations. The Television segment included two markets and consists of four television stations and five (LPTV) stations, as of December 31, 2016. The radio stations that the Company owns employ a range of programming formats, including Classic Hits, Adult Contemporary, Classic Rock, News/Talk and Country."}, {"sector": "Energy", "name": "Samson Oil & Gas Limited", "exchange": "AMEX", "symbol": "SSN", "beta": "1.46", "industry": "Oil & Gas Production", "description": "Samson Oil & Gas Limited is an oil and gas company focused on oil production in the Niobrara and Bakken formations in the United States. The Company's principal activities are oil and gas exploration, development and production in the United States. Its geographic segments include United States of America and Other segments. All revenue from the United States of America segment is from customers based in the United States. The Other Segments revenue relates principally to interest income earned on cash balances in Australia. Its projects include Foreman Butte project, Roosevelt Project, North Stockyard Project, Rainbow Project, Hawk Springs Project, South Prairie Project and Cane Creek Project. Its Foreman Butte project includes various producing and non-producing, operated and non-operated wells in the Ratcliffe and Madison formations in Montana and North Dakota. The Company has an interest in over 3,303 acres adjacent to the North Stockyard Oil Field."}, {"sector": "Energy", "name": "Sanchez Midstream Partners LP", "exchange": "AMEX", "symbol": "SNMP", "beta": "-0.51", "industry": "Oil & Gas Production", "description": "Sanchez Midstream Partners LP, formerly Sanchez Production Partners LP, is focused on the acquisition, development, ownership and operation of midstream and other energy producing assets. The Company operates through two segments: the exploration and production of oil and natural gas, and the midstream business, which includes the Catarina gathering system. The Exploration and Production segment explores for and produces crude oil and natural gas. The Midstream segment operates the gathering, processing and transportation of crude oil, natural gas liquids (NGLs) and natural gas. The exploration and production business includes oil and natural gas reserves located in the Eagle Ford Shale in South Texas and in other areas of Texas and Louisiana, as well as properties in the Mid-Continent region. The Company's total estimated proved reserves total over 11.6 million barrels of oil equivalent (MMBoe). It owns approximately 1,992 net producing wells."}, {"sector": "Basic Industries", "name": "Sandstorm Gold Ltd", "exchange": "AMEX", "symbol": "SAND          ", "beta": "1.78", "industry": "Precious Metals", "description": "Las Vegas Sands Corp. is a developer of destination properties (integrated resorts) that feature accommodations, gaming, entertainment and retail, convention and exhibition facilities, celebrity chef restaurants and other amenities. The Company owns and operates integrated resorts in Asia and the United States. The Company's principal operating and developmental activities occur in three geographic areas: Macao, Singapore and the United States. In Macao, the Company's segments include The Venetian Macao; Sands Cotai Central; The Parisian Macao; Four Seasons Macao; Sands Macao, and Other Asia (comprises the Company's ferry operations and various other operations). In Singapore, the Company's segments include Marina Bay Sands. In the United States, the Company's segments include Las Vegas Operating Properties and Sands Bethlehem. The Company also offers players club loyalty programs at its properties, which provides access to rewards, privileges and members-only events."}, {"sector": "Finance", "name": "Seaboard Corporation", "exchange": "AMEX", "symbol": "SEB", "beta": "0.93", "industry": "Investment Bankers/Brokers/Service", "description": "Seaboard Corporation is an agribusiness and transportation company. The Company is primarily engaged in pork production and processing, and ocean transportation. Its divisions include Pork, Commodity Trading and Milling, Marine, Sugar, Power, Turkey and Other. Overseas, the Company is primarily engaged in commodity merchandising, grain processing, sugar production and electric power generation. The Company produces and sells frozen pork products to further processors, food service operators, grocery stores, distributors and retail outlets throughout the United States. It markets wheat, corn, soybean meal and other commodities in bulk to third parties and affiliated companies. As of December 31, 2016, its third-party agents provided cargo shipping services to 26 countries between the United States, the Caribbean Basin, and Central and South America. It sells power on the market accessed by government-owned distribution companies or partially government-owned generation companies."}, {"sector": "Capital Goods", "name": "Senseonics Holdings, Inc.", "exchange": "AMEX", "symbol": "SENS", "beta": "", "industry": "Industrial Machinery/Components", "description": "Sensys Gatso Group AB, formerly Sensys Traffic AB, is a Sweden-based company that develops, markets and sells traffic safety and traffic informatics systems to police authorities, highway authorities and private concessionaires worldwide. The systems are primarily used for recording speed and red-light violations. The Companyâ\u0080\u0099s main product is Multi-Target Tracking Radar (RS242), which enables measurement of each vehicleâ\u0080\u0099s location and speed irrespective of environmental and traffic conditions. It can be used for purposes, such as speed enforcement, red-light enforcement, traffic counting, and pantograph monitoring. Sensys Gatso Group AB also offers systems for mobile traffic enforcement, red-light enforcement, speed safety and pantograph monitoring. As of December 31, 2013, the Company had one wholly owned subsidiary, SENSYS International AB."}]