[{"sector": "Consumer Non-Durables", "name": "22nd Century Group, Inc", "exchange": "AMEX", "symbol": "XXII", "beta": "2.86", "industry": "Farming/Seeds/Milling", "description": "22nd Century Group, Inc. is a plant biotechnology company. The Company is focused on technology that allows increasing or decreasing the level of nicotine and other nicotinic alkaloids in tobacco plants, and levels of cannabinoids in cannabis plants through genetic engineering and plant breeding. It is engaged in various activities, including research and development of less harmful or modified risk tobacco products and tobacco plant varieties; development of X-22, a smoking cessation aid consisting of very low nicotine (VLN) cigarettes; manufacture, marketing and distribution of its RED SUN and MAGIC cigarettes; production of SPECTRUM research cigarettes for the National Institute on Drug Abuse (NIDA); contract manufacturing of third-party branded tobacco products, and research and development of plant varieties of hemp/cannabis, such as plants with low to no amounts of delta-9-tetrahydrocannabinol (THC), plants with high levels of cannabidiol (CBD), and other non-THC cannabinoids."}, {"sector": "n/a", "name": "Aberdeen Asia-Pacific Income Fund Inc", "exchange": "AMEX", "symbol": "FAX", "beta": "0.49", "industry": "n/a", "description": "Aberdeen Asia-Pacific Income Fund, Inc. is a non-diversified, closed-end management investment company. The Fund's principal investment objective is to seek current income. The Fund may also achieve incidental capital appreciation. To achieve its investment objectives, the Fund invests approximately 80% of its net assets, plus the amount of any borrowings for investment purposes, in Asian debt securities, Australian debt securities and New Zealand debt securities. The Fund invests in corporate bonds, government bonds, supranational and short-term investments. The Fund's investment portfolio spans across various regions, including the United States, Australia, the United Kingdom, India, Norway, Germany, the Netherlands, Bangladesh, South Korea, Philippines, Malaysia, Singapore, Thailand, Hong Kong, Indonesia, China and Sri Lanka. Aberdeen Asset Management Limited serves as the investment advisor of the Fund. Aberdeen Asset Management Asia Limited is the investment manager of the Fund."}, {"sector": "n/a", "name": "Aberdeen Australia Equity Fund Inc", "exchange": "AMEX", "symbol": "IAF", "beta": "0.85", "industry": "n/a", "description": "Aberdeen Australia Equity Fund, Inc. is a non-diversified, closed-end management investment company. The Fund's principal investment objective is long-term capital appreciation through investment primarily in equity securities of Australian companies listed on the Australian Stock Exchange Limited. Its secondary objective is current income, which is expected to be derived primarily from dividends and interest on Australian corporate and governmental securities. It invests approximately 80% of its net assets, plus the amount of any borrowings for investment purposes, in equity securities, consisting of common stock, preferred stock and convertible stock, of companies tied economically to Australia. It invests in various sectors, such as financials, materials, healthcare, utilities, energy, telecommunication services and consumer staples. Aberdeen Asset Management Limited is the investment advisor of the Fund. Aberdeen Asset Management Asia Limited is the Fund's investment manager."}, {"sector": "n/a", "name": "Aberdeen Emerging Markets Smaller Company Opportunities Fund I", "exchange": "AMEX", "symbol": "ABE           ", "beta": "", "industry": "n/a", "description": "Abertis Infraestructuras SA is a Spain-based company primarily engaged in the management of highway infrastructure. The Company's activities are divided into two business segments: Toll roads and Telecommunications. The Toll roads division focuses on construction, maintenance and operation of highways, which are located in Spain, France, Brazil, Chile, the United States and Canada, among others. The Telecommunications division manages and operates satellite infrastructure, through Hispasat, and transmission towers for mobile telephony and audiovisual broadcasting, through Cellnex Telecom. The Company controls numerous subsidiaries, such as Abertis Autopistas Espana SA, Abertis Motorways UK Ltd, Autopistas Metropolitanas de Puerto Rico and Abertis Telecom Satelites SA."}, {"sector": "n/a", "name": "Aberdeen Global Income Fund, Inc.", "exchange": "AMEX", "symbol": "FCO", "beta": "0.59", "industry": "n/a", "description": "Aberdeen Global Income Fund, Inc. (the Fund) is a closed-end, non-diversified management investment company. The Fund's principal investment objective is to provide high current income by investing primarily in fixed income securities. As a secondary investment objective, the Fund seeks capital appreciation, but only when consistent with its principal investment objective. The Fund invests in Government Bonds and Corporate Bonds. The Fund invests approximately 80% of its net assets, plus the amount of any borrowings for investment purposes, in debt securities. Approximately 60% of the Fund's total assets are invested in fixed income securities of issuers in Developed Markets or Investment Grade Developing Markets. The Fund invests approximately 40% of its total assets in fixed income securities of issuers in Developed Markets. Aberdeen Asset Management Limited is the investment advisor of the Fund. Its investment manager is Aberdeen Asset Management Asia Limited."}, {"sector": "n/a", "name": "Aberdeen Indonesia Fund, Inc.", "exchange": "AMEX", "symbol": "IF", "beta": "0.85", "industry": "n/a", "description": "Aberdeen Indonesia Fund, Inc. (the Fund) is a non-diversified closed-end, management investment company. The Fund's primary investment objective is long-term capital appreciation with income as a secondary objective, which the Fund seeks to achieve by investing primarily in Indonesian equity and debt securities. The Company invests in a range of sectors, including consumer staples, consumer discretionary, financials, materials, telecommunication services, energy, healthcare and industrials. Aberdeen Asset Managers Limited (AAML) serves as the Fund's investment advisor. AAML is a subsidiary of Aberdeen Asset Management PLC, which is the Fund's Administrator."}, {"sector": "n/a", "name": "Aberdeen Israel Fund, Inc.", "exchange": "AMEX", "symbol": "ISL", "beta": "0.60", "industry": "n/a", "description": "Aberdeen Israel Fund, Inc. (the Fund) is a non-diversified closed-end management investment company. The Fund's principal investment objective is to seek long-term capital appreciation by investing primarily in equity securities of Israeli companies. The Fund may invest up to 30% of its assets (at the time of commitment) in illiquid equity securities, including securities of private equity funds (whether in corporate or partnership form) that invest primarily in emerging markets. The Fund invests in various sectors, such as information technology, financials, healthcare, materials, consumer staples, telecommunication services, industrials, consumer discretionary. Aberdeen Asset Managers Limited (AAML) serves as the Fund's investment advisor. AAML is a subsidiary of Aberdeen Asset Management PLC, which is the Fund's Administrator."}, {"sector": "Capital Goods", "name": "Acme United Corporation.", "exchange": "AMEX", "symbol": "ACU", "beta": "0.81", "industry": "Industrial Machinery/Components", "description": "Acme United Corporation is a supplier of cutting, measuring, first aid and sharpening products to the school, home, office, hardware, sporting goods and industrial markets. The Company operates in three segments: United States (including Asian operations), Canada and Europe. Its operations in the United States, Canada and Europe are involved in product development, marketing, sales, administrative and distribution activities. Its product offerings across various segments include scissors, shears, knives, rulers, pencil sharpeners, and related products, which are sold primarily to wholesale, contract and retail stationery distributors, office supply super stores, mass market retailers, industrial distributors, school supply distributors, drug store retailers, sporting goods stores, hardware chains and wholesale florists. It markets and sells in various brands, such as Westcott brand, First Aid Only, PhysiciansCare and Pac-Kit brands."}, {"sector": "Health Care", "name": "Actinium Pharmaceuticals, Inc.", "exchange": "AMEX", "symbol": "ATNM", "beta": "42.72", "industry": "Major Pharmaceuticals", "description": "Actinium Pharmaceuticals, Inc. (Actinium) is a clinical-stage biopharmaceutical company engaged in developing cancer treatments. The Company is engaged in developing therapies for diseases using its alpha particle immunotherapy platform and other related technologies. The Company's products include Actimab-A, an antibody-drug construct containing actinium 225 (Ac-225), and Iomab-B, an antibody-drug construct containing iodine 131 (I-131). Actimab-A is in human clinical trials stage for acute myeloid leukemia (AML) and Iomab-B in clinical trial stage for use in myeloconditioning for hematopoietic stem cells transplantation (HSCT) in various indications. Its products under development are monoclonal antibodies labeled with radioisotopes. It has four product candidates in clinical trials: Actimab-A (HuM195-Ac-225), Iomab-B (BC8-I-131), BC8-Y-90 and BC8-SA. It is pursuing development of Actimab-A and Iomab-B, while BC8-Y-90 and BC8-SA are in physician sponsored clinical phase I trials."}, {"sector": "Energy", "name": "Adams Resources & Energy, Inc.", "exchange": "AMEX", "symbol": "AE", "beta": "1.32", "industry": "Oil Refining/Marketing", "description": "Adams Resources & Energy, Inc., along with its subsidiaries, is engaged in the business of crude oil marketing, tank truck transportation of liquid chemicals, and oil and gas exploration and production. The Company's segments include Marketing Segment, Transportation Segment, and Oil and Gas Segment. The Company manages its Marketing Segment through its subsidiary, Gulfmark Energy, Inc., which is engaged in marketing of crude oil. It operates approximately 210 tractor-trailer rigs and maintains over 120 pipeline inventory locations or injection stations. The Company operates its Transportation Segment, through Service Transport Company, which transports liquid chemicals. Its Service Transport Company subsidiary operates over 320 truck tractors, of which over 290 are Company-owned with over 30 independent owner-operator units. The Oil and Gas Segment operates through Adams Resources Exploration Corporation subsidiary, which explores and develops domestic oil and natural gas properties."}, {"sector": "Health Care", "name": "Adcare Health Systems Inc", "exchange": "AMEX", "symbol": "ADK", "beta": "0.96", "industry": "Hospital/Nursing Management", "description": "AdCare Health Systems, Inc., through its subsidiaries, is a self-managed real estate investment company that invests in real estate purposed for long-term care and senior living. The Company's business principally consists of leasing and subleasing such facilities to third-party tenants, which operate the facilities. The Company owns, leases, or manages for third parties approximately 40 facilities mainly in the Southeast. Its portfolio consists of over 30 skilled nursing facilities, approximately two assisted living facilities and an independent living facility. The Company's facilities provide a range of healthcare and related services to patients and residents, including skilled nursing and assisted living services, social services, various therapy services, and other rehabilitative and healthcare services for both long-term and short-stay patients and residents."}, {"sector": "n/a", "name": "Adcare Health Systems Inc", "exchange": "AMEX", "symbol": "ADK^A", "beta": "0.96", "industry": "n/a", "description": "AdCare Health Systems, Inc., through its subsidiaries, is a self-managed real estate investment company that invests in real estate purposed for long-term care and senior living. The Company's business principally consists of leasing and subleasing such facilities to third-party tenants, which operate the facilities. The Company owns, leases, or manages for third parties approximately 40 facilities mainly in the Southeast. Its portfolio consists of over 30 skilled nursing facilities, approximately two assisted living facilities and an independent living facility. The Company's facilities provide a range of healthcare and related services to patients and residents, including skilled nursing and assisted living services, social services, various therapy services, and other rehabilitative and healthcare services for both long-term and short-stay patients and residents."}, {"sector": "Technology", "name": "AeroCentury Corp.", "exchange": "AMEX", "symbol": "ACY", "beta": "-0.64", "industry": "Diversified Commercial Services", "description": "AeroCentury Corp. acquires used regional aircraft and aircraft engines for lease to regional carriers all over the world. The Company's segment is leasing of regional aircraft to foreign and domestic regional airlines. The business of the Company is managed by JetFleet Management Corp. (JMC), an integrated aircraft management, marketing and financing business. JMC is a subsidiary of JetFleet Holding Corp (JHC). The Company has been engaged in the business of investing in used regional aircraft equipment leased to foreign and domestic regional air carriers. The Company owns regional aircraft and engines, which are leased to customers under triple net leases with terms that are less than the useful life of the assets. The Company's aircraft and aircraft engines that were on lease or held for lease includes turboprop aircraft, regional jet aircraft and engines."}, {"sector": "Capital Goods", "name": "Air Industries Group", "exchange": "AMEX", "symbol": "AIRI", "beta": "0.25", "industry": "Military/Government/Technical", "description": "Air Industries Group is an aerospace and defense company. The Company manufactures and designs structural parts and assemblies that focus on flight safety, including landing gear, arresting gear, engine mounts, flight controls, throttle quadrants, jet engines and other components. The Company operates in three segments: Complex Machining, Aerostructures and Electronics and Turbine Engine Components. The Complex Machining segment consists of Air Industries Machining, Corp. and Nassau Tool Works, Inc. The Aerostructures and Electronics segment consists of Welding Metallurgy, Inc., Woodbine Products, Inc., Miller Stuart, Inc., Eur-Pac Corporation, Electronic Connection Corporation and Compac Development Corporation. The Turbine Engine Components segment consists of AMK Welding, Inc. and The Sterling Engineering Corporation, which makes components for jet engines and ground turbines. The Company also provides sheet metal fabrication of aerostructures, tube bending and welding services."}, {"sector": "Basic Industries", "name": "Alexco Resource Corp", "exchange": "AMEX", "symbol": "AXU", "beta": "-0.25", "industry": "Precious Metals", "description": "Alexco Resource Corp. (Alexco) operates two businesses: a mining business, consisting of mineral exploration and mine development and operation in Canada, located in Yukon Territory, and through its Alexco Environmental Group (AEG), an environmental services business, providing consulting, remediation solutions and project management services in respect of environmental permitting and compliance and site remediation, in Canada and the United States. The Company's principal mining business activities are being carried out within the Keno Hill Silver District (KHSD) in Yukon Territory. The KHSD project is located near the village of Keno City, approximately 350 kilometers north of Whitehorse, Yukon. The KHSD property comprises the Flame & Moth, Bellekeno and Lucky Queen deposits, as well as the Onek, Bermingham properties and Elsa Tailings properties. It holds various other property interests within KHSD, including Silver King, Husky and McQuesten, and other properties."}, {"sector": "Basic Industries", "name": "Alio Gold Inc.", "exchange": "AMEX", "symbol": "ALO", "beta": "-0.97", "industry": "Precious Metals", "description": "Alio Gold Inc, formerly Timmins Gold Corp, is a Canada-based gold producer engaged in the operation, development, exploration and acquisition of resource properties in Mexico through its subsidiaries, Timmins Goldcorp Mexico, S.A. de C.V. and Molimentales del Noroeste, S.A. de C.V. (MdN). MdN owns the San Francisco Mine in Sonora, Mexico. MdN also owns the Caballo Blanco Property, an exploration and evaluation asset in Veracruz, Mexico. The Mine and the La Chicharra pit are collectively known as the Gold Property. The Company also holds the Ana Paula gold project, which is an advanced stage development project in the Guerrero Gold Belt. The Guerrero Gold Belt project consists of over two claims totaling approximately 4,200 hectares at the north-west end of the Guerrero Gold Belt, with approximately 38,000 additional hectares in the surrounding area. Ana Paula is located in the north central part of the State of Guerrero in southern Mexico, 180 kilometers from Mexico City."}, {"sector": "Basic Industries", "name": "Almaden Minerals, Ltd.", "exchange": "AMEX", "symbol": "AAU", "beta": "-0.55", "industry": "Precious Metals", "description": "Almaden Minerals Ltd. is exploration- and development-stage company and is engaged in the exploration and development of exploration and evaluation properties in Canada, the United States and Mexico. The Company is engaged in the business of the acquisition of mineral properties. Its principal property interest includes the Tuligtic Property/Project-Mexico. It has interest in ATW Resources Ltd. (ATW) that holds title in trust for the ATW project. It holds an interest in the Logan property located in the Yukon Territory, Canada. It has approximately two subsidiaries, including Puebla Holdings Inc., which is a holding company and Minera Gorrion, S.A. de C.V., which is an exploration company. Its Ixtaca deposit, the epithermal gold-silver target within the Tuligtic Property, is located approximately eight kilometers northwest of the town of San Francisco Ixtacamaxtitlan. The Company has not generated any revenues from its operations."}, {"sector": "Health Care", "name": "Alpha Pro Tech, Ltd.", "exchange": "AMEX", "symbol": "APT", "beta": "1.06", "industry": "Industrial Specialties", "description": "ALPHA PRO TECH, LTD. (Alpha Pro Tech) is in the business of protecting people, products and environments. The Company is engaged in developing, manufacturing and marketing a line of disposable protective apparel and infection control products for the cleanroom, industrial, pharmaceutical, medical and dental markets through its subsidiary, Alpha Pro Tech, Inc. Its products are grouped into three segments: Building Supply, which consists of construction weatherization products, such as housewrap and synthetic roof underlayment, as well as other woven material; Disposable Protective Apparel, which consists of disposable protective apparel, such as shoecovers, bouffant caps, gowns, coveralls, lab coats, frocks and other miscellaneous products, and Infection Control, which consists of face masks and eye shields. The Company also manufactures a line of building supply construction weatherization products through its subsidiary, Alpha ProTech Engineered Products, Inc."}, {"sector": "Finance", "name": "Altisource Asset Management Corp", "exchange": "AMEX", "symbol": "AAMC", "beta": "2.90", "industry": "Real Estate", "description": "Altisource Asset Management Corporation provides asset management and corporate governance services to institutional investors. The Company's primary client is Altisource Residential Corporation (Residential). The Company operates through segment, which is focused on providing asset management and certain corporate governance services to Residential. Its business strategy is to provide asset management services to Residential to generate cash available for distribution to its shareholders and thereby growing its earnings, and develop additional investment strategies and vehicles. Residential is a public real estate investment trust (REIT) that acquires and manages single-family rental properties by acquiring sub-performing and non-performing mortgage loans throughout the United States. In addition to providing services to Residential, it also provides management services to NewSource Reinsurance Company Ltd., which is an insurance and reinsurance company."}, {"sector": "Consumer Non-Durables", "name": "AMCON Distributing Company", "exchange": "AMEX", "symbol": "DIT", "beta": "0.33", "industry": "Food Distributors", "description": "AMCON Distributing Company (AMCON) and its subsidiaries are engaged in the wholesale distribution of consumer products in the Central, Rocky Mountain, and Southern regions of the United States. The Company has two segments: wholesale distribution segment (Wholesale segment) and retail health food segment (Retail Segment). The Wholesale Segment offers retailers the ability to utilize manufacturer- and Company-sponsored sales and marketing programs, merchandising and product category management services. Its Retail Segment has conventional, natural, gourmet and specialty food markets, mass and discount retailers, health food stores, dietary supplement retailers and drug stores, among others. As of September 30, 2016, it operated 16 health food retail stores, six retail health food stores in Florida under the name Chamberlin's Market & Cafe and 10 in the Midwest under the name Akin's Natural Foods Market."}, {"sector": "Consumer Non-Durables", "name": "American Lorain Corporation", "exchange": "AMEX", "symbol": "ALN", "beta": "0.47", "industry": "Packaged Foods", "description": "American Lorain Corporation is a food manufacturing company. The Company develops, manufactures and sells a range of food products, including Chestnut products, Convenience foods and Frozen food products. The Company operates through three segments: Chestnut products, Convenience food products and Frozen food products. The Company manufactures its products in approximately six facilities in China. The Company has four types of product lines: deep-freezing lines, which are used to freeze raw materials for year-round production and to produce frozen food; Canning lines, which are used to produce canned products, including chestnut products; Convenience food lines, which are used for producing ready-to-cook (RTC) food products, ready-to-eat (RTE) food products and meals ready-to- eat (MRE) food products, all of which have nitrogen preservation capacity, and Chinese doughnuts lines, which are used to produce Chinese doughnut products."}, {"sector": "Health Care", "name": "American Shared Hospital Services", "exchange": "AMEX", "symbol": "AMS", "beta": "0.64", "industry": "Medical Specialities", "description": "American Shared Hospital Services provides Gamma Knife stereotactic radiosurgery equipment and radiation therapy and related equipment to approximately 20 medical centers in approximately 20 states in the United States. The Company provides Gamma Knife services through its over 81% indirect interest in GK Financing, LLC (GKF). The Company's business is the outsourcing of stereotactic radiosurgery services and radiation therapy services. The Company provides the equipment, as well as planning, installation, reimbursement and marketing support services. The Company's radiation therapy business consists of one Image Guided Radiation Therapy Operations (IGRT) system. IGRT technology integrates imaging and detection components into a linear accelerator, allowing clinicians to plan treatment, verify positioning and deliver treatment with a single device, providing radiation therapy with less damage to healthy tissue. It is also engaged in proton beam radiation therapy business (PBRT)."}, {"sector": "Health Care", "name": "Ampio Pharmaceuticals, Inc.", "exchange": "AMEX", "symbol": "AMPE", "beta": "0.36", "industry": "Major Pharmaceuticals", "description": "Ampio Pharmaceuticals, Inc. is a biopharmaceutical company. The Company is focused primarily on the development of therapies to treat prevalent inflammatory conditions for which there are limited treatment options. The Company's two lead product candidates in development are Ampion for osteoarthritis of the knee and Optina for diabetic macular edema. Ampion is a sub 5000 molecular weight fraction of commercial human serum albumin (HSA). Optina is a low-dose formulation of danazol. The Ampio segment consists of its biopharmaceuticals compounds and the clinical trials associated with them. The Company is primarily developing compounds that decrease inflammation by inhibiting specific pro-inflammatory compounds by affecting specific pathways at the protein expression and at the transcription level; activating specific phosphatase or depleting available phosphate needed for the inflammation process, and decreasing vascular permeability."}, {"sector": "Health Care", "name": "AmpliPhi Biosciences Corporation", "exchange": "AMEX", "symbol": "APHB", "beta": "2.75", "industry": "Biotechnology: Biological Products (No Diagnostic Substances)", "description": "AmpliPhi Biosciences Corporation is a biotechnology company. The Company is focused on the discovery, development and commercialization of phage therapeutics. The Company is engaged in identifying, characterizing and developing naturally occurring bacteriophages with its collaboration partners in bacteriophage biology, synthetic biology and manufacturing, to develop second-generation bacteriophage products. The Company is engaged in developing these phage product candidates using a discovery and development platform, which is designed for identification, characterization and manufacturing of multiple phage therapies. Each product candidate combines several chosen phages, which target a specific disease-causing bacterial pathogen, such as staphylococcus aureus (S. aureus), Pseudomonas aeruginosa (P. aeruginosa) and clostridium difficile (C. difficile). Its product candidates include AB-SA01, AB-PA01 and AB-CD01."}, {"sector": "Health Care", "name": "Aoxing Pharmaceutical Company, Inc.", "exchange": "AMEX", "symbol": "AXN", "beta": "3.46", "industry": "Major Pharmaceuticals", "description": "Aoxing Pharmaceutical Company, Inc. is a specialty pharmaceutical company specializing in research, development, manufacturing and distribution of a range of narcotic, pain-management and addiction treatment pharmaceutical products. The Company holds approximately 140 drug production certificates covering narcotic pain-management, prescription medicines, over-the-counter (OTC) and active pharmaceutical ingredient (API) products. Its products include prescription drugs, such as Tilidine hydrochloride, Zhongtong'an and Humifuse Euphorbia Herb Tablet, and OTC drugs, such as Shanmei Capsule, Shaoshang Tincture, Yiqi Qiangshen Granule, Xiaopiling Granule, Xiongjushangqing Tablet, Juyuansuanbijia Oral Solutions, Longdanxiegan Tablet, Fenka Tablet, Shujinhuoxue Tablet, Fuketiaojing Tablet, Qingnao Jiangya Tablet, Yuanhu Pain Management Tablet, Bushenqiangshen Tablet, Baiziyangxin Pill, Qingguo Pill, Liuweidihuang Pill, Zhibaidihuang Pill, Xiaoyao Pill and Tianwangbuxin Pill."}, {"sector": "n/a", "name": "Arconic Inc.", "exchange": "AMEX", "symbol": "ARNC^", "beta": "0.90", "industry": "n/a", "description": "Arconic Inc., formerly Alcoa Inc., is engaged in lightweight metals engineering and manufacturing. The Company operates through three segments: Global Rolled Products, Engineered Products and Solutions, and Transportation and Construction Solutions. Its multi-material products, which include aluminum, titanium and nickel, are used around the world in markets, such as aerospace, automotive, commercial transportation and packaging. The Global Rolled Products segment produces a range of aluminum sheet and plate products for the aerospace, automotive, commercial transportation, brazing and industrial markets. The Engineered Products and Solutions segment develops and manufactures products for the aerospace (commercial and defense), commercial transportation and power generation end markets. The Transportation and Construction Solutions segment produces products that are used in the non-residential building and construction and commercial transportation end markets."}, {"sector": "Basic Industries", "name": "Asanko Gold Inc.", "exchange": "AMEX", "symbol": "AKG", "beta": "0.20", "industry": "Mining & Quarrying of Nonmetallic Minerals (No Fuels)", "description": "Asanko Gold Inc. is a gold producer. The Company has operations in the Republic of Ghana. The Company's segments include Canada and Ghana. The Company's principal asset is the Asanko Gold Mine (AGM) located in Ghana, West Africa. The Company's Project 5M will upgrade the plant's throughput to five metric tons per annum and expand mining operations to integrate the Esaase deposit, including the construction of a 27-kilometer overland conveyor. The Company is involved in open pit mining and conventional processing of gold ores mined in its Asanko Gold Mine in Ghana. The AGM concessions are located in the Amansie West district of the Ashanti region of Ghana. The Company holds four mining leases, as well as prospecting and reconnaissance licenses, which collectively make up the AGM and span approximately 30 kilometers strike length of the Asankrangwa Gold Belt. The Akwasiso deposit is located on the Nkran shear corridor. The Nkran Extension is located on the Nkran shear structure."}, {"sector": "Consumer Services", "name": "Ashford Inc.", "exchange": "AMEX", "symbol": "AINC", "beta": "", "industry": "Professional Services", "description": "Ashford Inc. provides asset management and advisory services to other entities, primarily within the hospitality industry. The Company operates in the segment of asset and investment management, which includes managing the day-to-day operations of Ashford Hospitality Prime, Inc. (Ashford Prime) and its subsidiaries. The Company serves as the advisor to Ashford Prime, an New York Stock Exchange (NYSE)-listed real estate investment trust (REIT) that invests primarily in high revenue per available room (RevPAR), luxury, upper-upscale and upscale hotels in gateway and resort locations. The Company also serves as the advisor to Ashford Hospitality Trust, Inc. (Ashford Trust), which is focused on investing opportunistically in the hospitality industry with a focus on upscale and upper-upscale hotels in the United States. The Company conducts its business and owns substantially all of its assets through an operating entity, Ashford Hospitality Advisors LLC (Ashford LLC)."}, {"sector": "Health Care", "name": "Asterias Biotherapeutics, Inc.", "exchange": "AMEX", "symbol": "AST", "beta": "1.56", "industry": "Biotechnology: Biological Products (No Diagnostic Substances)", "description": "Asterias Biotherapeutics, Inc. is a biotechnology company. The Company is engaged in developing and commercializing therapies in the fields of cell therapy and regenerative medicine. The Company has over two technology platforms. The first is an immunotherapy platform to teach cancer patients' immune systems to attack their tumors. The second is pluripotent stem cell platform. Pluripotent cells are a type of stem cell capable of becoming all of the cell types in the human body. From its immunotherapy platform, the Company is developing over two programs. AST-VAC1 (telomerase loaded, autologous dendritic cells), which allows patient's own cells to recognize and fight cancer cells in acute myelogenous leukemia (AML). Together with Cancer Research United Kingdom (CRUK), it is developing AST-VAC2 (telomerase loaded, -allogeneic dendritic cells), -derived from pluripotent stem cells. From its pluripotent stem cell platform, it is developing AST-OPC1, oligodendrocyte progenitor cells."}, {"sector": "n/a", "name": "Asterias Biotherapeutics, Inc.", "exchange": "AMEX", "symbol": "AST.WS", "beta": "0.24", "industry": "n/a", "description": "Western Asset/Claymore Inflation-Linked Opportunities & Income Fund is a diversified, closed-end management investment company. The Fund's investment objective is to provide current income for its shareholders. Capital appreciation is its secondary investment objective. Under normal market conditions, the Fund will invest at least 80% of its total managed assets in inflation-linked securities. It may also invest up to 40% of its total managed assets in below investment grade securities (or if unrated, assets of comparable quality as determined by management). It may invest up to 100% of its total managed assets in non-United States dollar investments, which gives the Fund flexibility to invest up to 100% of its total managed assets in non-United States dollar inflation-linked securities. Its portfolio concentration includes High Yield Corporations; Mortgage Backed Securities; Emerging Markets, and Investment Grade Corporations. Security Investors, LLC is its investment advisor."}, {"sector": "Basic Industries", "name": "Auryn Resources Inc.", "exchange": "AMEX", "symbol": "AUG", "beta": "", "industry": "Precious Metals", "description": "Augean PLC is engaged in the provision of specialist services focused on hazardous waste. The Company operates through five segments: Energy and Construction, which includes a site at Cooks Hole in Northamptonshire where minerals are extracted and also generates energy as electricity from closed landfill cells and operates over three hazardous and non-hazardous landfill operating sites; Radioactive Waste Services, which provides waste disposal services of low level radioactive wastes and naturally occurring radioactive material produced in the United Kingdom; Augean Integrated Services; which operates a High Temperature Incinerator at Sandwich, East Kent and a site in Cannock focused on Total Waste Management solutions; Augean North Sea Services, which provides waste management and waste processing services to offshore oil and gas operators, and Industry and Infrastructure, which provides specialist industrial cleaning services and operates over three waste processing sites."}, {"sector": "Public Utilities", "name": "Avalon Holdings Corporation", "exchange": "AMEX", "symbol": "AWX", "beta": "0.20", "industry": "Environmental Services", "description": "Avalon Holdings Corporation provides waste management services to industrial, commercial, municipal and governmental customers in northeastern and midwestern United States markets, captive landfill management for an industrial customer and salt water injection well operations. The Company operates through two segments. The Company's waste management services segment includes waste disposal brokerage and management services, captive landfill management operations and salt water injection well operations. The golf and related operations segment includes the operation and management of over three golf courses and related clubhouses, a hotel, fitness centers, tennis courts, spa services, dining and banquet and conference facilities and a travel agency. Its subsidiary, American Waste Management Services, Inc., assists customers with managing and disposing of wastes at various treatment and disposal sites. Its golf courses are located in Warren, Ohio, Vienna, Ohio and Sharon, Pennsylvania."}, {"sector": "Basic Industries", "name": "Avino Silver", "exchange": "AMEX", "symbol": "ASM", "beta": "-0.07", "industry": "Precious Metals", "description": "Avino Silver and Gold Mines Ltd is a Canada-based resource company. It is focused on silver, gold, and copper exploration, extraction and processing. It extracts resources and processes a bulk concentrate at the San Gonzalo Mine and a copper concentrate from the Avino Mine, both of which are located on the Avino property in Durango, Mexico. The Avino property consists of approximately 20 mineral concessions, totaling over 1,000 hectares. The Bralorne property consists of approximately 5,000 acres of mineral claims, located northeast of Vancouver, British Columbia, Canada. The Eagle Property, which covers over 500 hectares, is located in the Yukon Territory. The Olympic-Kelvin property totals approximately 600 hectares and is located on the south side of Carpenter Lake. The Minto Property is situated approximately 10 kilometers east of Goldbridge in the Bridge River gold district of British Columbia. The El Laberinto property is situated over 60 kilometers northeast of Durango, Mexico."}, {"sector": "Basic Industries", "name": "B2Gold Corp", "exchange": "AMEX", "symbol": "BTG", "beta": "0.93", "industry": "Precious Metals", "description": "B2Gold Corp. (B2Gold) is a Canada-based gold producer with approximately four operating mines and one mine under construction. The Company has a portfolio of other evaluation and exploration projects in various countries, including Mali, Colombia, Burkina Faso, Finland, Chile and Nicaragua. Its material mineral properties consist of three mines and one mine under construction: Otjikoto mine, an open pit gold mine located approximately 300 kilometers north of Windhoek, the capital of Namibia (Otjikoto Mine); Masbate mine, an open pit gold mine, located near the northern tip of the island of Masbate, over 360 kilometers south-east of Manila (Masbate Gold Project); La Libertad mine, an open pit gold mine located over 110 kilometers due east of Managua and 32 kilometers northeast of Juigalpa, Nicaragua (La Libertad Mine), and Fekola gold project, an open pit gold mine under construction located approximately 40 kilometers south of the city of Kenieba, Mali (Fekola Project)."}, {"sector": "Miscellaneous", "name": "Ballantyne Strong, Inc", "exchange": "AMEX", "symbol": "BTN", "beta": "0.34", "industry": "Industrial Machinery/Components", "description": "Ballantyne Strong, Inc. is a holding company. The Company's business activities focus on serving the cinema, retail, financial and government markets. The Company and its subsidiaries design, integrate and install technology solutions for a range of applications; develop and deliver out-of-home messaging, advertising and communications; manufacture projection screens, and provide managed services, including monitoring of networked equipment to its customers. The Company operates through two segments: Cinema and Digital Media. Its Cinema operations include the sale of digital projection equipment, screens and sound systems. Its Digital Media operations include the delivery of end-to-end digital signage solutions, video communication solutions, content creation, and management and service of digital signage and digital cinema equipment. The Company's products are distributed to the retail, financial, government and cinema markets throughout the world."}, {"sector": "Finance", "name": "Bancorp of New Jersey, Inc", "exchange": "AMEX", "symbol": "BKJ", "beta": "0.25", "industry": "Major Banks", "description": "Bancorp of New Jersey, Inc. is a bank holding company for Bank of New Jersey (the Bank). The Company's primary business is ownership and supervision of the Bank. The Company, through the Bank, conducts a traditional commercial banking business, accepting deposits from the general public, including individuals, businesses, non-profit organizations and governmental units. The Bank makes commercial loans, consumer loans, and both residential and commercial real estate loans. In addition, the Bank provides other customer services and makes investments in securities. The principal market for its deposit gathering and lending activities lies within Bergen County in New Jersey. The total loans amount to approximately $652.3 million; total securities amount to approximately $66.59 million, and total deposits amount to approximately $692.3 million. The Bank's subsidiaries include BONJ-New York Corp., BONJ-New Jersey Investment Company, BONJ-Delaware Investment Company and BONJ REIT Inc."}, {"sector": "n/a", "name": "Bancroft Fund Limited", "exchange": "AMEX", "symbol": "BCV", "beta": "0.71", "industry": "n/a", "description": "Bancroft Fund Ltd. (the Fund) is a diversified closed-end management investment company. The Fund's primary investment objective is to provide income and the potential for capital appreciation, which objectives the Fund considers to be relatively equal over the long term due to the nature of the securities in which it invests. The Fund invests primarily in convertible and equity securities. The Fund's investment portfolio includes convertible corporate bonds, convertible preferred stocks, mandatory convertible securities and common stocks. It invests in various industries, such as healthcare, computer software and services, financial services, energy and utilities, semiconductors, real estate investment trusts, communications equipment, telecommunications, business services, consumer services, cable and satellite, food and beverage, agriculture, automotive, metals and mining, entertainment and consumer products. Gabelli Funds, LLC serves as the investment advisor of the Fund."}, {"sector": "n/a", "name": "Bancroft Fund Limited", "exchange": "AMEX", "symbol": "BCV^A", "beta": "", "industry": "n/a", "description": "Bancroft Fund Ltd. (the Fund) is a diversified closed-end management investment company. The Fund's primary investment objective is to provide income and the potential for capital appreciation, which objectives the Fund considers to be relatively equal over the long term due to the nature of the securities in which it invests. The Fund invests primarily in convertible and equity securities. The Fund's investment portfolio includes convertible corporate bonds, convertible preferred stocks, mandatory convertible securities and common stocks. It invests in various industries, such as healthcare, computer software and services, financial services, energy and utilities, semiconductors, real estate investment trusts, communications equipment, telecommunications, business services, consumer services, cable and satellite, food and beverage, agriculture, automotive, metals and mining, entertainment and consumer products. Gabelli Funds, LLC serves as the investment advisor of the Fund."}, {"sector": "Basic Industries", "name": "BANRO CORPORATION", "exchange": "AMEX", "symbol": "BAA", "beta": "1.73", "industry": "Precious Metals", "description": "Banro Corp (Banro) is a Canada-based gold mining company. The Company, through its subsidiaries, holds interest in a number of gold properties, including Twangiza, Namoya, Lugushwa and Kamituga. The Company is focused on production from the Twangiza gold mine in the Democratic Republic of the Congo (DRC). The Company's properties, totaling approximately 2,000 square kilometers, are covered by a total of over 10 exploitation permits or mining licenses. The Company, through its DRC subsidiary, Banro Congo Mining SA, holds over 10 exploration permits covering an aggregate of over 2,600 square kilometers. Approximately 10 of the exploration permits are located near its Twangiza property and approximately four are located near the Namoya property. The Twangiza property is located in the South Kivu Province of the DRC, and has an area of approximately 1,000 square kilometers. Namoya consists of prospects, including Mwendamboko, Muviringu, Kakula, Namoya Summit, Seketi and Kangurube."}, {"sector": "Finance", "name": "Bar Harbor Bankshares, Inc.", "exchange": "AMEX", "symbol": "BHB", "beta": "0.81", "industry": "Major Banks", "description": "Bar Harbor Bankshares is a bank holding company. The Company's operating subsidiary, Bar Harbor Bank & Trust (the Bank), is a community bank, which offers a range of deposit, loan and related banking products, as well as brokerage services provided through a third-party brokerage arrangement. In addition, the Company offers trust and investment management services through its second tier subsidiary, Bar Harbor Trust Services, a Maine chartered non-depository trust company. The Bank offers a range of consumer financial products and services for the deposit and borrowing needs of its retail customers. The Bank's retail deposit products and services include checking accounts, interest bearing negotiable order of withdrawal accounts, money market accounts, savings accounts, club accounts, short-term and long-term certificates of deposits, health savings accounts and individual retirement accounts."}, {"sector": "Energy", "name": "Barnwell Industries, Inc.", "exchange": "AMEX", "symbol": "BRN", "beta": "1.33", "industry": "Oil & Gas Production", "description": "Barnwell Industries, Inc. is engaged in various lines of business, such as acquiring, developing, producing and selling oil and natural gas in Canada; investing in land interests in Hawaii; drilling wells, and installing and repairing water pumping systems in Hawaii, and developing homes for sale in Hawaii. The Company's segments include Oil and Natural Gas Segment; Land Investment Segment; Contract Drilling Segment, and Residential Real Estate Segment. The Company's investments in oil and natural gas properties are located in Canada, principally in the province of Alberta, with other non-producing holdings in the provinces of Saskatchewan and British Columbia. It holds interests in Kaupulehu Developments, a Hawaii general partnership. Its subsidiary, Water Resources International, Inc., drills water and water monitoring wells of varying depths in Hawaii, installs and repairs water-pumping systems, and is the distributor for Floway pumps and equipment in the state of Hawaii."}, {"sector": "Technology", "name": "BG Staffing Inc", "exchange": "AMEX", "symbol": "BGSF", "beta": "0.33", "industry": "Professional Services", "description": "BG Staffing, Inc. (BG Staffing) is a provider of temporary staffing services. The Company provides temporary workers to a range of customers that are seeking to match their workforce requirements to their business needs. Its customers operate across a diverse set of industries. The Company's operations are organized into three segments: Commercial, Multifamily and Professional. The Company's temporary staffing services consist of on-demand or short-term staffing assignments, contract staffing, and on-site management administration. Short-term staffing services assist employers in dealing with employee demands caused by such factors as seasonality, fluctuations in customer demand, vacations, illnesses, parental leave, and special projects. The Company's contract staffing services place temporary employees with customers for time-periods of more than three months or for an indefinite time period."}, {"sector": "Health Care", "name": "BioPharmX Corporation", "exchange": "AMEX", "symbol": "BPMX", "beta": "1.67", "industry": "Major Pharmaceuticals", "description": "BioPharmX Corporation is a specialty pharmaceutical company. The Company is focused on utilizing its drug delivery technologies to develop and commercialize prescription and over-the-counter (OTC) products that address markets in women's health and dermatology. Its portfolio of product candidates includes two clinical stage product candidates: BPX01, which is a topical antibiotic for the treatment of acne based on a formulation of minocycline, and BPX03, which is a molecular iodine (I2) tablet for the treatment of benign breast pain associated with fibrocystic breast condition (FBC) and cyclic mastalgia. Its VI2OLET is an OTC molecular iodine dietary supplement that addresses cyclic breast discomfort and is clinically demonstrated to alleviate the symptoms associated with FBC, including tenderness, aches and swelling. It is developing BPX02, which is an injectable utilizing biologic materials for aesthetic dermatology applications."}, {"sector": "Health Care", "name": "BioTime, Inc.", "exchange": "AMEX", "symbol": "BTX", "beta": "2.09", "industry": "Biotechnology: Biological Products (No Diagnostic Substances)", "description": "BioTime, Inc. is a clinical-stage biotechnology company focused on developing and commercializing products addressing degenerative diseases. Its clinical programs are based on two platform technologies: pluripotent stem cells and cell/drug delivery platform technologies. The foundation of its cell delivery platform is its HyStem cell and drug delivery matrix technology. Its clinical programs are targeting three primary sectors, aesthetics, ophthalmology and cell/drug delivery. Its facial aesthetics product, Renevia, is a potential treatment for facial lipoatrophy. It is in a pivotal clinical trial in Europe to assess its safety and efficacy in restoring normal skin contours in patients whose subcutaneous fat, or adipose tissue, has been lost due to the use of certain drugs often used to treat patients with human immune virus. OpRegen is its lead product for ophthalmological disorders. It is a suspension of retinal pigment epithelial cells that are derived from pluripotent stem cells."}, {"sector": "Consumer Services", "name": "Birks Group Inc.", "exchange": "AMEX", "symbol": "BGI", "beta": "3.97", "industry": "Consumer Specialties", "description": "Birks Group Inc is a Canada-based company engaged in designing, developing, making and retail of jewelry, timepieces and gifts. The Company operates through two segments: Retail and Other. The Company's Retail segment consists of all its retail operations in the United States and Canada on a combined basis. As of March 26, 2016, the Retail segment operated 27 stores across Canada under the Birks brand, 17 stores in the Southeastern United States under the Mayors brand, a store under the Rolex brand name in Orlando, as well as two retail locations in Calgary and Vancouver under the Brinkhaus brand. The Company's Other segment consists primarily of its e-commerce business, gold exchange business, which purchases gold and other precious metals from clients and refines the metals purchased, and wholesale business. The Company's merchandise includes designer jewelry, diamond, gemstone and precious metal jewelry."}, {"sector": "n/a", "name": "BlackRock Maryland Municipal Bond Trust", "exchange": "AMEX", "symbol": "BZM", "beta": "-0.19", "industry": "n/a", "description": "BlackRock Maryland Municipal Bond Trust is a non-diversified, closed-end municipal bond fund. The Trust's investment objective is to provide current income exempt from regular federal income taxes and Maryland personal income taxes. The Trust seeks to achieve its investment objective by investing primarily in municipal bonds exempt from federal income taxes (except that the interest may be subject to the federal alternative minimum tax) and Maryland personal income taxes. The Trust invests, under normal market conditions, at least 80% of its managed assets in municipal bonds that are investment grade quality at the time of investment or, if unrated, determined to be of comparable quality by the Trust's investment advisor. It invests in various sectors, including health, education, county/city/special district/school district, transportation, utility, housing, cash and derivatives, state tax-backed, corporate and tobacco. BlackRock Advisors, LLC is the investment advisor of the Trust."}, {"sector": "n/a", "name": "BlackRock Municipal Income Trust II", "exchange": "AMEX", "symbol": "BLE", "beta": "0.00", "industry": "n/a", "description": "BlackRock Municipal Income Trust II is a diversified, closed-end management investment company. The Trust's investment objective is to provide current income exempt from regular federal income tax. The Trust seeks to achieve its investment objective by investing primarily in municipal bonds exempt from federal income taxes (except that the interest may be subject to the federal alternative minimum tax). The Trust invests at least 80% of its assets in municipal bonds that are investment grade quality at the time of investment or, if unrated, determined to be of comparable quality by the investment advisor. The Trust may invest directly in such securities or synthetically through the use of derivatives. It invests in various sectors, including transportation, utilities, county/city/special district/school district, health, state tax-backed, education, corporate, tobacco, local tax-backed, prerefund/escrow and housing. BlackRock Advisors, LLC is the investment advisor of the Trust."}, {"sector": "n/a", "name": "Blackrock New Jersey Municipal Bond Trust", "exchange": "AMEX", "symbol": "BLJ", "beta": "-0.07", "industry": "n/a", "description": "BlackRock New Jersey Municipal Bond Trust is a non-diversified, closed-end municipal bond fund. The Trust's investment objective is to provide current income exempt from regular federal income tax and New Jersey gross income tax. It seeks to achieve its investment objective by investing primarily in municipal bonds exempt from federal income taxes (except that the interest may subject to the federal alternative minimum tax) and New Jersey gross income taxes. It invests at least 80% of its assets in municipal bonds that are investment grade quality at the time of investment or, if unrated, determined to be of comparable quality by the Trust's investment advisor. It may invest directly in such securities or synthetically through the use of derivatives. It invests in various sectors, including transportation, education, local tax-backed, county/city/special district/school district, state tax-backed, health, corporate and housing. Its investment advisor is BlackRock Advisors, LLC."}, {"sector": "n/a", "name": "BlackRock New York Municipal Income Trust II", "exchange": "AMEX", "symbol": "BFY", "beta": "-0.07", "industry": "n/a", "description": "Blackrock New York Municipal Income Trust II is a non-diversified, closed-end municipal bond fund. The Trust's investment objective is to provide current income exempt from regular federal income tax and New York State and New York City personal income taxes. The Trust seeks to achieve its investment objective by investing in municipal bonds exempt from federal income taxes and New York State and New York City personal income taxes. It invests at least 80% of its assets in municipal bonds that are investment grade quality at the time of investment or, if unrated, determined to be of comparable quality by the Trust's investment advisor. It may invest directly in securities or synthetically through the use of derivatives. It invests in various sectors, including county/city/special district/school district, transportation, education, utilities, health, state tax-backed, housing, corporate, local tax-backed and tobacco. BlackRock Advisors, LLC is the investment advisor of the Trust."}, {"sector": "Technology", "name": "Blonder Tongue Laboratories, Inc.", "exchange": "AMEX", "symbol": "BDR", "beta": "2.16", "industry": "Radio And Television Broadcasting And Communications Equipment", "description": "Blonder Tongue Laboratories, Inc. (Blonder Tongue), along with its subsidiary, R. L. Drake Holdings, LLC (RLD), is a technology-development and manufacturing company. The Company delivers a range of products and services to the cable entertainment and media industry. Its products are deployed in a list of locations, including lodging/hospitality, multi-dwelling units/apartments, broadcast studios/networks, universities/schools, healthcare/hospitals and airports. Blonder Tongue's products are divided into three categories: Digital Video Headend, Analog Video Headend and Hybrid-Fiber Coax (HFC) Distribution. The Digital Video Headend products (including encoders) are used by a system operator for acquisition, processing, compression, encoding and management of digital video. The Analog Video Headend products are used by a system operator for signal acquisition, processing and manipulation. The HFC Distribution products are used to transport signals from the headend to their destination."}]